{
  "chapters": [
    {
      "id": "home",
      "title": "Welcome to ENG101",
      "category": "Start Here",
      "content": "<div><p>Welcome to the digital version of ENG101: Basic English Course Materials.</p><p>This interactive coursebook is designed to help you master the fundamentals of English reading and writing. Use the navigation panel on the left to jump to any topic. You'll find the complete course text, along with interactive exercises, quizzes, and even Bengali translations for challenging words.</p><p>Select a topic from the sidebar to begin your learning journey!</p></div>"
    },
    {
      "id": "reading-comp",
      "title": "Reading Comprehension",
      "category": "Mid Term Materials",
      "content": "<div><p>Reading comprehension is the ability to process text, understand its meaning, and to integrate with what the reader already knows. It involves active and purposeful reading to extract information and draw conclusions.</p><h3>Passage 1: Life in Deserts</h3><div class=\"passage\"><p>As what geographers have estimated, about twenty percent of the earth's surface is occupied by deserts. A majority of us view deserts as one unique kind of landscape -- areas with little or no rainfall.</p><p>In actual fact, there are differences between the deserts in varying degrees. While it is common for <span class=\"translatable\">laymen</span> like us to see deserts as rocky or covered with pebbles, there are some where large sand dunes inhabit. Despite the fact that rainfall is minimal, temperatures do change in deserts, ranging from seasonal ones to daily changes where extreme hotness and coldness are experienced in the day and night.</p><p><span class=\"translatable\">Adverse</span> conditions in the deserts, especially the lack of water, have discouraged many living things from inhabiting these landscapes. Nevertheless, there are exceptionally surviving ones which through their superb tactics, have managed to live through and are still going strong. One such kind is the specialist annual plants which overcome seasonal temperature changes with their extremely short, active life cycles. In events of sudden rain, the plant seeds pullulate and grow very quickly to make full use of the rain water. Their flowers bloom and set seeds that ripen <span class=\"translatable\">promptly</span> in the hot sun too. Once the water runs dry, the mother plant dies, leaving behind the drought-resistant seeds, waiting patiently for the next rainy season to arrive.</p><p>Besides plants, there are also animals with <span class=\"translatable\">divergent</span> surviving tactics in deserts too. For instance, Skinks ( desert lizards ) metabolize stored fats in their bulbous tails, producing water to supplement their needs, just like what camels do with the stored food in their humps during long journeys through deserts. Antelopes like the addax, have very low water needs and hence are able to <span class=\"translatable\">endure</span> the conditions in deserts, extracting moisture from the food they eat.</p><p>Finally, there are the Sandgrouses (desert birds) which do not have special features to overcome the drought-like nature in deserts. To survive in these hot, dry deserts, they need to spend a large part of their time flying in search of waterholes. The truth is deserts are full of countless unique, resilient life forms.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 1</h4><p><strong>1. Choose the best answer.</strong></p><ul><li>a) What is the synonym for ‘laymen’: i) commoners / ii) experts/ iii) professionals/ iv) specialists</li><li>b) Which is the synonym for ‘adverse’: i) favorable / ii) neutral/ iii) mild/ iv) unpleasant</li><li>c) Which is the synonym for ‘divergent’: i) general / ii)similar /iii) different /iv) analogous</li><li>d) What is the antonym for ‘promptly’: i)punctually /ii) rapidly / iii) quickly/ iv) pensiveness</li><li>e) What is the antonym for ‘endure’: i) bear /ii) intolerant /iii) suffer /iv) abide</li></ul><p><strong>2. Answer the questions below.</strong></p><ol type=\"I\"><li>How do general people with no proper science knowledge think of deserts?</li><li>Describe two features of deserts’ weather condition.</li><li>How desert plants multiply in number?</li><li>How do desert lizards survive in scarcity of water?</li><li>What Sandgrouses must do during most of their daytime to find water?</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Choose the best answer:</strong><br/><strong>a)</strong> i) commoners, <strong>b)</strong> iv) unpleasant, <strong>c)</strong> iii) different, <strong>d)</strong> iv) pensiveness, <strong>e)</strong> ii) intolerant<br/><strong>2. Short Answers:</strong><br/>I. General people think of deserts as rocky or pebble-covered areas with little to no rain.<br/>II. Deserts experience extreme temperature changes, both seasonally and daily (hot days, cold nights).<br/>III. Desert plants multiply quickly after sudden rain, using the water to grow, bloom, and set drought-resistant seeds before drying up.<br/>IV. Desert lizards metabolize stored fat in their tails to produce water.<br/>V. Sandgrouses spend most of their daytime flying in search of waterholes to survive.</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage1Quiz\"></div><h3>Passage 2: Are Literate Women Better Mothers?</h3><div class=\"passage\"><p>Children in developing countries are healthier and more likely to survive past the age of five when their mothers can read and write. Experts in public health accepted this idea decades ago, but until now no one has been able to show that a woman's ability to read in itself improves her children’s chances of survival.</p><p>Most <span class=\"translatable\">literate</span> women learnt to read in primary school, and the fact that a woman has had an education may simply indicate her family’s wealth or that it values its children more highly. Now a long-term study carried out in Nicaragua has <span class=\"translatable\">eliminated</span> these factors by showing that teaching reading to poor adult women, who would otherwise have remained illiterate, has a direct effect on their children’s health and survival.</p><p>In 1979, the government of Nicaragua established a number of social programmes, including a National Literacy <span class=\"translatable\">Crusade</span> (NLC). By 1985, about 300,000 illiterate adults from all over the country, many of whom had never attended primary school, had learnt how to read, write, and use numbers.</p><p>During this period, researchers interviewed nearly 3,000 women, some of whom had learnt to read as children, some during the literacy crusade and some who had never learnt at all. The women were asked how many children they had given birth to and how many of them had died in <span class=\"translatable\">infancy</span>. The research teams also examined the surviving children to find out how well-<span class=\"translatable\">nourished</span> they were.</p><p>The Investigators' findings were striking. In the late 1970s, the infant mortality rate for the children of illiterate mothers was around 110 deaths per thousand live births. For women educated in primary school, however, the infant mortality rate was significantly lower, at 80 per thousand.</p><p>In 1985, after the NLC had ended, the infant mortality figures for those who remained illiterate and for those educated in primary school remained more or less unchanged. For those women who learnt to read through the campaign, the infant mortality rate was 84 per thousand, an impressive 21 points lower than for those women who were still illiterate. The children of the newly-literate mothers were also better nourished than those of women who could not read.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 2</h4><p><strong>1.1. Pick up the closest synonym of each of the underlined words taken from the passage:</strong></p><ul><li>Literate: (i) practiced (ii) educated (iii) measured (iv) schooled</li><li>Eliminated: (i) lightened (ii) evaluated (iii) invalidated (iv) proved</li><li>Crusade: (i) campaign (ii) war (iii) struggle (iv) period</li><li>Infancy: (i) infection (ii) teenage (iii) apathy (iv) childhood</li><li>Nourished: (i) polished (ii) grown (iii) behaved (iv) nurtured</li></ul><p><strong>1.2. Answer the questions in complete sentence/s:</strong></p><ol type=\"a\"><li>What are the common indications of the fact that a woman is educated?</li><li>In how many years the NLC in Nicaragua could literate nearly 3 lac adults?</li><li>Who were the prime target attendees of NLC in Nicaragua?</li><li>In the late 1970s, what was the infant mortality rate for mothers educated in their early ages?</li><li>After the end of NLC, what difference was found in women who learnt to read through NLC?</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1.1 Synonyms:</strong><br/>Literate: (ii) educated<br/>Eliminated: (iv) proved (in the context of eliminating factors)<br/>Crusade: (i) campaign<br/>Infancy: (iv) childhood<br/>Nourished: (iv) nurtured</p><p><strong>1.2 Short Answers:</strong><br/>a. Common indications are family wealth or a family that values its children highly.<br/>b. It took 6 years (from 1979 to 1985) for the NLC to literate nearly 3 lac adults.<br/>c. The prime target attendees were illiterate adults, many of whom had never attended primary school.<br/>d. In the late 1970s, the infant mortality rate for mothers educated in their early ages was 80 per thousand.<br/>e. The infant mortality rate for children of women who learned to read through the NLC dropped to 84 per thousand, which was significantly lower than that for women who remained illiterate (around 110 per thousand).</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage2Quiz\"></div><h3>Passage 3: Ecosystem</h3><div class=\"passage\"><p>The concept of the ecosystem has evolved since its origin. The term, coined in the 1930s, belongs to British botanists Roy Clapham and Sir Arthur Tansley. An ecosystem is a community of living organisms in <span class=\"translatable\">conjunction</span> with the nonliving components of their environment, interacting as a system. Non-living things that support life in an ecosystem are light, air, soil and water. Living things are the plants and animals, called organisms, which use those resources.</p><p>Ecosystems are controlled by external and internal factors. These conditions <span class=\"translatable\">determine</span> what kinds of living things will be able to <span class=\"translatable\">thrive</span> there. Organisms can only thrive where their needs are being met. One ecosystem that allows many different kinds of organisms to thrive is a temperate zone. It is an area where the conditions never become too hot or too cold.</p><p>All the living things in an ecosystem are called a <span class=\"translatable\">community</span>. All of one specific kind of <span class=\"translatable\">organism</span> living in a community is called a population. All living organisms perform certain life processes. They take in nutrients, use energy to grow, release waste, react to their environment, and reproduce.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 3</h4><p><strong>1. Choose the correct answer.</strong></p><ul><li>a) As used in the first paragraph, the word <strong>conjunction</strong> does not mean- i) combination ii) union iii) regular</li><li>b) The word <strong>determine</strong> in the second paragraph means - i) decide ii) detrimental iii) destruct</li><li>c) The word <strong>thrive</strong> in the second paragraph means- i) decline ii) grow iii) wither</li><li>d) The word <strong>community</strong> in the third paragraph does not mean- i) population ii) organisms iii) society</li><li>e) The word <strong>organism</strong> in the fourth paragraph means- i) human being ii) organic iii) life form</li></ul><p><strong>2. Answer the following questions:</strong></p><ol type=\"a\"><li>How does an ecosystem sustain?</li><li>How is the overall organization of an ecosystem controlled?</li><li>Why does a temperate zone support many varieties of organisms?</li><li>What does population mean in a community?</li><li>What are three of the life processes that living organisms do?</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Correct Answer:</strong><br/>a) iii) regular<br/>b) i) decide<br/>c) ii) grow<br/>d) iii) society<br/>e) iii) life form</p><p><strong>2. Short Answers:</strong><br/>a) An ecosystem sustains by the interaction between living organisms and the nonliving components of their environment (light, air, soil, water).<br/>b) The overall organization is controlled by external factors like climate and internal factors created by the organisms themselves.<br/>c) A temperate zone supports many organisms because its conditions never become too hot or too cold.<br/>d) A population is all of one specific kind of organism living in a community.<br/>e) Three life processes are: taking in nutrients, using energy to grow and develop, and reproducing.</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage3Quiz\"></div><h3>Passage 4: Facebook Addiction Disorder</h3><div class=\"passage\"><p>Facebook is one of the trendiest social networking websites on the planet. Created by Harvard genius Mark Zuckerberg in 2004, it started out as a campus thing but progressively became a worldwide source of communication and entertainment. Many teens have admitted that they are <span class=\"translatable\">unquestionably</span> addicted to Facebook. This Facebook fever is so strong that even educated business people to <span class=\"translatable\">intrigued</span> grandparents has joined the phenomenon.</p><p>No doubt Facebook is a stroke of genius but excess of everything is bad. Facebook is taking over the world and that is no <span class=\"translatable\">exaggeration</span>. That can easily be seen by the fact that people spend more time on Facebook than actually being involved in any other activity. This is called F.A.D: Facebook Addiction Disorder.</p><p>A person suffering from F.A.D spends all the time on his computer checking his notifications, messages and friend requests after every 5 minutes. Sometimes he becomes <span class=\"translatable\">fretful</span> just because he has not checked his account in an over an hour. That person withdraws himself from normal activities like hanging out with friends, helping around the house, going out on weekends, and <span class=\"translatable\">eschews</span> the rest of the world. For him Facebook is his new world.</p><p>Curing it is not easy unless we have the will power to do it. Like all other addictions, F.A.D cannot be cured overnight but if we take a healthy look at our lifestyles then we might be able to tell what went off beam with us. A balanced life is a healthy life, now it is up to us how we want to live it.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 4</h4><p><strong>1. Choose the correct answer.</strong></p><ul><li>a) The word <strong>eschew</strong> used in the fourth paragraph means- i) being interested ii) noticing something iii) deliberately avoiding something iv) taking care</li><li>b) The word <strong>unquestionably</strong> used in the first paragraph means- i) without any doubt ii) with explanation iii) without logic iv) with a scope of argument</li><li>c) The word <strong>fretful</strong> in third paragraph does not mean- i) relaxed ii) irritated iii) uneasy iv) distressed</li><li>d) The word <strong>exaggeration</strong> in the second paragraph is related to the idea of- i) simplifying something ii) understanding something iii) dramatizing something excessively iv) reacting to something</li><li>e) The word <strong>intrigued</strong> in the first paragraph means- i) not excited ii) enthusiastic iii)uninterested iv) bored</li></ul><p><strong>2. Answer the following questions:</strong></p><ol type=\"a\"><li>When did Zuckerburg create Facebook?</li><li>Why social networking is everything for the youth of the 21st century?</li><li>What are the symptoms of a person suffering from Facebook Addiction Disorder (F.A.D)?</li><li>Do you think Facebook addiction is harmful like any other addiction? Give reason for your answer.</li><li>How would you deal with Facebook addiction in your life?</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Correct Answer:</strong><br/>a) iii) deliberately avoiding something<br/>b) i) without any doubt<br/>c) i) relaxed<br/>d) iii) dramatizing something excessively<br/>e) i) not excited (Note: The PDF seems to have a mistake here, as 'intrigued' means 'aroused the curiosity or interest of'. The provided 'correct' answer 'not excited' is an antonym. Based on context, the grandparents became interested.)</p><p><strong>2. Short Answers:</strong><br/>a) Mark Zuckerberg created Facebook in 2004.<br/>b) It allows them to stay connected to friends and family.<br/>c) Symptoms include constantly checking notifications, becoming fretful when unable to check, and withdrawing from normal activities.<br/>d) Yes, the passage claims it is harmful because it affects grades, homework, and life by causing withdrawal from the real world.<br/>e) The passage suggests dealing with it requires will power and taking a healthy look at one's lifestyle.</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage4Quiz\"></div><h3>Passage 5: A Successful Formula</h3><div class=\"passage\"><p>Vygotsky, a Soviet educational psychologist, describes learning as a social process. According to this concept, learning takes place first at the social level through interactions with others. Another aspect of his theory is the idea that the learners are mentally prepared to a certain level and they require support from a teacher or more experienced peers in order to fully develop.</p><p>Teachers need to plan activities using cooperative learning so that learners can be meaningfully engaged. Student engagement is the fundamental component of successful academic achievement. It should be the goal of a teacher to create a <span class=\"translatable\">congenial</span> classroom environment where students have the freedom to contribute and debate their ideas. If teachers are highly engaging and set clear expectations, students will feel as if they belong in the classroom.</p><p>For a highly functional classroom, high-quality peer support is also important. Two heads are always better than one. When students have the opportunity to interact with each other and share learning experiences, they don't rely on rote learning.</p><p>However, it is not an easy task to bridge practical classroom application with <span class=\"translatable\">pedagogical</span> theory. It requires skill to engage students with a variety of activities in order to develop their abilities in critical thinking, quantitative reasoning, problem-solving and communication. The institutions should offer good quality and sustainable Continuous Professional Development (CPD) programmes. The basic principle behind this is that a good teacher should never stop being a learner.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 5</h4><p><strong>1. Answer the questions in a complete sentence</strong></p><ol type=\"a\"><li>How does learning take place at the social level?</li><li>Why is cooperative learning necessary?</li><li>Why is it important to create a congenial classroom?</li><li>What are the benefits of team work?</li><li>What are the characteristics of experienced faculty members?</li></ol><p><strong>2. From the passage, find out the synonyms of the words</strong></p><p>a. conversation b. pleasant c. related to teaching d. suggestions e. new idea</p><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Short Answers:</strong><br/>a) Learning takes place at the social level through interactions with others.<br/>b) Cooperative learning is necessary so that learners can be meaningfully engaged and strengthen interpersonal skills.<br/>c) It's important to create a congenial classroom so students feel free to contribute, debate, and participate in activities.<br/>d) Benefits of teamwork include combining ideas, giving and receiving feedback, developing deeper understanding, and not relying on rote learning.<br/>e) They are not scared of challenges and are skilled in engaging students to develop abilities like critical thinking and problem-solving.</p><p><strong>2. Synonyms:</strong><br/>a. conversation: interaction<br/>b. pleasant: congenial<br/>c. related to teaching: pedagogical<br/>d. suggestions: implications<br/>e. new idea: innovation</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage5Quiz\"></div><h3>Passage 6: The Changing Global Diet</h3><div class=\"passage\"><p>For several reasons, many people choose fast food. First, it is quick and convenient. Second, it is cheaper than special home-cooked meals or formal restaurant dinners. And third, it is <span class=\"translatable\">identical</span> in every eating place with the same company name. The main reason others dislike it is its low nutritional value. In <span class=\"translatable\">contrast</span>, most types of fast food have a lot of fat, cholesterol, sugar, or salt in them. Possibly, these substances can cause or increase health disorders.</p><p>Some people believe food should be perfectly fresh and \"natural.\" They don't believe convenience foods--canned, frozen, or packaged--are very nutritious either. On the other hand, these quick and easy kinds of worldwide <span class=\"translatable\">nourishment</span> are generally getting better and more healthful. For instance, many fast-food restaurants now have salad bars and put vegetable items on their menus. And nutrition bars are becoming more widely available.</p><p>Of course, human beings around the world don't always eat in fast-food places. Many families prepare good meals at home. Cooking customs, eating habits, and food preferences all over the world are becoming more healthful. In these and other ways, the global diet is changing.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 6</h4><p><strong>1. Answer to the following short questions from the text:</strong></p><ol type=\"a\"><li>What are the three reasons for people to eat fast food?</li><li>Why some people do not like fast food?</li><li>What are the most common and important food elements mentioned in the text?</li></ol><p><strong>2. Choose the correct meaning of the following vocabulary:</strong></p><ul><li>i) Identical = (i) unknown (ii) similar (iii) known (iv) familiar</li><li>ii) Convenience = (i) usefulness (ii) suitability (iii) usability (iv) inconvenient</li><li>iii) In contrast = (i) as opposed with (ii) similar to (iii) akin to (iv) afraid of</li><li>iv) Nourishment = (i) unhealthiness (ii) state of healthy (iii) healthfulness (iv) unhealthy</li></ul><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Short Answers:</strong><br/>(a) It is quick, cheap, and identical everywhere.<br/>(b) Because of its low nutritional value (low in fiber, vitamins, minerals and high in fat, cholesterol, sugar, salt).<br/>(c) Protein, carbohydrates, and fats.</p><p><strong>2. Correct Meaning:</strong><br/>i) Identical = (ii) similar<br/>ii) Convenience = (ii) suitability<br/>iii) In contrast = (i) as opposed with<br/>iv) Nourishment = (iii) healthfulness</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage6Quiz\"></div><h3>Passage 7: Galileo</h3><div class=\"passage\"><p>Galileo Galilei was born in the year 1564 in the town of Pisa, Italy. His father wanted him to be a doctor, but Galileo was bored with school <span class=\"translatable\">except</span> for math. Because math was the one subject where he was doing well, the court mathematician offered to tutor him privately. Galileo’s father was <span class=\"translatable\">disappointed</span>, but he agreed.</p><p>As he needed to earn money, Galileo began experimenting with different things. He had already experimented with pendulums, thermometers, and magnets. When he heard that a Dutch inventor had invented something called a spyglass, but was keeping it a secret, Galileo decided to work on one of his own. Within 24 hours, he had invented a telescope that could <span class=\"translatable\">magnify</span> things to make them <span class=\"translatable\">appear</span> ten times larger than real life. One night, he pointed his telescope toward the sky, and made his first of many space observations: the moon was not smooth, like everyone thought. The moon was covered in bumps and <span class=\"translatable\">craters</span>.</p><p>As technology has improved, first Galileo, and then many others, have made improvements on the telescope, the wonderful device that allows us to see from a distance.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 7</h4><p><strong>1. Answer to the following short questions from the text:</strong></p><ol type=\"a\"><li>Where was Galileo born?</li><li>What was his favorite subject in school?</li><li>What was Galileo’s first invention?</li><li>What were other inventions of Galileo?</li><li>What are the features of a telescope?</li></ol><p><strong>2. Choose the best answer from the alternatives:</strong></p><ul><li>a) The word ‘except’ in the passage means- i) apart from, ii) included, iii) incorporated.</li><li>b) The word ‘craters’ is the synonym of - i) holes, ii) solid, iii) compact.</li><li>c) The word ‘magnify’ in the passage means - i) lessen, ii) reduce, iii) expand.</li><li>d) The word ‘appear’ is the antonym of - i) conceal, ii) show up, iii) occur.</li><li>e) The word ‘disappointed’ does not mean- i) comforted; ii) upset; iii) frustrated.</li></ul><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Short Answers:</strong><br/>a) Galileo was born in Pisa, Italy.<br/>b) His favorite subject was math.<br/>c) His first successful invention mentioned was a compass-like device to measure plots of land.<br/>d) Other inventions included pendulums, thermometers, magnets, and the telescope.<br/>e) The telescope's features are that it can magnify things to make them appear larger than real life, allowing us to see from a distance.</p><p><strong>2. Best Answer:</strong><br/>a) The word ‘except’ means- i) apart from<br/>b) The word ‘craters’ is the synonym of - i) holes<br/>c) The word ‘magnify’ means - iii) expand<br/>d) The word ‘appear’ is the antonym of - i) conceal<br/>e) The word ‘disappointed’ does not mean- i) comforted</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage7Quiz\"></div><h3>Passage 8: The Mother’s Day</h3><div class=\"passage\"><p>The idea of Mother’s Day is a very old idea, dating back to the ancient Egyptians and Greeks. Later, English Christians <span class=\"translatable\">expanded</span> the celebration to honor all mothers. This English holiday was called “Mothering Sunday.”</p><p>During the U.S. Civil War, mothers on both sides of the war lost sons. <span class=\"translatable\">Grieving</span> mothers from both sides had meetings. In 1868, Ann Reeves Jarvis started a committee to establish a “Mothers’ Friendship Day”. Julia Ward Howe also declared the first official Mother’s Day in 1870 and held an anti–war observance. She <span class=\"translatable\">funded</span> this observance with her own money for several years.</p><p>In 1914, the U.S. Congress passed a law which <span class=\"translatable\">designated</span> the second Sunday in May as Mother’s Day. Now the day has become <span class=\"translatable\">commercialized</span>, with companies launching women’s products and restaurants advertising heavily.</p></div><div class=\"exercise-toggle\"><h4>Exercise Questions for Passage 8</h4><p><strong>1. Choose the most appropriate option according to the reading passage:</strong></p><ul><li>a. The word <strong>Expand</strong> does not refer to (i)Develop (ii) Sufficient (iii) Amplify (iv) Extend</li><li>b. The word <strong>Grieve</strong> means (i) Blind (ii) Observe (iii) Mourn(iv) Run</li><li>c. The meaning of <strong>Fund</strong> is (i) Grant (ii) Regret (iii) Withdrawn (iv) Accept</li><li>d. Find which one is not a synonym of <strong>Designated</strong> (i)Announced (ii) Regretted (iii) Selected(iv) Decided</li><li>e. What does the word <strong>Commercialized</strong> mean? (i) Fame-oriented (ii) Customized(iii) Personalized (iv) Money-oriented</li></ul><p><strong>2. Answer the following questions:</strong></p><ol type=\"a\"><li>What was the early name of “Mother’s Day”</li><li>What did Ann Reeves Jarvis do for mothers after U.S. Civil War?</li><li>Who declared the first “Mother’s Day” and why?</li><li>When did we start celebrating Mother’s Day officially around the world?</li><li>“The day has become commercialized”- do you agree with this statement? Why?</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p><strong>1. Appropriate Option:</strong><br/>a) (ii) Sufficient<br/>b) (iii) Mourn<br/>c) (i) Grant<br/>d) (ii) Regretted<br/>e) (iv) Money-oriented</p><p><strong>2. Short Answers:</strong><br/>a) The early name was \"Mothering Sunday.\"<br/>b) She started a committee to help families get back together and established \"Mothers' Friendship Day.\"<br/>c) Julia Ward Howe declared the first official Mother's Day as an anti-war observance.<br/>d) It was officially started in 1914 in the U.S. and is now celebrated on the same day in many other countries.<br/>e) Yes, one can agree it has become commercialized because companies heavily advertise and launch products specifically for the day, shifting the focus to buying gifts.</p></div></div><div class=\"quiz-container\" data-quiz-id=\"readingPassage8Quiz\"></div></div>"
    },
    {
      "id": "paragraph-writing",
      "title": "How to Write a Paragraph",
      "category": "Mid Term Materials",
      "content": "<div><h3>What is a paragraph?</h3><p>Paragraphs are comprised of sentences, but not random sentences. A paragraph is a group of sentences organized around a central topic. In fact, the basic rule of paragraph writing is to focus on one idea. A solidly written paragraph takes its readers on a clear path, without <span class=\"translatable\">detours</span>.</p><h3>Qualities of a good paragraph</h3><p>A basic paragraph structure usually consists of five sentences: the topic sentence, few supporting sentences, and a concluding sentence. But the secrets to paragraph writing lay in four essential elements, which when used correctly, can make an okay paragraph into a <strong>great</strong> paragraph.</p><ol><li><strong>Element #1: Unity.</strong> Unity in a paragraph begins with the topic sentence. Every paragraph has one single, controlling idea that is expressed in its topic sentence, which is typically the first sentence of the paragraph. A paragraph is unified around this main idea, with the supporting sentences providing detail and discussion.</li><li><strong>Element #2: Order.</strong> Order refers to the way you organize your supporting sentences. Whether you choose chronological order, order of importance, or another logical presentation of detail, a solid paragraph always has a definite organization. Order helps the reader grasp your meaning and avoid confusion.</li><li><strong>Element #3: Coherence.</strong> Coherence is the quality that makes your writing understandable. Sentences within a paragraph need to connect to each other and work together as a whole. One of the best ways to achieve coherency is to use <strong>transition words</strong>. These words create bridges from one sentence to the next.</li><li><strong>Element #4: Completeness.</strong> Completeness means a paragraph is well-developed. If all sentences clearly and sufficiently support the main idea, then your paragraph is complete. Usually three supporting sentences, in addition to a topic sentence and concluding sentence, are needed for a paragraph to be complete.</li></ol><h3>Transitional Words</h3><div class=\"table-container\"><h4>Addition</h4><div class=\"table-grid\"><div>again</div><div>also</div><div>and</div><div>besides</div><div>equally</div><div>furthermore</div><div>in addition</div><div>indeed</div><div>in fact</div><div>moreover</div><div>next</div><div>too</div></div></div><div class=\"table-container\"><h4>Contrast</h4><div class=\"table-grid\"><div>but</div><div>however</div><div>in contrast</div><div>instead</div><div>conversely</div><div>nevertheless</div><div>on the other hand</div><div>whereas</div><div>while</div><div>yet</div><div>although</div><div>despite</div></div></div><div class=\"table-container\"><h4>Time and Sequence</h4><div class=\"table-grid\"><div>after</div><div>afterwards</div><div>at first</div><div>finally</div><div>meanwhile</div><div>next</div><div>soon</div><div>then</div><div>later</div><div>subsequently</div><div>as soon as</div></div></div><h3>Paragraph writing: A Step-by-Step Process</h3><ol><li><strong>Decide the Topic of Your Paragraph and prepare an outline:</strong> Know what you are writing about. Note key terms from the prompt.</li><li><strong>Develop a Topic Sentence:</strong> This sentence should state the main topic and a controlling idea. For example: \"People can avoid <span class=\"translatable\">plagiarizing</span> (topic) by <strong>taking certain precautions</strong> (controlling idea).\"</li><li><strong>Demonstrate Your Point:</strong> Provide information to prove, illustrate, clarify, and/or exemplify your point using facts, details, examples, and quotations.</li><li><strong>Give Your Paragraph Meaning:</strong> Explain why the information you provided is relevant, meaningful, or interesting.</li><li><strong>Conclude:</strong> Add a concluding sentence that summarizes your points and reinforces the topic sentence. Use linking words like 'therefore' or 'thus'.</li><li><strong>Look Over and Proofread:</strong> Always revise your work. Read it out loud to check for sense and flow.</li></ol><div class=\"quiz-container\" data-quiz-id=\"paragraphWritingQuiz\"></div></div>"
    },
    {
      "id": "descriptive-paragraph",
      "title": "Descriptive Paragraph",
      "category": "Mid Term Materials",
      "content": "<div><p>A descriptive paragraph paints a picture with words. It uses sensory details to describe a person, place, or object, allowing the reader to experience it vividly.</p><h3>Techniques of describing a place</h3><ol><li>Start by describing the first thing that strikes you.</li><li>Highlight small details to make your description interesting.</li><li>Use surprising, <span class=\"translatable\">exotic</span> language to make the place come to life.</li><li>Write about how you react to the place.</li><li>Include only the most important details so you don’t bog your reader down.</li><li>Consider all five senses: touch, smell, sound, taste, and sight.</li></ol><div class=\"example-box\"><h4>Example: Describing a Lake</h4><p><strong>Pre-writing using senses:</strong></p><ul><li><strong>Touch:</strong> warm water, hot sand, heat</li><li><strong>Smell:</strong> fresh air, fish, hot dogs, sun block</li><li><strong>Sound:</strong> laughing, splashing, music</li><li><strong>Taste:</strong> sand, lotion</li><li><strong>Sight:</strong> the sun, sand, children, lifeguards, boats</li></ul><p><strong>Resulting Paragraph:</strong> Lake Harriet is a great place to swim and relax. In the summer, the water is warm and clean, and the beaches are large enough to accommodate groups of people seeking relief from a midsummer <span class=\"translatable\">scorcher</span>. The sweet scent of sun block wafts through the air from sunbathers. Children laugh and splash in the water, and nearby volleyball games stir passionate shouts. In the distance, sailboats catch the soft breezes that ripple the lake's surface. This is what summer is all about!</p></div><h3>Techniques of describing a person</h3><ol><li>Start with a general topic sentence that introduces the person.</li><li>Focus on the most striking part of their appearance first.</li><li>Use physical details that hint at the person’s personality.</li><li>Use figurative language like similes and metaphors.</li></ol><div class=\"exercise-toggle\"><h4>Exercise: Combining Sentences</h4><p>Combine the following two sentences into one by listing the adjectives: \"He is kind-hearted. He is very thoughtful and friendly to everyone.\"</p><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>\"He is kind-hearted, very thoughtful, and friendly to everyone.\"</p></div></div><div class=\"quiz-container\" data-quiz-id=\"descriptiveParagraphQuiz\"></div></div>"
    },
    {
      "id": "narrative-paragraph",
      "title": "Narrative Paragraph",
      "category": "Mid Term Materials",
      "content": "<div><p><strong>Definition:</strong> A narrative paragraph tells a story using specific details in chronological (time) order.</p><p><strong>Purpose:</strong> To show the reader the events that happened.</p><p>In academic writing, an incident is often used to <span class=\"translatable\">illustrate</span> a larger point. A narrative paragraph answers the 5-wh questions (what, when, where, who, why) and 1 h-question (how).</p><h3>Use of Tenses</h3><ul><li><strong>Simple Past:</strong> Use for a succession of events. <em>\"I got up, went to the kitchen, and opened the door.\"</em></li><li><strong>Past Continuous:</strong> Use for an interrupted action. <em>\"Sharon <strong>was working</strong> in the garden when the telephone <strong>rang</strong>.\"</em></li><li><strong>Past Perfect:</strong> Use for actions that were finished before another past action. <em>\"Janet didn't join us for dinner as she <strong>had already eaten</strong>.\"</em></li></ul><h3>Use of Transitional Devices</h3><p>Start sentences with linking phrases like 'Then,', 'Next,', 'After that,', and 'Finally,' to connect sentences and show time relationships in your narrative writing.</p><div class=\"example-box\"><h4>Example: A Travel Nightmare</h4><p>When I decided to travel across Europe with a backpack, I did not think I would meet the local police. My best friend and I were sitting in Frankfurt on a train bound for Paris when the nightmare began. A young man came to the window and asked me at what time the train leaves. It took us only ten seconds to open the window and answer him. When we turned away from the window and sat down on our seats, we noticed that our backpacks were missing. Quickly, we got off the train and went to the police station. They explained that it was a common way of stealing bags; one person distracts a passenger while another steals their valuables. That is how our nightmare came to a surprising end.</p></div><div class=\"exercise-toggle\"><h4>Exercise: Using Past Verbs and Prepositions</h4><p>Complete the following sentences to form a paragraph. Use the past tense of the verb and the correct preposition.</p><p>Yesterday evening Jack _____ (get) home _____ (preposition) half past five. He immediately _____ (make) himself a cup _____ (preposition) coffee and _____ (sit down) to read a book. He _____ (read) the book _____ (preposition) half past seven. Then, he _____ (make) dinner and _____ (get ready) to go out with his friends. When his friends _____ (arrive), they _____ (decide) to go out to see a film. He _____ (stay out) until midnight with his friends. Finally, he _____ (fall) asleep _____ (preposition) about one o'clock.</p><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>Yesterday evening Jack <strong>got</strong> home <strong>at</strong> half past five. He immediately <strong>made</strong> himself a cup <strong>of</strong> coffee and <strong>sat down</strong> to read a book. He <strong>read</strong> the book <strong>until</strong> half past seven. Then, he <strong>made</strong> dinner and <strong>got ready</strong> to go out with his friends. When his friends <strong>arrived</strong>, they <strong>decided</strong> to go out to see a film. He <strong>stayed out</strong> until midnight with his friends. Finally, he <strong>fell</strong> asleep <strong>at</strong> about one o'clock.</p></div></div><div class=\"quiz-container\" data-quiz-id=\"narrativeParagraphQuiz\"></div></div>"
    },
    {
      "id": "cause-effect-paragraph",
      "title": "Cause-Effect Paragraph",
      "category": "Mid Term Materials",
      "content": "<div><p><strong>Definition:</strong> A cause and effect paragraph shows the result or results that follow from an event (the cause or causes).</p><p><strong>Purpose:</strong> To explain to the reader how one thing may affect another.</p><p>Cause-effect paragraphs can be structured in two main ways:</p><ul><li><strong>Focus on causes:</strong> The paragraph explains the reasons *why* something happened. The topic sentence introduces an effect, and the supporting sentences detail its causes.</li><li><strong>Focus on effects:</strong> The paragraph explains *what happens* as a result of something. The topic sentence introduces a cause, and the supporting sentences detail its effects.</li></ul><h3>Useful Transitional Devices</h3><ul><li><strong>For Cause:</strong> For, because, since, due to, for this reason, creates, leads to...</li><li><strong>For Effect:</strong> So, as a consequence, as a result, consequently, therefore, thus, hence...</li></ul><div class=\"example-box\"><h4>Example: Pollution and Human Life (Focus on Effects)</h4><p>Pollution which is one of the biggest problems facing the world today has many effects on human life. <strong>First of all</strong>, pollution is bad for people's health. <strong>For example</strong>, smog, caused by car's exhaust fumes, can lead to lung diseases. <strong>Also</strong>, polluted food and water can cause cancer. <strong>Another effect</strong> of pollution is the destruction of human habitat. <strong>Thus</strong>, an oil spill can make an area uninhabitable. <strong>To sum up</strong>, pollution has many negative effects on the lives of humans.</p></div><div class=\"quiz-container\" data-quiz-id=\"causeEffectParagraphQuiz\"></div></div>"
    },
    {
      "id": "tense",
      "title": "Tense",
      "category": "Mid Term Materials",
      "content": "<div><p>In grammar, tense is a category that expresses time reference. Tenses are usually <span class=\"translatable\">manifested</span> by the use of specific forms of verbs, particularly in their <span class=\"translatable\">conjugation</span> patterns.</p><h2>Present Tense</h2><p>Present tense has four different forms: Simple Present, Present Progressive (Continuous), Present Perfect, and Present Perfect Progressive.</p><h4>Present Indefinite Tense/ Simple Present Tense</h4><p>The present indefinite tense <span class=\"translatable\">denotes</span> a <span class=\"translatable\">stative</span> or <span class=\"translatable\">habitual</span> or eternally true action. It's used for actions that happen regularly (always, usually, every day), or are general facts.</p><p><strong>Structure:</strong> Subject + base verb (+ s/es for third-person singular). Example: <em>I know Samia. He understands it.</em></p><h4>Present Progressive (Continuous) Tense</h4><p>This is used to indicate an ongoing action at the present moment (now, at this moment, right now). It can also be used to demonstrate future time.</p><p><strong>Structure:</strong> Subject + am/is/are + verb + ing. Example: <em>I am going to the university. Sami is leaving for Bhutan tomorrow.</em></p><h4>Present Perfect Tense</h4><p>Used to indicate an action that occurred at an <span class=\"translatable\">indefinite</span> time in the past but has an effect on the present, or an action that began in the past and is still ongoing.</p><p><strong>Structure:</strong> Subject + have/has + past participle. Example: <em>Sami has read the book. He has lived in this apartment for 15 years.</em></p><p><strong>Note:</strong> <em>Already</em> comes between have/has and the past participle; <em>yet</em> appears with a negative form at the end of the sentence.</p><h4>Present Perfect Progressive (Continuous)</h4><p>Used to indicate an action that began in the past and is still occurring in the present, emphasizing the duration of the action.</p><p><strong>Structure:</strong> Subject + have/has + been + [verb + ing]. Example: <em>Sami has been reading for 3 hours.</em></p><div class=\"exercise-toggle\"><h4>Exercise I: Present Simple and Progressive</h4><p>Complete the sentences with the verbs in brackets.</p><ol><li>Look. He ______ to us. (listen)</li><li>We ______ at a hotel this week. (stay)</li><li>I ______ to bed early on Sundays. (go)</li><li>My mum is at the shop. She ______ a new dress. (buy)</li><li>Jill ______ a lot of money. (have)</li><li>They usually ______ on Sunday. (leave)</li><li>Please, stop! You ______ so fast! (drive)</li><li>We ______ in Berlin each year. (meet)</li><li>We ______ to discos on Fridays. (go)</li><li>He normally ______ on time. (come)</li><li>I can't hear you! I ______ a shower. (have)</li><li>Sam ______ his homework at night. (do)</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. is listening, 2. are staying, 3. go, 4. is buying, 5. has, 6. leave, 7. are driving, 8. meet, 9. go, 10. comes, 11. am having, 12. does</p></div></div><div class=\"exercise-toggle\"><h4>Exercise III: Present Perfect Simple and Continuous</h4><p>Use the words in brackets to complete these sentences.</p><ol><li>She ______ puddings all day. She's pretty tired. (make)</li><li>How many puddings ______ she ______? (make)</li><li>I ______ for my keys since we came home. Where are they? (look)</li><li>I ______ for my keys several times. But I haven't found them. (look)</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. She has been making puddings all day.<br/>2. How many puddings has she made?<br/>3. I have been looking for my keys since we came home.<br/>4. I have looked for my keys several times.</p></div></div><h2>Past Tense</h2><p>Past tense has four forms: Simple Past, Past Progressive, Past Perfect, and Past Perfect Progressive.</p><h4>Past Indefinite Tense / Simple Past Tense</h4><p>Used to indicate a finished or completed action that occurred at a specific point in time in the past.</p><p><strong>Structure:</strong> Subject + verb in the past form. Example: <em>Sami went to Mexico last year.</em></p><h4>Past Progressive (Continuous) Tense</h4><p>Used to demonstrate an action that was happening in the past for a period of time, often when it was interrupted by another action.</p><p><strong>Structure:</strong> Subject + was/were + verb + ing. Example: <em>Sami was sleeping yesterday at 6:30 AM. When I went out, Samia was shouting from behind.</em></p><h4>Past Perfect Tense</h4><p>Used to demonstrate an action that occurred before another action in the past. There are usually two completed actions in the sentence.</p><p><strong>Structure:</strong> Subject + had + past participle form of the main verb. Example: <em>Samia had completed the task before the teacher asked.</em></p><h4>Past Perfect Progressive Tense</h4><p>An extension of the past perfect tense, used to demonstrate an action which continued for a specific period but stopped before another action.</p><p><strong>Structure:</strong> Subject + had + been + verb+ing. Example: <em>Akram had been playing cricket for 18 years before he retired.</em></p><div class=\"exercise-toggle\"><h4>Exercise I: Past Simple and Continuous Mistakes</h4><p>Find mistakes and correct them.</p><ol><li>I was doing my homework first and then I had a rest.</li><li>My mum was often driving when she was younger.</li><li>While daddy didn't look, Susan put his key in her pocket.</li><li>I needed to talk to her. And at 10 I was calling her.</li><li>I saw you with Jill at the cafe. You talked.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. I <strong>did</strong> my homework... 2. Correct. 3. While daddy <strong>wasn't looking</strong>... 4. ...at 10 I <strong>called</strong> her. 5. You <strong>were talking</strong>. 6. Where <strong>did you study</strong>? 7. Correct. 8. I <strong>took</strong> her to Dover. 9. ...the sun <strong>shone</strong>. 10. Correct.</p></div></div><h2>Future Tense</h2><p>The future tense refers to a time later than now, and expresses facts or certainty.</p><h4>Simple Future Tense (will)</h4><p>Used to predict a future event, express a <span class=\"translatable\">spontaneous</span> decision, show willingness, or give an order.</p><p>Example: <em>It will rain tomorrow. I'll pay for the tickets by credit card.</em></p><h4>Will vs. Going To</h4><ul><li>Use <strong>GOING TO</strong> for actions you have already decided on (prior plans) or when there are definite signs something is going to happen (evidence).</li><li>Use <strong>WILL</strong> for rapid decisions made at the moment of speaking, or for predictions based on belief.</li></ul><h4>Future Continuous Tense</h4><p>Refers to an unfinished action or event that will be in progress at a time later than now.</p><p><strong>Structure:</strong> will + be + verb+ing. Example: <em>This time next week I will be exploring the valley of Sajek.</em></p><h4>Future Perfect Tense</h4><p>Refers to a completed action in the future. We are projecting ourselves forward and looking back at an action that will be completed.</p><p><strong>Structure:</strong> will + have + past participle. Example: <em>By the time you read this, I will have left.</em></p><h4>Future Perfect Continuous</h4><p>Refers to events or actions that are currently unfinished but will be finished at some future time, emphasizing the duration.</p><p><strong>Structure:</strong> will + have + been + verb+ing. Example: <em>I will have been waiting here for three hours by six o'clock.</em></p><div class=\"exercise-toggle\"><h4>Exercise I: Future Simple or Continuous</h4><p>Rewrite the underlined forms.</p><ol><li>Don't call me at 10 o'clock. <u>I am going to fly</u> to Spain.</li><li>I suppose <u>we're going to stay</u> at a hotel next summer.</li><li>Come to see me in the afternoon. <u>I work</u> in the garden.</li><li>Do you think <u>it is snowing</u> at the weekend?</li><li>Is the coat OK? - Yes, <u>I am taking it</u>.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. will be flying, 2. we'll be staying, 3. will be working, 4. it'll be snowing, 5. I'll take, 6. we'll be skiing, 7. I'll move, 8. will be using</p></div></div><div class=\"exercise-toggle\"><h4>Exercise V: Mixed Future Tenses</h4><p>Complete the passage with the correct form of future tense.</p><p>Sami’s family usually comes to stay with us for the new year, but this new year we are going to visit them instead. They live in Cox’s Bazar. I can hardly wait – I a) ______ (have) a fantastic time there. School holiday’s b) ______ (start) on Friday, and we are going to leave the following morning. At this time next week, I c) ______ (swim) in the sea. He’s an expert, and he d) ______ (practice) with me every day. By the last day of our visit... I hope by then I e) ______ (improve) enough to swim with them. Next year, I f) ______ (learn) scuba diving.</p><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. will have, 2. will start, 3. will be swimming, 4. am going to practice, 5. will have improved, 6. am going to learn</p></div></div><div class=\"quiz-container\" data-quiz-id=\"tenseQuiz\"></div></div>"
    },
    {
      "id": "subject-verb-agreement",
      "title": "Subject-Verb Agreement",
      "category": "Mid Term Materials",
      "content": "<div><p>Being able to find the right subject and verb will help you correct errors of subject-verb agreement. The basic rule is that a singular subject takes a singular verb, while a plural subject takes a plural verb.</p><h3>Key Rules</h3><p><strong>Rule 1.</strong> A subject will come before a phrase beginning with 'of'. This is a key rule for understanding subjects. The word 'of' is the <span class=\"translatable\">culprit</span> in many, perhaps most, subject-verb mistakes.<br/><em>Incorrect:</em> A bouquet of yellow roses lend color...<br/><em>Correct:</em> A bouquet of yellow roses <strong>lends</strong>... (The subject is 'bouquet', not 'roses')</p><p><strong>Rule 2.</strong> Two singular subjects connected by 'or', 'either/or', or 'neither/nor' require a singular verb.<br/><em>Example:</em> My aunt or my uncle <strong>is</strong> arriving by train today.</p><p><strong>Rule 3.</strong> The verb in an 'or', 'either/or', or 'neither/nor' sentence agrees with the noun or pronoun closest to it.<br/><em>Example:</em> Neither the serving bowl nor the plates <strong>go</strong> on that shelf. (Plates is plural and closer to the verb)</p><p><strong>Rule 4.</strong> As a general rule, use a plural verb with two or more subjects when they are connected by 'and'.<br/><em>Example:</em> A car and a bike <strong>are</strong> my means of transportation.</p><p><strong>Rule 5a.</strong> Sometimes the subject is separated from the verb by words such as 'along with', 'as well as', 'besides', 'not', etc. These words are not part of the subject.<br/><em>Example:</em> The politician, along with the newsmen, <strong>is</strong> expected shortly.</p><p><strong>Rule 6.</strong> In sentences beginning with 'here' or 'there', the true subject follows the verb.<br/><em>Example:</em> There <strong>are</strong> four hurdles to jump. (The subject is 'hurdles')</p><p><strong>Rule 7.</strong> Use a singular verb with distances, periods of time, sums of money, etc., when considered as a unit.<br/><em>Example:</em> Five years <strong>is</strong> the maximum sentence for that offense.</p><p><strong>Rule 9.</strong> The word 'were' replaces 'was' in sentences that express a wish or are contrary to fact (the <span class=\"translatable\">subjunctive</span> mood).<br/><em>Example:</em> If Joe <strong>were</strong> here, you'd be sorry.</p><div class=\"exercise-toggle\"><h4>Exercise I</h4><p>Circle the correct verb in each of the sentences below.</p><ol><li>Your friend (talk-talks) too much.</li><li>The man with the roses (look-looks) like your brother.</li><li>The women in the pool (swim-swims) well.</li><li>Bill (drive-drives) a cab.</li><li>The football players (run-runs) five miles every day.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. talks, 2. looks, 3. swim, 4. drives, 5. run, 6. lives, 7. cooks, 8. walk, 9. appears, 10. bounces</p></div></div><div class=\"quiz-container\" data-quiz-id=\"subjectVerbAgreementQuiz\"></div></div>"
    },
    {
      "id": "sentence-fragments",
      "title": "Sentence Fragments",
      "category": "Mid Term Materials",
      "content": "<div><h3>The Basics</h3><p>A complete sentence has three components: a subject (the actor), a <span class=\"translatable\">predicate</span> (the verb or action), and a complete thought (it can stand alone and make sense).</p><h3>Sentence Fragments</h3><p>A sentence fragment is an incomplete sentence. Some fragments are incomplete because they lack either a subject or a verb, or both. The fragments that most students have trouble with, however, are dependent clauses—they have a subject and a verb, so they look like complete sentences, but they don’t express a complete thought.</p><p>Example of a fragment: <em>Because his car was in the shop.</em> (What did he do? The thought is incomplete.)</p><p>This is a fragment because it begins with a <span class=\"translatable\">subordinator</span> (subordinating conjunction) like 'Because', 'After', 'When', 'Since', or 'If'.</p><p>To fix a fragment, you need to attach the dependent clause to an independent clause.</p><p><em>Correct:</em> <strong>Because his car was in the shop, John took the bus.</strong></p><div class=\"exercise-toggle\"><h4>Exercise I</h4><p>Indicate whether each part is a fragment (F) or sentence (S).</p><ol><li>Startled by the loud noise of the engine. I dropped the wrench and jumped out of the way.</li><li>Sami was standing on the corner. Watching all the cars go by.</li><li>Ridita gathered some dry twigs. And tried to start a fire for us.</li><li>All of us waited at the door. To let the man in the wheelchair by.</li><li>Written by a Black poet. Who had spent many years in the ghetto.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>1. S, F | 2. S, F | 3. S, F | 4. S, F | 5. F, F | 6. S, S | 7. F, S | 8. S, S | 9. F, S | 10. S, S</p></div></div><div class=\"quiz-container\" data-quiz-id=\"sentenceFragmentsQuiz\"></div></div>"
    },
    {
      "id": "word-formation",
      "title": "Word Formation",
      "category": "Mid Term Materials",
      "content": "<div><p>Word formation is the process of creating new words from existing words. This often involves adding prefixes or suffixes to a root word, or converting a word from one part of speech to another (e.g., from a verb to a noun).</p><div class=\"table-container\"><table class=\"word-formation-table\"><thead><tr><th>Verbs</th><th>Nouns</th><th>Adjectives</th><th>Adverbs</th></tr></thead><tbody><tr><td>accept</td><td>acceptance</td><td>acceptable</td><td></td></tr><tr><td>achieve</td><td>achievement</td><td>achievable</td><td></td></tr><tr><td>act</td><td>action/activity</td><td>active</td><td>actively</td></tr><tr><td>add</td><td>addition</td><td>additional</td><td></td></tr><tr><td>adjust</td><td>adjustment</td><td>adjustable</td><td></td></tr><tr><td>admire</td><td>admiration</td><td>admirable</td><td></td></tr><tr><td>advise</td><td>advice</td><td>advisable</td><td></td></tr><tr><td>amass</td><td>mass</td><td>massive</td><td>massively</td></tr><tr><td>annoy</td><td>annoyance</td><td>annoying</td><td></td></tr><tr><td>approach</td><td>approach</td><td>approachable</td><td></td></tr><tr><td>attend</td><td>attention</td><td>attentive</td><td></td></tr><tr><td>attract</td><td>attraction</td><td>attractive</td><td></td></tr><tr><td>avoid</td><td>avoidance</td><td>avoidable</td><td></td></tr><tr><td>believe</td><td>belief</td><td>believable</td><td></td></tr><tr><td>blacken</td><td>blackness</td><td>black</td><td></td></tr><tr><td>bleed</td><td>blood</td><td>bloody</td><td></td></tr><tr><td>bore</td><td>boredom</td><td>boring</td><td></td></tr><tr><td>breathe</td><td>breath</td><td>breathing</td><td></td></tr><tr><td>bury</td><td>burial</td><td>buried</td><td></td></tr><tr><td>care</td><td>care</td><td>careful</td><td>carefully</td></tr><tr><td>challenge</td><td>challenge</td><td>challenging</td><td></td></tr><tr><td>choose</td><td>choice</td><td>chosen</td><td></td></tr><tr><td>clear</td><td>clarity</td><td>clear</td><td>clearly</td></tr><tr><td>collect</td><td>collection</td><td>collective</td><td>collectively</td></tr><tr><td>comfort</td><td>comfort</td><td>comfortable</td><td>comfortably</td></tr><tr><td>confuse</td><td>confusion</td><td>confused</td><td></td></tr><tr><td>continue</td><td>continuity</td><td>continuous</td><td>continuously</td></tr><tr><td>create</td><td>creation</td><td>creative</td><td>creatively</td></tr><tr><td>decide</td><td>decision</td><td>decisive</td><td></td></tr><tr><td>decorate</td><td>decoration</td><td>decorative</td><td></td></tr><tr><td>delight</td><td>delight</td><td>delightful</td><td>delightfully</td></tr><tr><td>destroy</td><td>destruction</td><td>destructive</td><td>destructively</td></tr><tr><td>develop</td><td>development</td><td>developing</td><td></td></tr><tr><td>die</td><td>death</td><td>dead</td><td></td></tr><tr><td>differ</td><td>difference</td><td>different</td><td>differently</td></tr><tr><td>educate</td><td>education</td><td>educative</td><td></td></tr><tr><td>encourage</td><td>courage</td><td>courageous</td><td>courageously</td></tr><tr><td>explain</td><td>explanation</td><td>explainable</td><td></td></tr><tr><td>fascinate</td><td>fascination</td><td>fascinating</td><td></td></tr><tr><td>fly</td><td>flight</td><td>flying</td><td></td></tr><tr><td>force</td><td>force</td><td>forceful</td><td>forcefully</td></tr><tr><td>grow</td><td>growth</td><td>growing</td><td>growingly</td></tr><tr><td>harm</td><td>harm</td><td>harmful</td><td>harmfully</td></tr><tr><td>hate</td><td>hatred</td><td>hateful</td><td>hatefully</td></tr><tr><td>heal</td><td>health</td><td>healthy</td><td>healthily</td></tr><tr><td>hope</td><td>hope</td><td>hopeful</td><td>hopefully</td></tr><tr><td>identify</td><td>identification/identity</td><td>identified/identifying</td><td></td></tr><tr><td>impress</td><td>impression</td><td>impressive</td><td>impressively</td></tr><tr><td>inform</td><td>information</td><td>informative</td><td></td></tr><tr><td>injure</td><td>injury</td><td>injurious</td><td>injuriously</td></tr><tr><td>instruct</td><td>instruction</td><td>instructive</td><td></td></tr><tr><td>invent</td><td>invention</td><td>inventive</td><td></td></tr><tr><td>live</td><td>life/liveliness</td><td>alive/lively</td><td>livingly</td></tr><tr><td>lose</td><td>loss</td><td>lost</td><td></td></tr><tr><td>move</td><td>movement</td><td>movable</td><td>movingly</td></tr><tr><td>nationalize</td><td>nationality/nation</td><td>national</td><td>nationwide</td></tr><tr><td>observe</td><td>observation</td><td>observatory</td><td></td></tr><tr><td>perform</td><td>performance</td><td>performing</td><td></td></tr><tr><td>permit</td><td>permission</td><td>permissible</td><td></td></tr><tr><td>persuade</td><td>persuasion</td><td>persuasive</td><td></td></tr><tr><td>please</td><td>pleasure</td><td>pleasant</td><td></td></tr><tr><td>popularize</td><td>popularity</td><td>popular</td><td></td></tr><tr><td>quicken</td><td>quickness</td><td>quick</td><td>quickly</td></tr><tr><td>sadden</td><td>sadness</td><td>sad</td><td>sadly</td></tr><tr><td>secure</td><td>security</td><td>secured</td><td>securely</td></tr><tr><td>see</td><td>sight/scene</td><td>seen/scenic</td><td></td></tr><tr><td>speed</td><td>speed</td><td>speedy</td><td>speedily</td></tr></tbody><tbody></table></div><div class=\"exercise-toggle\"><h4>Word Formation Examples</h4><p>Complete the sentences with the correct form of the word in parentheses.</p><ol><li>How long is the ______ from Rome to Paris? (FLY)</li><li>I have a very good ______ with both my parents (RELATION)</li><li>Pulling my front tooth didn’t hurt. – It was completely ______ (PAIN).</li><li>I can tell from your ______ that you’re not really happy (EXPRESS)</li><li>We offer free ______ for purchases over € 100 (DELIVER).</li><li>James hasn’t had a lot of ______ lately, so I hope he’ll do well with his new company (SUCCEED)</li><li>It is ______ colder today that it was yesterday (CERTAIN).</li><li>What ______ is he? Spanish or Portuguese? (NATION)</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><ol><li>FLIGHT</li><li>RELATIONSHIP</li><li>PAINLESS</li><li>EXPRESSION</li><li>DELIVERY</li><li>SUCCESS</li><li>CERTAINLY</li><li>NATIONALITY</li><li>CHOICE</li><li>PERSONALITY</li><li>IMAGINATION</li><li>BORING</li><li>CARELESS</li><li>UNBELIEVABLE</li><li>SPEECH</li><li>INFORMATION</li><li>NOISY</li><li>CONFUSING</li></ol></div></div><div class=\"quiz-container\" data-quiz-id=\"wordFormationQuiz\"></div></div>"
    },
    {
      "id": "academic-word-list-1",
      "title": "Academic Word List 1",
      "category": "Mid Term Materials",
      "content": "<div><p>This list contains important words frequently used in academic texts. Understanding them is crucial for success in higher education.</p><div class=\"word-entry\"><h3>1. aberrant</h3><p><strong>English Definition:</strong> markedly different from an accepted norm</p><p><strong>বাংলা ব্যাখ্যা:</strong> স্বাভাবিক বা সাধারণ নিয়ম থেকে বিচ্যুত; অস্বাভাবিক।</p><p><strong>Examples:</strong></p><ul><li>If my aunt does not take her medication, she will have aberrant mood swings.</li><li>The drunken man’s aberrant conduct drew the police officer’s attention.</li></ul></div><div class=\"word-entry\"><h3>2. aesthetic</h3><p><strong>English Definition:</strong> characterized by an appreciation of beauty or good taste</p><p><strong>বাংলা ব্যাখ্যা:</strong> সৌন্দর্য বা রুচির প্রতি অনুরাগ; নান্দনিক।</p><p><strong>Examples:</strong></p><ul><li>The committee did not attempt to make aesthetic judgements.</li><li>Maybe it was time they started paying more attention to the aesthetic value of things.</li></ul></div><div class=\"word-entry\"><h3>3. aggregate</h3><p><strong>English Definition:</strong> a sum total of many heterogeneous things taken together</p><p><strong>বাংলা ব্যাখ্যা:</strong> বিভিন্ন জিনিসের সমষ্টি; মোট।</p><p><strong>Examples:</strong></p><ul><li>The producers will aggregate singers into groups based on gender and age.</li><li>The fire drill shows our ability to aggregate in preselected destinations.</li></ul></div><div class=\"word-entry\"><h3>4. amalgamate</h3><p><strong>English Definition:</strong> bring or combine together or with something else</p><p><strong>বাংলা ব্যাখ্যা:</strong> একত্রিত করা; মিশিয়ে দেওয়া।</p><p><strong>Examples:</strong></p><ul><li>The two companies will amalgamate in a mutually beneficial merger next week.</li><li>Because of budget cuts, the two schools were forced to amalgamate into one building.</li></ul></div><div class=\"word-entry\"><h3>5. ambiguous</h3><p><strong>English Definition:</strong> having more than one possible meaning</p><p><strong>বাংলা ব্যাখ্যা:</strong> যার একাধিক অর্থ হতে পারে; দ্ব্যর্থক।</p><p><strong>Examples:</strong></p><ul><li>Instead of being ambiguous with your words, be clearer and more specific.</li><li>With an ambiguous plot, no one could understand the film's premise.</li></ul></div><div class=\"word-entry\"><h3>6. ambivalence</h3><p><strong>English Definition:</strong> mixed feelings or emotions</p><p><strong>বাংলা ব্যাখ্যা:</strong> মিশ্র অনুভূতি বা আবেগ; উভয়সংকট।</p><p><strong>Examples:</strong></p><ul><li>Tad felt a great deal of ambivalence about accepting the new position.</li><li>Many people show ambivalence towards technology.</li></ul></div><div class=\"word-entry\"><h3>7. analogous</h3><p><strong>English Definition:</strong> similar or equivalent in some respects</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু ক্ষেত্রে অনুরূপ বা সমতুল্য; সাদৃশ্যপূর্ণ।</p><p><strong>Examples:</strong></p><ul><li>All of the actors reading for the role were analogous to each other in appearance.</li><li>We couldn’t decide between the two tiles because they were analogous to one another.</li></ul></div><div class=\"word-entry\"><h3>8. anomalous</h3><p><strong>English Definition:</strong> deviating from the general or common order or type</p><p><strong>বাংলা ব্যাখ্যা:</strong> সাধারণ বা সাধারণ নিয়ম বা ধরণ থেকে বিচ্যুত; ব্যতিক্রমী।</p><p><strong>Examples:</strong></p><ul><li>He is in an anomalous position as the only part-time worker in the firm.</li><li>In fact, the anomalous status gave him greater leeway.</li></ul></div><div class=\"word-entry\"><h3>9. antipathy</h3><p><strong>English Definition:</strong> a feeling of intense dislike</p><p><strong>বাংলা ব্যাখ্যা:</strong> তীব্র অপছন্দ বা ঘৃণা; বিদ্বেষ।</p><p><strong>Examples:</strong></p><ul><li>After serving in the war, he developed an antipathy to guns.</li><li>After hearing about public antipathy to his programs, the candidate hired a new consultant.</li></ul></div><div class=\"word-entry\"><h3>10. apprise</h3><p><strong>English Definition:</strong> inform somebody of something</p><p><strong>বাংলা ব্যাখ্যা:</strong> কাউকে কোনো কিছু সম্পর্কে অবহিত করা; জানানো।</p><p><strong>Examples:</strong></p><ul><li>The scouts went back to apprise their commanding officer of the enemy’s location.</li><li>Each week, the teachers apprise parents of their students’ progress.</li></ul></div><div class=\"word-entry\"><h3>11. approbation</h3><p><strong>English Definition:</strong> official acceptance or agreement</p><p><strong>বাংলা ব্যাখ্যা:</strong> আনুষ্ঠানিক স্বীকৃতি বা সম্মতি; অনুমোদন।</p><p><strong>Examples:</strong></p><ul><li>I need to write a powerful resume to gain approbation from an employer.</li><li>You cannot take prescription medication without a doctor's approbation.</li></ul></div><div class=\"word-entry\"><h3>12. appropriate</h3><p><strong>English Definition:</strong> suitable for a particular person, place, or situation</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো নির্দিষ্ট ব্যক্তি, স্থান বা পরিস্থিতির জন্য উপযুক্ত।</p><p><strong>Examples:</strong></p><ul><li>The appropriate response to a gift is to thank the giver.</li><li>Her speech was appropriate for the audience.</li></ul></div><div class=\"word-entry\"><h3>13. artless</h3><p><strong>English Definition:</strong> simple and natural; without cunning or deceit</p><p><strong>বাংলা ব্যাখ্যা:</strong> সরল এবং স্বাভাবিক; চালাকি বা প্রতারণা ছাড়া।</p><p><strong>Examples:</strong></p><ul><li>My artless comment was mistaken for rudeness.</li><li>The child asked many artless questions.</li></ul></div><div class=\"word-entry\"><h3>14. audacious</h3><p><strong>English Definition:</strong> disposed to venture or take risks</p><p><strong>বাংলা ব্যাখ্যা:</strong> ঝুঁকি নিতে বা সাহস করে কিছু করতে ইচ্ছুক; দুঃসাহসী।</p><p><strong>Examples:</strong></p><ul><li>Your plan of going abroad is an audacious decision.</li><li>He described the plan as ambitious and audacious.</li></ul></div><div class=\"word-entry\"><h3>15. autonomous</h3><p><strong>English Definition:</strong> existing as an independent entity</p><p><strong>বাংলা ব্যাখ্যা:</strong> স্বাধীন সত্তা হিসেবে বিদ্যমান; স্বায়ত্তশাসিত।</p><p><strong>Examples:</strong></p><ul><li>Teachers aim to help children become autonomous learners.</li><li>His philosophy is about becoming an autonomous individual.</li></ul></div><div class=\"word-entry\"><h3>16. aver</h3><p><strong>English Definition:</strong> declare or affirm solemnly and formally as true</p><p><strong>বাংলা ব্যাখ্যা:</strong> গম্ভীরভাবে এবং আনুষ্ঠানিকভাবে সত্য বলে ঘোষণা করা; নিশ্চিত করা।</p><p><strong>Examples:</strong></p><ul><li>I aver that I have spoken the truth.</li><li>I still aver that his report is true.</li></ul></div><div class=\"word-entry\"><h3>17. banal</h3><p><strong>English Definition:</strong> repeated too often; overfamiliar through overuse</p><p><strong>বাংলা ব্যাখ্যা:</strong> অতিরিক্ত বার বার ব্যবহৃত; অতি পরিচিত হওয়ার কারণে মূল্যহীন; গতানুগতিক।</p><p><strong>Examples:</strong></p><ul><li>It was just another banal newspaper story.</li><li>Melissa murmured some banal phrases of encouragement.</li></ul></div><div class=\"word-entry\"><h3>18. beneficent</h3><p><strong>English Definition:</strong> doing or producing good</p><p><strong>বাংলা ব্যাখ্যা:</strong> ভালো কিছু করা বা উৎপাদন করা; উপকারী।</p><p><strong>Examples:</strong></p><ul><li>Many beneficent projects have to be foregone if sufficient funds are lacking.</li><li>The farm was under the care of a beneficent power.</li></ul></div><div class=\"word-entry\"><h3>19. bombastic</h3><p><strong>English Definition:</strong> ostentatiously lofty in style</p><p><strong>বাংলা ব্যাখ্যা:</strong> জাঁকজমকপূর্ণ বা জমকালো শৈলীতে; বাগাড়ম্বরপূর্ণ।</p><p><strong>Examples:</strong></p><ul><li>He is best known for three rather bombastic poems.</li><li>The candidate spoke in a bombastic way of all that he would do if elected.</li></ul></div><div class=\"word-entry\"><h3>20. boorish</h3><p><strong>English Definition:</strong> ill-mannered and coarse in behavior or appearance</p><p><strong>বাংলা ব্যাখ্যা:</strong> অভদ্র এবং আচরণ বা চেহারায় অমার্জিত; রূঢ়।</p><p><strong>Examples:</strong></p><ul><li>I found him rather boorish and aggressive.</li><li>He disgusted many with his boorish behaviour.</li></ul></div></div>"
    },
    {
      "id": "compare-contrast-paragraph",
      "title": "Compare & Contrast Paragraph",
      "category": "Final Term Materials",
      "content": "<div><p><strong>Definition:</strong> A comparison paragraph explains the similarities in two subjects. A contrast paragraph explains the differences in two subjects.</p><p><strong>Purpose:</strong> To show how subjects are alike or different.</p><h3>Methods for Organizing</h3><h4>Point-by-Point Method</h4><p>This method alternates between the two subjects, discussing one point at a time for each.</p><ul><li>Point 1 - discuss Subject A</li><li>Point 1 - discuss Subject B</li><li>Point 2 - discuss Subject A</li><li>Point 2 - discuss Subject B</li></ul><h4>Block / Subject-by-Subject Method</h4><p>This method presents all arguments related to Subject A first, and then presents all the arguments for Subject B.</p><ul><li>Subject A - Point 1, Point 2, Point 3</li><li>Subject B - Point 1, Point 2, Point 3</li></ul><h3>Useful Transitional Devices</h3><p><strong>For Comparison:</strong> similar to, similarly, in the same way, like, equally, also, too, each of</p><p><strong>For Contrast:</strong> in contrast, on the other hand, different from, whereas, while, unlike, however, but</p><div class=\"example-box\"><h4>Example: Basketball and Soccer</h4><p>Basketball and soccer are sports with many similarities and differences. <strong>Both</strong> sports are fun to play and are played with a round ball. <strong>Similarly</strong>, they both provide a ton of cardiovascular exercise. <strong>However</strong>, the differences are also clear. A basketball player uses his hands, <strong>whereas</strong> a soccer player uses his feet. <strong>In contrast</strong> to basketball which is played indoors, soccer is usually played outside on a large field.</p></div><div class=\"exercise-toggle\"><h4>Exercise 1</h4><p>Write a compare and/or contrast paragraph between city life and urban life.</p><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>This exercise requires students to write their own paragraphs. A sample answer could compare location (city is crowded, urban is less so), job opportunities (more in the city), and lifestyle (faster-paced in the city, quieter in urban/suburban areas).</p></div></div><div class=\"quiz-container\" data-quiz-id=\"compareContrastQuiz\"></div></div>"
    },
    {
      "id": "argumentative-paragraph",
      "title": "Argumentative Paragraph",
      "category": "Final Term Materials",
      "content": "<div><p><strong>Definition:</strong> An argument is an opinion (a claim) supported by facts (evidence).</p><p><strong>Purpose:</strong> To present a position and to have an audience adopt or at least seriously consider your argument.</p><h3>Outline</h3><ul><li><strong>Topic Sentence:</strong> Identify what is being argued for or against (your claim).</li><li><strong>Support Sentences:</strong> Include evidence like facts, examples, statistics, and expert research. You can also include a counter-argument to show you've considered other views.</li><li><strong>Concluding Sentence:</strong> Restate what is being argued for and why.</li></ul><h3>Useful Transitional Words</h3><p><strong>For giving reasons:</strong> because, since, for, due to the fact that</p><p><strong>For counter-argument:</strong> but, however, of course, nevertheless, although, despite</p><p><strong>For concluding:</strong> therefore, as a result, in conclusion, thus, consequently</p><div class=\"example-box\"><h4>Example: Technology makes us antisocial</h4><p>I agree with the statement that technology can make us antisocial. We are leading a luxurious lifestyle with the help of technology, <strong>but</strong> many things come with a price. <strong>For example</strong>, as smart phones have given us effortless life, it has affected us physically and socially. Kids spend time on phone playing games or watching videos. <strong>Consequently</strong>, they do not go for outings or any physical activities. <strong>To conclude</strong>, I would like to state that technology should be used as an aid to give comfort, but not as an alternative for real life socialization.</p></div><div class=\"quiz-container\" data-quiz-id=\"argumentativeParagraphQuiz\"></div></div>"
    },
    {
      "id": "process-analysis-paragraph",
      "title": "Process Analysis Paragraph",
      "category": "Final Term Materials",
      "content": "<div><p><strong>Definition:</strong> A process paragraph uses details and examples to explain how to do something or how a thing works.</p><p><strong>Purpose:</strong> To explain to the reader the order or steps needed to do something or to make something work.</p><h3>Types of Process Analysis</h3><ol><li><strong>Informative:</strong> Explains how something works (e.g., how a car engine functions). Usually written in the third person.</li><li><strong>Directive:</strong> Explains how to do something (e.g., how to change a tire). Usually written in the second person (\"you\").</li></ol><p>In both forms, the steps are typically organized in <strong><span class=\"translatable\">chronological</span> order</strong>.</p><h3>Useful Transitional Devices</h3><p><strong>At the start:</strong> At first, In the beginning, The first step...</p><p><strong>In the middle:</strong> Next, After that, Continuing with, Then...</p><p><strong>At the end:</strong> Finally, As you finish, The last step...</p><div class=\"example-box\"><h4>Example: Steps to Success (Job Interview)</h4><p>There are several steps that are necessary to prepare for a job interview. <strong>First of all</strong>, it is important to double check the time and location of the interview. <strong>Secondly</strong>, pick clothing that is appropriate for the type of job. <strong>Thirdly</strong>, before the interview, it is a good idea to do some research about the company. <strong>Finally</strong>, the applicant should end the interview positively with a handshake and enthusiasm about the job. By following these steps, applicants can increase their chances of hearing those exciting words, “You’re hired.”</p></div><div class=\"quiz-container\" data-quiz-id=\"processAnalysisParagraphQuiz\"></div></div>"
    },
    {
      "id": "cover-letter-cv",
      "title": "Cover Letter & CV",
      "category": "Final Term Materials",
      "content": "<div><h3>What is a Cover Letter?</h3><p>A cover letter is a document sent with your resume to provide additional information on your skills and experience. It provides detailed information on why you are qualified for the job you are applying for. Employers use cover letters as a way to <span class=\"translatable\">screen</span> applicants and to determine which candidates they would like to interview.</p><h3>What is a Curriculum Vitae (CV)?</h3><p>The curriculum vitae, also known as a CV or vita, is a comprehensive statement of your educational background, teaching, and research experience. It is the standard representation of <span class=\"translatable\">credentials</span> within academia.</p><div class=\"example-box\"><h4>Cover Letter Example Snippet</h4><p><strong>Sub: Applying for the post of a Librarian</strong></p><p>Dear Sir,</p><p>I, Faria Islam, would like to apply for the position of a Librarian which was advertised in The New Age dated on 10 December, 2018.</p><p>I am enthusiastically applying for this position because I firmly believe that a combination of my natural ability, personality and work experience all make me an ideal candidate for this role. In my current position as a Librarian Intern with British Council Library, I have gained an insight into the different levels of library management.</p></div><div class=\"example-box\"><h4>CV Example Snippet</h4><p><strong>Professional Summary:</strong></p><p>Enthusiastic, effective, passionate to take any kind of challenge. Assistant Head of Department with a proven record of helping children progress, providing positive learning experiences as well as building and maintaining effective behavior management systems. Enjoys sharing knowledge, inspiring both children and adults.</p><p><strong>Work Experience:</strong></p><p>11/2016 – Present<br/>Assistant Head of Department, Little Scholars’ School</p></div><div class=\"quiz-container\" data-quiz-id=\"coverLetterCvQuiz\"></div></div>"
    },
    {
      "id": "formal-letter-format",
      "title": "Formal Letter Format",
      "category": "Final Term Materials",
      "content": "<div><p>A formal letter is any letter written for a formal purpose, whether that be a recommendation letter, an invitation letter, or a complaint letter. Any communication that is considered official enough to be explicitly written or typed is a formal letter.</p><h3>Parts of a Formal Letter</h3><p>Business letters usually contain the following information in this order:</p><ol><li>Letterhead or sender's address</li><li>Date</li><li>Inside address (recipient's address)</li><li>Salutation (e.g., \"Dear Mr. Chowdhury:\")</li><li>Message/Body</li><li>Closing (e.g., \"Yours sincerely,\" or \"Yours faithfully,\")</li><li>Signature</li></ol><h3>Key Formatting Points</h3><ul><li>Use \"Yours faithfully\" when you do not know the recipient's name (e.g., \"Dear Sir or Madam\").</li><li>Use \"Yours sincerely\" when you know the recipient's name (e.g., \"Dear Ms. Chowdhury\").</li><li>The recipient's name in the salutation is followed by a colon (:).</li><li>The first paragraph should state the purpose of the letter. The last paragraph should state what action you expect the recipient to take.</li></ul><div class=\"quiz-container\" data-quiz-id=\"formalLetterQuiz\"></div></div>"
    },
    {
      "id": "run-ons",
      "title": "Run-ons",
      "category": "Final Term Materials",
      "content": "<div><p>These are also called <span class=\"translatable\">fused sentences</span>. You are making a run-on when you put two complete sentences (a subject and its predicate and another subject and its predicate) together in one sentence without separating them properly.</p><div class=\"example-box\"><p><strong>Example of a run-on:</strong></p><p><em>My favorite Mediterranean spread is hummus it is very garlicky.</em></p><p>This one sentence actually contains two complete sentences. Luckily, there are many ways to correct this.</p></div><h3>How to Correct a Run-on Sentence</h3><ol><li><strong>Use a semicolon:</strong><br/><em>My favorite Mediterranean spread is hummus; it is very garlicky.</em></li><li><strong>Use a comma and a coordinating conjunction (for, and, nor, but, or, yet, so):</strong><br/><em>My favorite Mediterranean spread is hummus, for it is very garlicky.</em></li><li><strong>Use a subordinating conjunction:</strong><br/><em>My favorite Mediterranean spread is hummus because it is very garlicky.</em></li><li><strong>Make it into two separate sentences:</strong><br/><em>My favorite Mediterranean spread is hummus. It is very garlicky.</em></li><li><strong>Use an em-dash (a long dash) for emphasis:</strong><br/><em>My favorite Mediterranean spread is hummus—it is very garlicky.</em></li></ol><p><strong>REMEMBER:</strong> You CANNOT simply add a comma between the two sentences, or you’ll end up with what’s called a “<span class=\"translatable\">comma splice</span>.”</p><h3>Finding Run-ons</h3><p>Try these two tests:</p><ul><li>Turn your sentence into a yes/no question.</li><li>Turn your sentence into a tag question (e.g., \"...isn't it?\").</li></ul><p>If the sentence is not a run-on, this is easy. \"My favorite Mediterranean spread is hummus\" becomes \"Is my favorite Mediterranean spread hummus?\"</p><p>But the run-on \"My favorite Mediterranean spread is hummus it is very garlicky\" cannot become one single question. You have to break it apart: \"Is my favorite Mediterranean spread hummus? Is it very garlicky?\" This shows it's a run-on.</p><div class=\"exercise-toggle\"><h4>Exercise I: Correcting Run-ons</h4><p>Try to correct the following run-on sentences.</p><ol><li>My mother and father and sister are coming to dinner tonight.</li><li>I like learning English it makes me tired.</li><li>My sister was taller than me when we were young now I am the tallest it is fun.</li><li>I love school, I love learning, my teacher is nice.</li><li>I don’t want much for my birthday just some chocolates and a little toy car.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><ol><li>My mother, father, and sister are coming to dinner tonight. (This was already a list, not a run-on)</li><li>I like learning English, but it makes me tired.</li><li>My sister was taller than me when we were young; now I am the tallest. It is fun.</li><li>I love school and I love learning. My teacher is nice.</li><li>I don’t want much for my birthday, just some chocolates and a little toy car.</li></ol></div></div><div class=\"quiz-container\" data-quiz-id=\"runOnsQuiz\"></div></div>"
    },
    {
      "id": "modifiers",
      "title": "Modifiers",
      "category": "Final Term Materials",
      "content": "<div><p>In English grammar, a modifier is a word, phrase, or clause that functions as an adjective or adverb to provide additional information about another word or word group (called the head). A modifier is also known as an <span class=\"translatable\">adjunct</span>.</p><div class=\"example-box\"><p><em>He is a cute baby.</em></p><p>In this sentence, “cute” is an adjective modifying the noun, “baby.” The adjective “cute” is a modifier. “Cute” modifies the type of baby.</p></div><h3>Dangling Modifier</h3><p>A dangling modifier is a word or phrase that modifies a word not clearly stated in the sentence. A modifier describes, clarifies, or gives more detail about a concept.</p><div class=\"example-box\"><p><strong>Correct:</strong> <em>Having finished the assignment, Jill turned on the TV.</em></p><p>\"Having finished\" states an action, and the doer of that action is logically the subject of the main clause, Jill. This sentence is correct.</p><p><strong>Incorrect (Dangling):</strong> <em>Having finished the assignment, the TV was turned on.</em></p><p>Here, the doer of the action \"Having finished\" is not the TV set. Since the doer is not clearly stated, the phrase is a dangling modifier.</p></div><h4>Strategies for revising dangling modifiers:</h4><ol><li><strong>Name the appropriate doer of the action as the subject of the main clause:</strong><p><em>Incorrect:</em> Having arrived late for practice, a written excuse was needed.<br/><em>Revised:</em> Having arrived late for practice, <strong>the team captain</strong> needed a written excuse.</p></li><li><strong>Change the phrase that dangles into a complete introductory clause by naming the doer of the action in that clause:</strong><p><em>Incorrect:</em> Without knowing his name, it was difficult to introduce him.<br/><em>Revised:</em> <strong>Because Maria did not know his name,</strong> it was difficult to introduce him.</p></li><li><strong>Combine the phrase and main clause into one:</strong><p><em>Incorrect:</em> To improve his results, the experiment was done again.<br/><em>Revised:</em> <strong>He improved his results by doing the experiment again.</strong></p></li></ol><h3>Misplaced Modifier</h3><p>Modifiers are words, phrases, or clauses that add description to sentences. Typically, you will find a modifier snuggled right next to—either in front of or behind—the word it logically describes. When a modifier is placed too far away from the word it should describe, it is a misplaced modifier.</p><div class=\"example-box\"><p><em>Incorrect:</em> Raymond wore his one collared shirt to the job interview, which was unfortunately stained with yellow mustard.</p><p>The clause 'which was unfortunately stained with yellow mustard' is describing 'interview', but an interview can't get stained. It should describe the shirt.</p><p><em>Correct:</em> Raymond wore his one collared shirt, <strong>which was unfortunately stained with yellow mustard</strong>, to the job interview.</p></div><div class=\"quiz-container\" data-quiz-id=\"modifierQuiz\"></div><div class=\"exercise-toggle\"><h4>Exercise II: Correct Misplaced Modifiers</h4><p>The following sentences may contain misplaced modifiers. Rewrite them correctly. Some may be correct.</p><ol><li>The man was stopped for speeding in the blue sweater.</li><li>I almost saw the whole movie, but I fell asleep around midnight.</li><li>Joey promised to mow the lawn running out the door.</li><li>The initials were those of the lovers carved on the tree.</li><li>There are only two parking spaces left in the lot.</li><li>Every four hours the doctor told him to take a pill.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>Rewritten sentences will vary. Here are some possible corrections:</p><ol><li>The man <strong>in the blue sweater</strong> was stopped for speeding.</li><li>I saw <strong>almost</strong> the whole movie, but I fell asleep around midnight.</li><li><strong>Running out the door,</strong> Joey promised to mow the lawn.</li><li>The initials of the lovers were carved on the tree. (Correct)</li><li><strong>Only</strong> two parking spaces are left in the lot.</li><li>The doctor told him to take a pill <strong>every four hours</strong>.</li></ol></div></div></div>"
    },
    {
      "id": "parallelism",
      "title": "Parallelism",
      "category": "Final Term Materials",
      "content": "<div><p>Parallel structure means using the same pattern of words to show that two or more ideas have the same level of importance. This can happen at the word, phrase, or clause level. The usual way to join parallel structures is with the use of coordinating conjunctions such as \"and\" or \"or.\"</p><h3>Words and Phrases</h3><p>When you have a series of items, ensure they are in the same grammatical form.</p><div class=\"example-box\"><p><strong>With the -ing form (gerund):</strong></p><p><em>Parallel:</em> Mary likes hiking, swimming, and bicycling.</p><p><strong>With infinitive phrases:</strong></p><p><em>Parallel:</em> Mary likes to hike, to swim, and to ride a bicycle. OR Mary likes to hike, swim, and ride a bicycle.</p><p><strong>Do not mix forms:</strong></p><p><em>Not Parallel:</em> Mary likes hiking, swimming, and to ride a bicycle.</p><p><em>Corrected:</em> Mary likes hiking, swimming, and <strong>riding</strong> a bicycle.</p></div><h3>Clauses</h3><p>A parallel structure that begins with clauses must keep on with clauses. Changing to another pattern will break the parallelism.</p><div class=\"example-box\"><p><em>Not Parallel:</em> The coach told the players that they should get a lot of sleep, that they should not eat too much, and to do some warm-up exercises before the game.</p><p><em>Parallel:</em> The coach told the players that they should get a lot of sleep, that they should not eat too much, and <strong>that they should do</strong> some warm-up exercises before the game.</p></div><h3>Lists after a Colon</h3><p>Be sure to keep all the elements in a list in the same form.</p><div class=\"example-box\"><p><em>Not Parallel:</em> The dictionary can be used to find these: word meanings, pronunciations, correct spellings, and looking up irregular verbs.</p><p><em>Parallel:</em> The dictionary can be used to find these: word meanings, pronunciations, correct spellings, and <strong>irregular verbs</strong>.</p></div><h3>Correlative Conjunctions</h3><p>In the case of correlative conjunctions (not only...but also; both...and; neither...nor; either...or), the grammatical form of the first construction should be parallel in the second construction.</p><div class=\"example-box\"><p><em>Not Parallel:</em> She is either exaggerating or she is telling the truth.</p><p><em>Parallel:</em> She is <strong>either exaggerating or telling</strong> the truth.</p></div><div class=\"quiz-container\" data-quiz-id=\"parallelismQuiz\"></div><div class=\"exercise-toggle\"><h4>Exercise I: Correcting Faulty Parallelism</h4><p>Correct the faulty parallelism in the following sentences to make them clear and concise.</p><ol><li>Linda gets her daily exercise by walking her dog, going for a bike ride, and cleaning.</li><li>Would you prefer the graceful owl, rats, or a sneaky cat as your pet?</li><li>The difference between rural and country living is the height of the buildings and the population.</li><li>Stress makes it difficult to exercise regularly, have relationships that are stable, and be eating food with benefits to one’s health.</li><li>The Writing Center can help your writing skills, to gain independence, and confidently completing your assignments.</li></ol><button class=\"toggle-button\">Show Solution</button><div class=\"solution\" style=\"display: none;\"><p>Possible corrections:</p><ol><li>Linda gets her daily exercise by walking her dog, riding her bike, and cleaning her house.</li><li>Would you prefer the graceful owl, the pesky rat, or the sneaky cat as your pet?</li></li><li>The difference between rural and country living is the height of the buildings and the size of the population.</li><li>Stress makes it difficult to exercise regularly, to have stable relationships, and to eat healthy food.</li><li>The Writing Center can help you improve your writing skills, gain independence, and complete your assignments confidently.</li></ol></div></div></div>"
    },
    {
      "id": "confusing-word-pairs",
      "title": "Confusing Word Pairs",
      "category": "Final Term Materials",

  "content": "<div><p>Some words in English look or sound similar but have very different meanings. Using the wrong word can change the entire meaning of your sentence. This section will help you understand the differences between some of the most commonly confused word pairs.</p><div class=\"word-entry\"><h3>1. Accept/Except</h3><p><strong>accept</strong>: A verb meaning “to agree to” or “to receive”</p><p>এক ক্রিয়া যার অর্থ “সম্মত হওয়া” বা “গ্রহণ করা”</p><p><em>EXAMPLE: I accept your apology.</em><br><em>উদাহরণ: আমি তোমার ক্ষমা প্রার্থনা গ্রহণ করছি।</em></p><p><strong>except</strong>: A preposition meaning “excluding”</p><p>একটি অব্যয় যার অর্থ “বাদ দিয়ে”</p><p><em>EXAMPLE: I like all vegetables except broccoli.</em><br><em>উদাহরণ: ব্রোকলি ছাড়া আমার সব সবজিই ভালো লাগে।</em></p></div><div class=\"word-entry\"><h3>2. Affect/Effect</h3><p><strong>affect</strong>: A verb meaning “to influence”</p><p>একটি ক্রিয়া যার অর্থ “প্রভাবিত করা”</p><p><em>EXAMPLE: Will missing class affect my grade?</em><br><em>উদাহরণ: ক্লাস বাদ দিলে কি আমার গ্রেডে প্রভাব পড়বে?</em></p><p><strong>effect</strong>: A noun meaning “result” or a verb meaning “to cause”</p><p>একটি বিশেষ্য যার অর্থ “ফল” অথবা একটি ক্রিয়া যার অর্থ “ঘটনোর কারণ হওয়া”</p><p><em>EXAMPLE: The effect of missing class will be a lower grade. (noun) Only the supervisor could effect change to the rules. (verb)</em><br><em>উদাহরণ: ক্লাস বাদ দেওয়ার ফল হবে একটি কম গ্রেড। (বিশেষ্য) শুধুমাত্র সুপারভাইজারই নিয়ম পরিবর্তন ঘটাতে পারতেন। (ক্রিয়া)</em></p></div><div class=\"word-entry\"><h3>3. Allusion/Illusion</h3><p><strong>allusion</strong>: A noun describing an indirect reference to something</p><p>একটি বিশেষ্য যা কোনো কিছুর পরোক্ষ উল্লেখ বোঝায়</p><p><em>EXAMPLE: The speaker made an allusion to a Greek myth.</em><br><em>উদাহরণ: বক্তা একটি গ্রীক পুরাণের পরোক্ষ উল্লেখ করেছিলেন।</em></p><p><strong>illusion</strong>: A noun indicating something that misleads or gives a false meaning or appearance</p><p>একটি বিশেষ্য যা বিভ্রান্ত করে বা ভুল অর্থ বা চেহারা দেয় এমন কিছু নির্দেশ করে</p><p><em>EXAMPLE: A magician uses illusion to entertain the audience.</em><br><em>উদাহরণ: একজন যাদুকর দর্শকদের বিনোদন দিতে মায়া ব্যবহার করে।</em></p></div><div class=\"word-entry\"><h3>4. Cite/Site/Sight</h3><p><strong>cite</strong>: A verb meaning “to quote an example or authority”</p><p>একটি ক্রিয়া যার অর্থ “একটি উদাহরণ বা কর্তৃপক্ষকে উদ্ধৃত করা”</p><p><em>EXAMPLE: You must cite all of your sources in your research paper.</em><br><em>উদাহরণ: আপনার গবেষণা পত্রে অবশ্যই আপনার সমস্ত উৎস উল্লেখ করতে হবে।</em></p><p><strong>site</strong>: A noun meaning “a particular place”</p><p>একটি বিশেষ্য যার অর্থ “একটি নির্দিষ্ট স্থান”</p><p><em>EXAMPLE: We visited several tourist sites.</em><br><em>উদাহরণ: আমরা বেশ কয়েকটি পর্যটন স্থান পরিদর্শন করেছি।</em></p><p><strong>sight</strong>: A noun describing the function of “seeing”</p><p>একটি বিশেষ্য যা “দেখা” এর কাজ বর্ণনা করে</p><p><em>EXAMPLE: Human beings have five senses: sight, touch, taste, sound, and smell.</em><br><em>উদাহরণ: মানুষের পাঁচটি ইন্দ্রিয় আছে: দৃষ্টি, স্পর্শ, স্বাদ, শব্দ এবং গন্ধ।</em></p></div><div class=\"word-entry\"><h3>5. Compliment/Complement</h3><p><strong>compliment</strong>: A noun that means “an expression of flattery, praise, or admiration”</p><p>একটি বিশেষ্য যার অর্থ “প্রশংসা, স্তুতি বা তারিফের অভিব্যক্তি”</p><p><em>EXAMPLE: Her compliment of my new dress made me smile.</em><br><em>উদাহরণ: আমার নতুন পোশাকের প্রশংসা শুনে আমি হাসলাম।</em></p><p><strong>complement</strong>: A noun that means “to complete” or “to add to” something</p><p>একটি বিশেষ্য যার অর্থ “সম্পূর্ণ করা” বা “কোনো কিছুতে যোগ করা”</p><p><em>EXAMPLE: Butter is the perfect complement for bread.</em><br><em>উদাহরণ: মাখন রুটির জন্য নিখুঁত পরিপূরক।</em></p></div><div class=\"word-entry\"><h3>6. Council/Counsel</h3><p><strong>council</strong>: A noun meaning “a group of people who meet together to make decisions”</p><p>একটি বিশেষ্য যার অর্থ “সিদ্ধান্ত নেওয়ার জন্য একত্রিত হওয়া একদল লোক”</p><p><em>EXAMPLE: Kamri was elected president of the school’s student council.</em><br><em>উদাহরণ: কামরি স্কুলের ছাত্র পরিষদের সভাপতি নির্বাচিত হয়েছিলেন।</em></p><p><strong>counsel</strong>: A noun meaning “advice” or a verb meaning “to advise”</p><p>একটি বিশেষ্য যার অর্থ “পরামর্শ” অথবা একটি ক্রিয়া যার অর্থ “পরামর্শ দেওয়া”</p><p><em>EXAMPLE: My mom gave me good counsel about living on my own. (noun) She counseled me to not procrastinate my homework. (verb)</em><br><em>উদাহরণ: আমার মা আমাকে নিজের মতো করে জীবনযাপন সম্পর্কে ভালো পরামর্শ দিয়েছিলেন। (বিশেষ্য) তিনি আমাকে বাড়ির কাজ ফেলে না রাখতে পরামর্শ দিয়েছিলেন। (ক্রিয়া)</em></p></div><div class=\"word-entry\"><h3>7. Explicit/Implicit</h3><p><strong>explicit</strong>: An adjective meaning “direct”</p><p>একটি বিশেষণ যার অর্থ “প্রত্যক্ষ” বা “সুস্পষ্ট”</p><p><em>EXAMPLE: Professor Anderson gave explicit instructions for writing the paper.</em><br><em>উদাহরণ: অধ্যাপক অ্যান্ডারসন কাগজ লেখার জন্য সুস্পষ্ট নির্দেশাবলী দিয়েছিলেন।</em></p><p><strong>implicit</strong>: An adjective meaning “implied”</p><p>একটি বিশেষণ যার অর্থ “উহ্য” বা “পরোক্ষ”</p><p><em>EXAMPLE: Her description of the party contained an implicit insult of the host.</em><br><em>উদাহরণ: পার্টির তার বর্ণনায় হোস্টের প্রতি একটি উহ্য অপমান ছিল।</em></p></div><div class=\"word-entry\"><h3>8. Farther/Further</h3><p><strong>farther</strong>: An adjective that describes an actual distance</p><p>একটি বিশেষণ যা একটি প্রকৃত দূরত্ব বর্ণনা করে</p><p><em>EXAMPLE: My house is farther from campus than yours.</em><br><em>উদাহরণ: আমার বাড়ি ক্যাম্পাসের চেয়ে তোমার বাড়ির থেকে আরও দূরে।</em></p><p><strong>further</strong>: An adjective meaning “more distant in degree, time, space, or quantity”</p><p>একটি বিশেষণ যার অর্থ “মাত্রা, সময়, স্থান বা পরিমাণে আরও দূরবর্তী”</p><p><em>EXAMPLE: Nothing could be further from the truth.</em><br><em>উদাহরণ: সত্য থেকে এর থেকে আর বেশি কিছু দূর হতে পারে না।</em></p></div><div class=\"word-entry\"><h3>9. Fewer/Less</h3><p><strong>fewer</strong>: An adjective meaning “a small number” that refers to things that can be counted</p><p>একটি বিশেষণ যার অর্থ “একটি ছোট সংখ্যা” যা গণনা করা যায় এমন জিনিস বোঝায়</p><p><em>EXAMPLE: Children have fewer teeth than adults.</em><br><em>উদাহরণ: শিশুদের প্রাপ্তবয়স্কদের চেয়ে কম দাঁত থাকে।</em></p><p><strong>less</strong>: An adjective meaning “little” that refers to a general amount or non-countable measurement</p><p>একটি বিশেষণ যার অর্থ “কম” যা একটি সাধারণ পরিমাণ বা অগণনাযোগ্য পরিমাপ বোঝায়</p><p><em>EXAMPLE: I prefer less salt on my popcorn.</em><br><em>উদাহরণ: আমি আমার পপকর্নে কম লবণ পছন্দ করি।</em></p></div><div class=\"word-entry\"><h3>10. Good/Well</h3><p><strong>good</strong>: An adjective meaning “suitable”</p><p>একটি বিশেষণ যার অর্থ “উপযুক্ত” বা “ভালো”</p><p><em>EXAMPLE: It was a good movie.</em><br><em>উদাহরণ: এটি একটি ভালো সিনেমা ছিল।</em></p><p><strong>well</strong>: An adverb meaning “in a proper manner”</p><p>একটি ক্রিয়া বিশেষণ যার অর্থ “সঠিকভাবে” বা “ভালোভাবে”</p><p><em>EXAMPLE: She plays basketball well.</em><br><em>উদাহরণ: সে ভালো বাস্কেটবল খেলে।</em></p></div><div class=\"word-entry\"><h3>11. Imply/Infer</h3><p><strong>imply</strong>: A verb meaning “to suggest or state indirectly” (refers to the speaker)</p><p>একটি ক্রিয়া যার অর্থ “পরোক্ষভাবে ইঙ্গিত করা বা বলা” (বক্তাকে বোঝায়)</p><p><em>EXAMPLE: He implied that I wasn’t capable of completing the job.</em><br><em>উদাহরণ: সে ইঙ্গিত করেছিল যে আমি কাজটি শেষ করতে সক্ষম নই।</em></p><p><strong>infer</strong>: A verb meaning “to conclude” (refers to the listener)</p><p>একটি ক্রিয়া যার অর্থ “উপসংহারে পৌঁছানো” (শ্রোতাকে বোঝায়)</p><p><em>EXAMPLE: I inferred there was trouble from the sight of the police cars.</em><br><em>উদাহরণ: পুলিশের গাড়ি দেখে আমি অনুমান করেছিলাম যে কোনো সমস্যা হয়েছে।</em></p></div><div class=\"word-entry\"><h3>12. Its/It’s</h3><p><strong>its</strong>: A personal possessive pronoun of “it”</p><p>“it” এর ব্যক্তিগত সম্বন্ধসূচক সর্বনাম</p><p><em>EXAMPLE: The bird broke its wing.</em><br><em>উদাহরণ: পাখিটি তার ডানা ভেঙেছিল।</em></p><p><strong>it’s</strong>: A contraction meaning “it is” or “it has”</p><p>একটি সংক্ষিপ্ত রূপ যার অর্থ “it is” বা “it has”</p><p><em>EXAMPLE: Unfortunately, it’s time to leave.</em><br><em>উদাহরণ: দুর্ভাগ্যবশত, এখন যাওয়ার সময়।</em></p></div><div class=\"word-entry\"><h3>13. Lay/Lie</h3><p><strong>lay</strong>: A verb that means “to put or place” and that needs a direct object</p><p>একটি ক্রিয়া যার অর্থ “স্থাপন করা” এবং একটি প্রত্যক্ষ কর্মের প্রয়োজন হয়</p><p><em>EXAMPLE: Lay the book on the table.</em><br><em>উদাহরণ: বইটি টেবিলের উপর রাখো।</em></p><p><strong>lie</strong>: A verb that means “to rest or recline” and that takes no direct object</p><p>একটি ক্রিয়া যার অর্থ “বিশ্রাম করা” বা “হেলান দেওয়া” এবং এর কোনো প্রত্যক্ষ কর্মের প্রয়োজন হয় না</p><p><em>EXAMPLE: I’m going to lie down for a while.</em><br><em>উদাহরণ: আমি কিছুক্ষণ শুয়ে থাকব।</em></p></div><div class=\"word-entry\"><h3>14. Loose/Lose</h3><p><strong>loose</strong>: An adjective meaning “not tight”</p><p>একটি বিশেষণ যার অর্থ “আঁটসাঁট নয়” বা “ঢিলেঢালা”</p><p><em>EXAMPLE: I like to wear loose clothing.</em><br><em>উদাহরণ: আমি ঢিলেঢালা পোশাক পরতে পছন্দ করি।</em></p><p><strong>lose</strong>: A verb that means “to misplace” or “to be defeated”</p><p>একটি ক্রিয়া যার অর্থ “হারিয়ে ফেলা” বা “পরাজিত হওয়া”</p><p><em>EXAMPLE: I hate it when I lose my keys.</em><br><em>উদাহরণ: আমি যখন আমার চাবি হারাই তখন আমার খুব খারাপ লাগে।</em></p></div><div class=\"word-entry\"><h3>15. May be/Maybe</h3><p><strong>may be</strong>: A verb phrase meaning “it might be possible”</p><p>একটি ক্রিয়াপদ যার অর্থ “এটি সম্ভব হতে পারে”</p><p><em>EXAMPLE: The storm may be more hazardous than we thought.</em><br><em>উদাহরণ: ঝড়টি আমাদের ধারণার চেয়েও বেশি বিপজ্জনক হতে পারে।</em></p><p><strong>maybe</strong>: An adverb showing possibility</p><p>একটি ক্রিয়া বিশেষণ যা সম্ভাবনা দেখায়</p><p><em>EXAMPLE: Maybe you should go to the doctor.</em><br><em>উদাহরণ: সম্ভবত তোমার ডাক্তারের কাছে যাওয়া উচিত।</em></p></div><div class=\"word-entry\"><h3>16. Principal/Principle</h3><p><strong>principal</strong>: A noun meaning “the head of a school” or an adjective meaning “most important”</p><p>একটি বিশেষ্য যার অর্থ “একটি স্কুলের প্রধান” অথবা একটি বিশেষণ যার অর্থ “সবচেয়ে গুরুত্বপূর্ণ”</p><p><em>EXAMPLE: Mrs. Smith, the principal of the school, is a very energetic woman. (noun)</em><br><em>উদাহরণ: মিসেস স্মিথ, স্কুলের অধ্যক্ষ, একজন অত্যন্ত উদ্যমী মহিলা। (বিশেষ্য)</em></p><p><strong>principle</strong>: A noun meaning “a basic truth”</p><p>একটি বিশেষ্য যার অর্থ “একটি মৌলিক সত্য” বা “নীতি”</p><p><em>EXAMPLE: Lying is against my principles.</em><br><em>উদাহরণ: মিথ্যা বলা আমার নীতির বিরুদ্ধে।</em></p></div><div class=\"word-entry\"><h3>17. Quite/Quiet/Quit</h3><p><strong>quite</strong>: An adverb meaning “whole” or “complete”</p><p>একটি ক্রিয়া বিশেষণ যার অর্থ “সম্পূর্ণ” বা “একেবারে”</p><p><em>EXAMPLE: He is quite thorough in his calculations.</em><br><em>উদাহরণ: তার গণনায় সে বেশ পুঙ্খানুপুঙ্খ।</em></p><p><strong>quiet</strong>: An adjective meaning “not making noise”</p><p>একটি বিশেষণ যার অর্থ “শব্দ না করা” বা “শান্ত”</p><p><em>EXAMPLE: Please be quiet; the baby is sleeping.</em><br><em>উদাহরণ: অনুগ্রহ করে শান্ত হন; শিশুটি ঘুমাচ্ছে।</em></p><p><strong>quit</strong>: A verb meaning “to stop” or “give up”</p><p>একটি ক্রিয়া যার অর্থ “থামা” বা “ছেড়ে দেওয়া”</p><p><em>EXAMPLE: I quit my job last Thursday.</em><br><em>উদাহরণ: আমি গত বৃহস্পতিবার আমার চাকরি ছেড়ে দিয়েছি।</em></p></div><div class=\"word-entry\"><h3>18. Set/Sit</h3><p><strong>set</strong>: A verb meaning “to place” and requiring a direct object</p><p>একটি ক্রিয়া যার অর্থ “স্থাপন করা” এবং একটি প্রত্যক্ষ কর্মের প্রয়োজন হয়</p><p><em>EXAMPLE: Ashley set her books on the table.</em><br><em>উদাহরণ: অ্যাশলি তার বইগুলো টেবিলের উপর রাখল।</em></p><p><strong>sit</strong>: A verb meaning “to be seated” and that takes no direct object</p><p>একটি ক্রিয়া যার অর্থ “বসা” এবং এর কোনো প্রত্যক্ষ কর্মের প্রয়োজন হয় না</p><p><em>EXAMPLE: Come sit by me.</em><br><em>উদাহরণ: এসে আমার পাশে বসো।</em></p></div><div class=\"word-entry\"><h3>19. Than/Then</h3><p><strong>than</strong>: A conjunction introducing a second element in a comparison</p><p>একটি সংযোজক অব্যয় যা একটি তুলনার দ্বিতীয় উপাদান প্রবর্তন করে</p><p><em>EXAMPLE: I am taller than my sister.</em><br><em>উদাহরণ: আমি আমার বোনের চেয়ে লম্বা।</em></p><p><strong>then</strong>: An adverb meaning “at that time,” “next,” or “after”</p><p>একটি ক্রিয়া বিশেষণ যার অর্থ “তখন,” “তারপর,” বা “পরে”</p><p><em>EXAMPLE: He picked up the tickets, and then he picked up his date.</em><br><em>উদাহরণ: সে টিকিটগুলো তুলল, তারপর তার ডেটকে নিয়ে গেল।</em></p></div><div class=\"word-entry\"><h3>20. There/Their/They’re</h3><p><strong>there</strong>: An adverb meaning “in that place”</p><p>একটি ক্রিয়া বিশেষণ যার অর্থ “সেই স্থানে” বা “সেখানে”</p><p><em>EXAMPLE: Put the books down there.</em><br><em>উদাহরণ: বইগুলো সেখানে রাখো।</em></p><p><strong>their</strong>: A personal possessive pronoun for “they”</p><p>“they” এর ব্যক্তিগত সম্বন্ধসূচক সর্বনাম</p><p><em>EXAMPLE: It’s their fault!</em><br><em>উদাহরণ: এটা তাদেরই দোষ!</em></p><p><strong>they’re</strong>: A contraction for “they are”</p><p>“they are” এর সংক্ষিপ্ত রূপ</p><p><em>EXAMPLE: They’re going to eat dinner at seven.</em><br><em>উদাহরণ: তারা সাতটায় রাতের খাবার খেতে যাচ্ছে।</em></p></div><div class=\"word-entry\"><h3>21. Thorough/Through/Threw</h3><p><strong>thorough</strong>: An adjective meaning “complete in all respects”</p><p>একটি বিশেষণ যার অর্থ “সকল দিক থেকে সম্পূর্ণ” বা “পুঙ্খানুপুঙ্খ”</p><p><em>EXAMPLE: Steve did a thorough job washing my car.</em><br><em>উদাহরণ: স্টিভ আমার গাড়ি ধোয়ার কাজটি পুঙ্খানুপুঙ্খভাবে করেছে।</em></p><p><strong>through</strong>: A preposition meaning “in one side and out another side”</p><p>একটি অব্যয় যার অর্থ “একপাশ দিয়ে ঢুকে অন্য পাশ দিয়ে বেরিয়ে যাওয়া” বা “ভিতর দিয়ে”</p><p><em>EXAMPLE: To get to my apartment, you must drive through the tunnel.</em><br><em>উদাহরণ: আমার অ্যাপার্টমেন্টে যেতে হলে তোমাকে টানেলের ভিতর দিয়ে যেতে হবে।</em></p><p><strong>threw</strong>: The irregular past tense form of the verb “throw”</p><p>“throw” ক্রিয়ার অনিয়মিত অতীতকাল রূপ</p><p><em>EXAMPLE: Chris threw the ball at me.</em><br><em>উদাহরণ: ক্রিস আমার দিকে বল ছুড়েছিল।</em></p></div><div class=\"word-entry\"><h3>22. To/Too/Two</h3><p><strong>to</strong>: Either a preposition or the initial part of an infinitive verb phrase</p><p>হয় একটি অব্যয় অথবা একটি অসীম ক্রিয়া পদের প্রাথমিক অংশ</p><p><em>EXAMPLE: My mom sent me to the store. (preposition)</em><br><em>উদাহরণ: আমার মা আমাকে দোকানে পাঠিয়েছিলেন। (অব্যয়)</em></p><p><strong>too</strong>: An adverb meaning “also”</p><p>একটি ক্রিয়া বিশেষণ যার অর্থ “এছাড়াও” বা “খুব বেশি”</p><p><em>EXAMPLE: I like dancing, and I like singing, too.</em><br><em>উদাহরণ: আমি নাচ পছন্দ করি, এবং গান গাওয়াও পছন্দ করি।</em></p><p><strong>two</strong>: The number 2</p><p>সংখ্যা ২</p><p><em>EXAMPLE: I have two dogs.</em><br><em>উদাহরণ: আমার দুটি কুকুর আছে।</em></p></div><div class=\"word-entry\"><h3>23. Weather/Whether</h3><p><strong>weather</strong>: A noun referring to the condition of the atmosphere</p><p>একটি বিশেষ্য যা বায়ুমণ্ডলের অবস্থা বোঝায়</p><p><em>EXAMPLE: We are having unusual weather for this time of year.</em><br><em>উদাহরণ: বছরের এই সময়ে আমাদের অস্বাভাবিক আবহাওয়া চলছে।</em></p><p><strong>whether</strong>: A conjunction that indicates a choice between things</p><p>একটি সংযোজক অব্যয় যা জিনিসগুলির মধ্যে একটি পছন্দ নির্দেশ করে</p><p><em>EXAMPLE: Sarah couldn’t decide whether she should go to the dance or stay home.</em><br><em>উদাহরণ: সারাহ সিদ্ধান্ত নিতে পারছিল না যে সে নাচে যাবে নাকি বাড়িতে থাকবে।</em></p></div><div class=\"word-entry\"><h3>24. Whose/Who’s</h3><p><strong>whose</strong>: A personal possessive pronoun for “who”</p><p>“who” এর ব্যক্তিগত সম্বন্ধসূচক সর্বনাম</p><p><em>EXAMPLE: Whose book is that anyway?</em><br><em>উদাহরণ: এই বইটি কার?</em></p><p><strong>who’s</strong>: A contraction for “who is” or “who has”</p><p>“who is” বা “who has” এর সংক্ষিপ্ত রূপ</p><p><em>EXAMPLE: Who’s here?</em><br><em>উদাহরণ: এখানে কে আছে?</em></p></div><div class=\"word-entry\"><h3>25. Your/You’re</h3><p><strong>your</strong>: A personal possessive pronoun for “you”</p><p>“you” এর ব্যক্তিগত সম্বন্ধসূচক সর্বনাম</p><p><em>EXAMPLE: Is that your new car?</em><br><em>উদাহরণ: ওটা কি তোমার নতুন গাড়ি?</em></p><p><strong>you’re</strong>: A contraction for “you are”</p><p>“you are” এর সংক্ষিপ্ত রূপ</p><p><em>EXAMPLE: You’re a good friend.</em><br><em>উদাহরণ: তুমি একজন ভালো বন্ধু।</em></p></div></div>"
},
    {
      "id": "phrasal-verbs",
      "title": "Phrasal Verbs",
      "category": "Final Term Materials",

"content": "<div><p>A phrasal verb is a verb that is made up of a main verb together with an adverb or a preposition, or both. Typically, their meaning is not obvious from the meanings of the individual words themselves. You should know that <strong>sb.</strong> stands for \"somebody\" and <strong>sth.</strong> stands for \"something\".</p><div class=\"word-entry\"><h3>1. Pick up</h3><p><strong>Meaning:</strong> answer a telephone call.</p><p><strong>বাংলা ব্যাখ্যা:</strong> ফোন ধরা।</p><p><em>Example:</em> I kept calling her but she wouldn't pick up, so I couldn't tell her the news.</p></div><div class=\"word-entry\"><h3>2. Speak up</h3><p><strong>Meaning:</strong> talk more loudly.</p><p><strong>বাংলা ব্যাখ্যা:</strong> জোরে কথা বলা।</p><p><em>Example:</em> (On the phone) Could you speak up, please? I can't hear you properly.</p></div><div class=\"word-entry\"><h3>3. Hang up (on sb.)</h3><p><strong>Meaning:</strong> end a telephone call.</p><p><strong>বাংলা ব্যাখ্যা:</strong> ফোন রেখে দেওয়া (কারো উপর)।</p><p><em>Example:</em> She hung up on me when I told her what I'd done.</p></div><div class=\"word-entry\"><h3>4. Chill out</h3><p><strong>Meaning:</strong> calm down and relax.</p><p><strong>বাংলা ব্যাখ্যা:</strong> শান্ত হওয়া এবং আরাম করা।</p><p><em>Example:</em> At the end of the day, I just want to put my feet up and chill out before going to bed.</p></div><div class=\"word-entry\"><h3>5. Doze off</h3><p><strong>Meaning:</strong> fall lightly asleep.</p><p><strong>বাংলা ব্যাখ্যা:</strong> হালকাভাবে ঘুমিয়ে পড়া।</p><p><em>Example:</em> I don't take a real nap after lunch, I simply doze off for a bit in front of the TV.</p></div><div class=\"word-entry\"><h3>6. Run out of (sth.)</h3><p><strong>Meaning:</strong> finish one’s supply of something.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো কিছুর সরবরাহ শেষ হয়ে যাওয়া।</p><p><em>Example:</em> We've run out of eggs; could you go and get some more, please?</p></div><div class=\"word-entry\"><h3>7. Put sth. back</h3><p><strong>Meaning:</strong> replace something.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু জিনিস আগের জায়গায় ফিরিয়ে রাখা।</p><p><em>Example:</em> Remember to put the books back on the shelves when you finish reading them.</p></div><div class=\"word-entry\"><h3>8. Look after sb./sth.</h3><p><strong>Meaning:</strong> take care of something or someone.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কারো বা কিছুর যত্ন নেওয়া।</p><p><em>Example:</em> I normally ask my parents to look after my dog when I'm on holiday abroad.</p></div><div class=\"word-entry\"><h3>9. Talk back to sb.</h3><p><strong>Meaning:</strong> reply defiantly or insolently.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কারো সাথে অবাধ্যভাবে বা অভদ্রভাবে উত্তর দেওয়া।</p><p><em>Example:</em> Unfortunately, all children talk back to their parents from time to time.</p></div><div class=\"word-entry\"><h3>10. Go for sth.</h3><p><strong>Meaning:</strong> decide on something; choose.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো কিছু সিদ্ধান্ত নেওয়া; নির্বাচন করা।</p><p><em>Example:</em> (In a restaurant) I think I'll go for the steak this time. I didn't like the fish the other day.</p></div><div class=\"word-entry\"><h3>11. Break up (with sb.)</h3><p><strong>Meaning:</strong> end a romantic relationship with someone.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কারো সাথে প্রেমের সম্পর্ক ভেঙে ফেলা।</p><p><em>Example:</em> After they broke up, he didn't leave his house for a week.</p></div><div class=\"word-entry\"><h3>12. Break (sth.) down</h3><p><strong>Meaning:</strong> stop or cause to stop functioning.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো কিছু ভেঙে যাওয়া বা কার্যকারিতা বন্ধ করা।</p><p><em>Example:</em> My TV seems to be breaking down all the time.</p></div><div class=\"word-entry\"><h3>13. Hang (sth.) out (to dry)</h3><p><strong>Meaning:</strong> hang from a clothes line to dry.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (কাপড়) শুকানোর জন্য দড়িতে ঝোলানো।</p><p><em>Example:</em> I don't mind ironing, but I hate hanging the clothes out to dry.</p></div><div class=\"word-entry\"><h3>14. Wash (sth.) up</h3><p><strong>Meaning:</strong> clean crockery and cutlery after use.</p><p><strong>বাংলা ব্যাখ্যা:</strong> ব্যবহার করার পর থালা-বাসন ধোয়া।</p><p><em>Example:</em> I don't have to wash up any more; I bought myself a dishwasher.</p></div><div class=\"word-entry\"><h3>15. Warm sth. up</h3><p><strong>Meaning:</strong> reheat previously cooked food or drink.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো কিছু (খাবার বা পানীয়) পুনরায় গরম করা।</p><p><em>Example:</em> I sometimes have to warm up my coffee because it takes me a whole morning to drink it.</p></div><div class=\"word-entry\"><h3>16. Heat sth. up</h3><p><strong>Meaning:</strong> make or become hot or warm.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো কিছু গরম করা বা গরম হওয়া।</p><p><em>Example:</em> I think we can heat up yesterday's pizza and have it for dinner, right?</p></div><div class=\"word-entry\"><h3>17. Look for sth./sb.</h3><p><strong>Meaning:</strong> try to find something or someone.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু বা কাউকে খোঁজা।</p><p><em>Example:</em> Jack was looking for his phone everywhere, but couldn't find it.</p></div><div class=\"word-entry\"><h3>18. Fall out with sb.</h3><p><strong>Meaning:</strong> have an argument and stop being friends.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কারো সাথে ঝগড়া করা এবং বন্ধুত্ব বন্ধ করা।</p><p><em>Example:</em> They were flat mates for two years, but then they fell out and never spoke to each other again.</p></div><div class=\"word-entry\"><h3>19. Come down with (an illness)</h3><p><strong>Meaning:</strong> begin to suffer from a specified illness.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কোনো নির্দিষ্ট অসুস্থতায় আক্রান্ত হওয়া শুরু করা।</p><p><em>Example:</em> Oh, god! I think I'm coming down with flu. I might not go to work tomorrow.</p></div><div class=\"word-entry\"><h3>20. Tear sth. out</h3><p><strong>Meaning:</strong> to pull or be pulled apart, or to pull pieces off.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু ছিঁড়ে ফেলা বা আলাদা করে ফেলা।</p><p><em>Example:</em> He tore out the pages that he didn't want anyone to read.</p></div><div class=\"word-entry\"><h3>21. Rip sth. up</h3><p><strong>Meaning:</strong> tear something violently into small pieces so as to destroy it.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু ছিঁড়ে টুকরো টুকরো করে নষ্ট করে ফেলা।</p><p><em>Example:</em> She ripped up her pile of old letters and put them in the bin.</p></div><div class=\"word-entry\"><h3>22. Plug sth. in</h3><p><strong>Meaning:</strong> connect an electrical appliance to the mains by inserting a plug in a socket.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (বৈদ্যুতিক যন্ত্র) সকেটে লাগিয়ে চালু করা।</p><p><em>Example:</em> I need to plug in my phone; it's completely out of juice.</p></div><div class=\"word-entry\"><h3>23. Pay sb./sth. back</h3><p><strong>Meaning:</strong> repay some money or a loan to someone.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কাউকে টাকা বা ঋণ ফেরত দেওয়া।</p><p><em>Example:</em> If you lend me the money, I swear I'll pay you back by Friday.</p></div><div class=\"word-entry\"><h3>24. Print sth. out</h3><p><strong>Meaning:</strong> produce a paper copy of information stored on a computer.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কম্পিউটার থেকে কোনো তথ্যের কাগজের কপি তৈরি করা।</p><p><em>Example:</em> My boss asked me to print out the report and give it to him.</p></div><div class=\"word-entry\"><h3>25. Give in (to sb./sth.)</h3><p><strong>Meaning:</strong> accept someone’s wish or cease fighting; admit defeat.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কারো ইচ্ছা মেনে নেওয়া বা লড়াই বন্ধ করা; পরাজয় স্বীকার করা।</p><p><em>Example:</em> He reluctantly gave in to the pressure they were putting on him.</p></div><div class=\"word-entry\"><h3>26. Work sth. out</h3><p><strong>Meaning:</strong> find or try to find the answer to something; solve a sum or determine an amount by calculation.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (সমস্যা বা হিসাব) সমাধান করা।</p><p><em>Example:</em> I couldn’t work out whether it was a band playing or a record.</p></div><div class=\"word-entry\"><h3>27. Give up</h3><p><strong>Meaning:</strong> stop making an effort; admit defeat.</p><p><strong>বাংলা ব্যাখ্যা:</strong> চেষ্টা করা বন্ধ করা; পরাজয় স্বীকার করা।</p><p><em>Example:</em> It's not like you to give up so easily on an assignment so early after starting school.</p></div><div class=\"word-entry\"><h3>28. Put up with sth./sb.</h3><p><strong>Meaning:</strong> tolerate, endure, bear.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু বা কারো সাথে সহ্য করা, মেনে নেওয়া।</p><p><em>Example:</em> I'm leaving so I don't have to put up with you anymore.</p></div><div class=\"word-entry\"><h3>29. Turn sth. on</h3><p><strong>Meaning:</strong> adjust a tap or switch in order to start the operation or flow of something.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (পানি, আলো, বিদ্যুৎ) চালু করা।</p><p><em>Example:</em> She turned her PC on and opened her browser.</p></div><div class=\"word-entry\"><h3>30. Log in</h3><p><strong>Meaning:</strong> go through the procedures to begin use of a computer, database, or system.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কম্পিউটার, ডেটাবেস বা সিস্টেমে প্রবেশ করা।</p><p><em>Example:</em> I tried to log in with my username, but I couldn't remember my password.</p></div><div class=\"word-entry\"><h3>31. Go off</h3><p><strong>Meaning:</strong> (of an alarm) begin to sound.</p><p><strong>বাংলা ব্যাখ্যা:</strong> (অ্যালার্ম) বেজে ওঠা।</p><p><em>Example:</em> From the time my alarm clock goes off, I am beginning my workout.</p></div><div class=\"word-entry\"><h3>32. Wake (sb.) up</h3><p><strong>Meaning:</strong> emerge or cause someone to emerge from sleep.</p><p><strong>বাংলা ব্যাখ্যা:</strong> ঘুম থেকে জেগে ওঠা বা কাউকে জাগানো।</p><p><em>Example:</em> I woke up at 7 o'clock.</p></div><div class=\"word-entry\"><h3>33. Get (sb.) up</h3><p><strong>Meaning:</strong> rise or cause someone to rise from bed after sleeping.</p><p><strong>বাংলা ব্যাখ্যা:</strong> ঘুম থেকে ওঠা বা কাউকে বিছানা থেকে তোলা।</p><p><em>Example:</em> I got up feeling tired and disoriented.</p></div><div class=\"word-entry\"><h3>34. Put sth. on</h3><p><strong>Meaning:</strong> place a garment, jewellery, etc. on part of one’s body</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (পোশাক, গয়না) পরা।</p><p><em>Example:</em> I put on my watch and set off a little late.</p></div><div class=\"word-entry\"><h3>35. Dress up</h3><p><strong>Meaning:</strong> put on smart or formal clothes.</p><p><strong>বাংলা ব্যাখ্যা:</strong> সুন্দর বা আনুষ্ঠানিক পোশাক পরা।</p><p><em>Example:</em> I only dress up on special occasions, like weddings or other celebrations.</p></div><div class=\"word-entry\"><h3>36. Tidy up (sth.)</h3><p><strong>Meaning:</strong> bring order to; arrange neatly.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (জায়গা) পরিপাটি করা।</p><p><em>Example:</em> The children don't like tidying up their bedrooms, but they always do it.</p></div><div class=\"word-entry\"><h3>37. Switch sth. on</h3><p><strong>Meaning:</strong> start the flow or operation of something by means of a tap, switch, or button.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (আলো, টিভি, যন্ত্র) চালু করা।</p><p><em>Example:</em> She switched on the TV to watch her favourite show.</p></div><div class=\"word-entry\"><h3>38. Take sth. off</h3><p><strong>Meaning:</strong> remove clothing from one’s or another’s body.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কিছু (পোশাক) খুলে ফেলা।</p><p><em>Example:</em> I took off my shoes and lay down on the sofa.</p></div><div class=\"word-entry\"><h3>39. Warm up</h3><p><strong>Meaning:</strong> prepare for physical exertion or a performance by exercising or practicing gently beforehand.</p><p><strong>বাংলা ব্যাখ্যা:</strong> (শারীরিক পরিশ্রম বা পরিবেশনার জন্য) হালকা ব্যায়াম করে প্রস্তুত হওয়া।</p><p><em>Example:</em> I always warm up thoroughly before going out for a jog.</p></div><div class=\"word-entry\"><h3>40. Work out</h3><p><strong>Meaning:</strong> engage in vigorous physical exercise.</p><p><strong>বাংলা ব্যাখ্যা:</strong> (শারীরিক) ব্যায়াম করা।</p><p><em>Example:</em> John tries to work out three or four times a week at the local gym.</p></div><div class=\"word-entry\"><h3>41. Let sb. in</h3><p><strong>Meaning:</strong> admit someone to a room, building, or area.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কাউকে (ঘরে, বাড়িতে) প্রবেশ করতে দেওয়া।</p><p><em>Example:</em> We let our lovely dog in the house every morning.</p></div><div class=\"word-entry\"><h3>42. Come in</h3><p><strong>Meaning:</strong> enter a room, building, or other place.</p><p><strong>বাংলা ব্যাখ্যা:</strong> (ঘরে, বাড়িতে) প্রবেশ করা।</p><p><em>Example:</em> Please, come in and sit down.</p></div><div class=\"word-entry\"><h3>43. Move over</h3><p><strong>Meaning:</strong> adjust one’s position to make room for someone else.</p><p><strong>বাংলা ব্যাখ্যা:</strong> অন্য কারো জন্য জায়গা করে দিতে নিজের অবস্থান পরিবর্তন করা।</p><p><em>Example:</em> Could you guys move over so I can sit down as well, please?</p></div><div class=\"word-entry\"><h3>44. Kick sb. out</h3><p><strong>Meaning:</strong> expel or dismiss someone.</p><p><strong>বাংলা ব্যাখ্যা:</strong> কাউকে তাড়িয়ে দেওয়া বা বরখাস্ত করা।</p><p><em>Example:</em> They kicked me out of the club after the fight.</p></div><div class=\"word-entry\"><h3>45. Drink up</h3><p><strong>Meaning:</strong> quickly consume the rest of a drink.</p><p><strong>বাংলা ব্যাখ্যা:</strong> পানীয় দ্রুত পান করে শেষ করা।</p><p><em>Example:</em> She drank up what was left of her beer and left in a hurry.</p></div></div>"
 },
    {
      "id": "academic-word-list-2",
      "title": "Academic Word List 2",
      "category": "Final Term Materials",
      "content": "<div><p>This is the second list of important words frequently used in academic texts. Mastering these will further enhance your reading comprehension and writing skills.</p><div class=\"word-entry\"><h3>1. incongruity</h3><p><strong>English Definition:</strong> the quality of disagreeing; being unsuitable and inappropriate</p><p><strong>বাংলা ব্যাখ্যা:</strong> অসঙ্গতি; বেমানান বা অনুপযুক্ত হওয়া।</p><p><strong>Examples:</strong></p><ul><li>The incongruity between the decisions of the parents can ruin a child’s life.</li><li>There is a huge sense of incongruity between what he says and what he does.</li></ul></div><div class=\"word-entry\"><h3>2. inconsequential</h3><p><strong>English Definition:</strong> lacking worth or importance</p><p><strong>বাংলা ব্যাখ্যা:</strong> মূল্যহীন বা গুরুত্বহীন; অকিঞ্চিৎকর।</p><p><strong>Examples:</strong></p><ul><li>Worrying about inconsequential tasks will prevent you from doing projects which really matter.</li><li>Despite the teacher’s warning, the students would not stop their inconsequential chatter.</li></ul></div><div class=\"word-entry\"><h3>3. incorporate</h3><p><strong>English Definition:</strong> make into a whole or make part of a whole</p><p><strong>বাংলা ব্যাখ্যা:</strong> অন্তর্ভুক্ত করা; একটি সম্পূর্ণ অংশ তৈরি করা।</p><p><strong>Examples:</strong></p><ul><li>No definition is complete without incorporating examples.</li><li>We can incorporate this information into our report.</li></ul></div><div class=\"word-entry\"><h3>4. indeterminate</h3><p><strong>English Definition:</strong> not fixed or known in advance</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনির্ধারিত; আগে থেকে স্থির বা জানা নয়।</p><p><strong>Examples:</strong></p><ul><li>We are expecting an indeterminate number of guests.</li><li>The judge sentenced the drunk driver to an indeterminate prison stretch of seven to fifteen years.</li></ul></div><div class=\"word-entry\"><h3>5. indigence</h3><p><strong>English Definition:</strong> a state of extreme poverty or destitution</p><p><strong>বাংলা ব্যাখ্যা:</strong> চরম দারিদ্র্য বা অভাবের অবস্থা; দীনতা।</p><p><strong>Examples:</strong></p><ul><li>Their indigence appalled him.</li><li>The luxury of one class is counterbalanced by the indigence of another.</li></ul></div><div class=\"word-entry\"><h3>6. indolent</h3><p><strong>English Definition:</strong> disinclined to work or exertion</p><p><strong>বাংলা ব্যাখ্যা:</strong> অলস; কাজ বা শ্রমে অনাগ্রহী।</p><p><strong>Examples:</strong></p><ul><li>The natives were allowed to live the indolent life of the tropics.</li><li>Rather than fetch the ball, the indolent dog decided to take a nap.</li></ul></div><div class=\"word-entry\"><h3>7. inert</h3><p><strong>English Definition:</strong> unable to move or resist motion</p><p><strong>বাংলা ব্যাখ্যা:</strong> নিস্তেজ; নড়াচড়া করতে বা গতির প্রতিরোধ করতে অক্ষম।</p><p><strong>Examples:</strong></p><ul><li>After being sprayed with the poison, the fly was inert and could not move.</li><li>He lay, inert, in his bed.</li></ul></div><div class=\"word-entry\"><h3>8. ingenuous</h3><p><strong>English Definition:</strong> lacking in sophistication or worldliness</p><p><strong>বাংলা ব্যাখ্যা:</strong> সরল; পরিশীলিত বা জাগতিক জ্ঞানের অভাব।</p><p><strong>Examples:</strong></p><ul><li>He seemed too ingenuous for a reporter.</li><li>It is ingenuous to suppose that money did not play a part in his decision.</li></ul></div><div class=\"word-entry\"><h3>9. inherent</h3><p><strong>English Definition:</strong> existing as an essential constituent or characteristic</p><p><strong>বাংলা ব্যাখ্যা:</strong> অন্তর্নিহিত; অপরিহার্য উপাদান বা বৈশিষ্ট্য হিসাবে বিদ্যমান।</p><p><strong>Examples:</strong></p><ul><li>Most mothers have an inherent need to protect their children.</li><li>There was an inherent weakness in the design.</li></ul></div><div class=\"word-entry\"><h3>10. innocuous</h3><p><strong>English Definition:</strong> not injurious to physical or mental health</p><p><strong>বাংলা ব্যাখ্যা:</strong> ক্ষতিকর নয়; শারীরিক বা মানসিক স্বাস্থ্যের জন্য আঘাতজনক নয়।</p><p><strong>Examples:</strong></p><ul><li>While you may think bullying is innocuous, it leaves a lasting scar on its victim.</li><li>His comment seemed perfectly innocuous.</li></ul></div><div class=\"word-entry\"><h3>11. insensible</h3><p><strong>English Definition:</strong> barely able to be perceived</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনূভবাতীত; প্রায় উপলব্ধি করা যায় না এমন।</p><p><strong>Examples:</strong></p><ul><li>We are not insensible of your kindness.</li><li>She remained insensible of the dangers that lay ahead.</li></ul></div><div class=\"word-entry\"><h3>12. insinuate</h3><p><strong>English Definition:</strong> suggest in an indirect or covert way; give to understand</p><p><strong>বাংলা ব্যাখ্যা:</strong> পরোক্ষভাবে ইঙ্গিত করা; সূক্ষ্মভাবে বোঝানো।</p><p><strong>Examples:</strong></p><ul><li>Many dictators use propaganda to insinuate fear among the public.</li><li>He tried to insinuate himself into the boss's favor.</li></ul></div><div class=\"word-entry\"><h3>13. insipid</h3><p><strong>English Definition:</strong> lacking interest or significance or impact</p><p><strong>বাংলা ব্যাখ্যা:</strong> নীরস; আগ্রহ, তাৎপর্য বা প্রভাবের অভাব।</p><p><strong>Examples:</strong></p><ul><li>After an hour of insipid conversation, I left.</li><li>On the surface she seemed meek, rather insipid.</li></ul></div><div class=\"word-entry\"><h3>14. insularity</h3><p><strong>English Definition:</strong> the state of being isolated or detached</p><p><strong>বাংলা ব্যাখ্যা:</strong> বিচ্ছিন্নতা; বিচ্ছিন্ন বা সংযুক্ত না থাকার অবস্থা।</p><p><strong>Examples:</strong></p><ul><li>Part of this is explained by the neighborhood's insularity.</li><li>The way they lived then was remarkable for its innocence and its insularity.</li></ul></div><div class=\"word-entry\"><h3>15. intractable</h3><p><strong>English Definition:</strong> difficult to manage or mold</p><p><strong>বাংলা ব্যাখ্যা:</strong> দুশ্চিকিৎস্য; পরিচালনা বা আকার দেওয়া কঠিন।</p><p><strong>Examples:</strong></p><ul><li>Additional police officers were called to the scene when the crowd became intractable.</li><li>We are facing an intractable problem.</li></ul></div><div class=\"word-entry\"><h3>16. inundate</h3><p><strong>English Definition:</strong> overwhelm someone with things or people to deal with, or fill or cover with water</p><p><strong>বাংলা ব্যাখ্যা:</strong> প্লাবিত করা; কোন কিছু বা মানুষের সাথে মোকাবিলা করতে overwhelmed হওয়া, অথবা জল দিয়ে ভরাট বা আচ্ছাদিত করা।</p><p><strong>Examples:</strong></p><ul><li>We have been inundated with requests for help.</li><li>The fields were inundated with flood.</li></ul></div><div class=\"word-entry\"><h3>17. inured</h3><p><strong>English Definition:</strong> made tough by habitual exposure</p><p><strong>বাংলা ব্যাখ্যা:</strong> অভ্যস্ত; নিয়মিত সংস্পর্শে কঠিন করে তোলা।</p><p><strong>Examples:</strong></p><ul><li>After living here for years I've become inured to the cold climate.</li><li>Doctors become inured to death.</li></ul></div><div class=\"word-entry\"><h3>18. invective</h3><p><strong>English Definition:</strong> abusive language used to express blame or censure</p><p><strong>বাংলা ব্যাখ্যা:</strong> কুৎসা; দোষ বা নিন্দা প্রকাশের জন্য ব্যবহৃত অপমানজনক ভাষা।</p><p><strong>Examples:</strong></p><ul><li>He retorted the invective on her.</li><li>A woman had hurled racist invective at the family.</li></ul></div><div class=\"word-entry\"><h3>19. irresolute</h3><p><strong>English Definition:</strong> uncertain how to act or proceed</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনির্দিষ্ট; কীভাবে কাজ করতে হবে বা অগ্রসর হতে হবে তা নিয়ে অনিশ্চিত।</p><p><strong>Examples:</strong></p><ul><li>The irresolute spend the most precious moments of life regretting.</li><li>He is never irresolute or inactive.</li></ul></div><div class=\"word-entry\"><h3>20. laconic</h3><p><strong>English Definition:</strong> brief and to the point</p><p><strong>বাংলা ব্যাখ্যা:</strong> সংক্ষিপ্ত; অল্প কথায় এবং সরাসরি।</p><p><strong>Examples:</strong></p><ul><li>She had a laconic explanation of the matter.</li><li>The manner is laconic yet earnest.</li></ul></div><div class=\"word-entry\"><h3>21. lassitude</h3><p><strong>English Definition:</strong> a feeling of lack of interest or energy</p><p><strong>বাংলা ব্যাখ্যা:</strong> অবসাদ; আগ্রহ বা শক্তির অভাব বোধ।</p><p><strong>Examples:</strong></p><ul><li>I was overcome by lassitude.</li><li>Neither illness nor lassitude prevented him from going on with his work.</li></ul></div><div class=\"word-entry\"><h3>22. laud</h3><p><strong>English Definition:</strong> praise, glorify, or honor</p><p><strong>বাংলা ব্যাখ্যা:</strong> প্রশংসা করা; মহিমান্বিত করা বা সম্মান জানানো।</p><p><strong>Examples:</strong></p><ul><li>He was lauded for his courage.</li><li>They lauded the former president as a hero.</li></ul></div><div class=\"word-entry\"><h3>23. lethargic</h3><p><strong>English Definition:</strong> deficient in alertness or activity</p><p><strong>বাংলা ব্যাখ্যা:</strong> নিস্তেজ; সজাগতা বা কার্যকলাপের অভাব।</p><p><strong>Examples:</strong></p><ul><li>The weather made her listless and lethargic.</li><li>He felt too miserable and lethargic to get dressed.</li></ul></div><div class=\"word-entry\"><h3>24. levee</h3><p><strong>English Definition:</strong> an embankment built to prevent a river from overflowing</p><p><strong>বাংলা ব্যাখ্যা:</strong> বাঁধ; নদী উপচে পড়া রোধ করার জন্য নির্মিত একটি বাঁধ।</p><p><strong>Examples:</strong></p><ul><li>Risks in levee engineering caused by many uncertainty factors are cared about by people.</li><li>Look at that long levee of logs.</li></ul></div><div class=\"word-entry\"><h3>25. levity</h3><p><strong>English Definition:</strong> a manner lacking seriousness</p><p><strong>বাংলা ব্যাখ্যা:</strong> লঘুতা; গুরুগম্ভীরতার অভাব।</p><p><strong>Examples:</strong></p><ul><li>Your levity is unseemly at this time.</li><li>His remarks injected a note of levity into the proceedings.</li></ul></div><div class=\"word-entry\"><h3>26. log</h3><p><strong>English Definition:</strong> a segment of the trunk of a tree when stripped of branches</p><p><strong>বাংলা ব্যাখ্যা:</strong> কাঠের গুঁড়ি; ডালপালা ছাড়ানো গাছের কাণ্ডের একটি অংশ।</p><p><strong>Examples:</strong></p><ul><li>He balanced himself on a log.</li><li>Tom put another log on the fire.</li></ul></div><div class=\"word-entry\"><h3>27. loquacious</h3><p><strong>English Definition:</strong> full of trivial conversation</p><p><strong>বাংলা ব্যাখ্যা:</strong> বাচাল; তুচ্ছ কথায় পূর্ণ।</p><p><strong>Examples:</strong></p><ul><li>His loquacious humour infected every one.</li><li>Fishes in a public aquarium grow loquacious, oblivious of their lack of privacy.</li></ul></div><div class=\"word-entry\"><h3>28. lucid</h3><p><strong>English Definition:</strong> transparently clear; easily understandable</p><p><strong>বাংলা ব্যাখ্যা:</strong> সুস্পষ্ট; স্বচ্ছভাবে পরিষ্কার; সহজে বোধগম্য।</p><p><strong>Examples:</strong></p><ul><li>She gave a clear and lucid account of her plans for the company's future.</li><li>You must write in a clear and lucid style.</li></ul></div><div class=\"word-entry\"><h3>29. malleable</h3><p><strong>English Definition:</strong> capable of being shaped or bent</p><p><strong>বাংলা ব্যাখ্যা:</strong> নমনীয়; আকার দেওয়া বা বাঁকানো যায় এমন।</p><p><strong>Examples:</strong></p><ul><li>Knowledge gives you power by making you less malleable to negative influences.</li><li>Unfortunately, most teenagers are malleable and give in to peer pressure rather easily.</li></ul></div><div class=\"word-entry\"><h3>30. maverick</h3><p><strong>English Definition:</strong> someone who exhibits independence in thought and action</p><p><strong>বাংলা ব্যাখ্যা:</strong> স্বতন্ত্রচেতা; চিন্তা ও কর্মে স্বাধীনতা প্রদর্শনকারী কেউ।</p><p><strong>Examples:</strong></p><ul><li>My maverick boss has made his fortune by using a selling strategy different from that of his competitors.</li><li>He was too much of a maverick ever to hold high office.</li></ul></div><div class=\"word-entry\"><h3>31. mendacious</h3><p><strong>English Definition:</strong> given to lying</p><p><strong>বাংলা ব্যাখ্যা:</strong> মিথ্যাবাদী; মিথ্যা বলার প্রবণতা।</p><p><strong>Examples:</strong></p><ul><li>She gave us a mendacious report.</li><li>Some of these statements are misleading and some downright mendacious.</li></ul></div><div class=\"word-entry\"><h3>32. metamorphosis</h3><p><strong>English Definition:</strong> striking change in appearance or character or circumstances</p><p><strong>বাংলা ব্যাখ্যা:</strong> রূপান্তর; চেহারা, চরিত্র বা পরিস্থিতির নাটকীয় পরিবর্তন।</p><p><strong>Examples:</strong></p><ul><li>She had undergone an amazing metamorphosis from awkward schoolgirl to beautiful woman.</li><li>The metamorphosis was something to behold.</li></ul></div><div class=\"word-entry\"><h3>33. meticulous</h3><p><strong>English Definition:</strong> marked by precise accordance with details</p><p><strong>বাংলা ব্যাখ্যা:</strong> খুঁতখুঁতে; পুঙ্খানুপুঙ্খ বিবরণের সাথে সুনির্দিষ্টভাবে চিহ্নিত।</p><p><strong>Examples:</strong></p><ul><li>This accounting job requires a meticulous person.</li><li>The trip involved meticulous planning.</li></ul></div><div class=\"word-entry\"><h3>34. misanthrope</h3><p><strong>English Definition:</strong> someone who dislikes people in general</p><p><strong>বাংলা ব্যাখ্যা:</strong> মানববিদ্বেষী; যিনি সাধারণভাবে মানুষকে অপছন্দ করেন।</p><p><strong>Examples:</strong></p><ul><li>After I was kidnapped and held hostage for a week, I became a misanthrope and distrusted everyone.</li><li>Living in a crime-filled city will turn anyone into a nervous misanthrope.</li></ul></div><div class=\"word-entry\"><h3>35. mitigate</h3><p><strong>English Definition:</strong> lessen or to try to lessen the seriousness or extent of</p><p><strong>বাংলা ব্যাখ্যা:</strong> প্রশমিত করা; গুরত্ব বা পরিমাণ কমানো বা কমানোর চেষ্টা করা।</p><p><strong>Examples:</strong></p><ul><li>It is unclear how to mitigate the effects of tourism on the island.</li><li>Governments should endeavour to mitigate distress.</li></ul></div><div class=\"word-entry\"><h3>36. mundane</h3><p><strong>English Definition:</strong> found in the ordinary course of events</p><p><strong>বাংলা ব্যাখ্যা:</strong> জাগতিক; সাধারণ ঘটনাবলীর মধ্যে পাওয়া যায়।</p><p><strong>Examples:</strong></p><ul><li>It was hard to return to mundane matters after such excitement.</li><li>Initially, the work was pretty mundane.</li></ul></div><div class=\"word-entry\"><h3>37. negate</h3><p><strong>English Definition:</strong> make ineffective by counterbalancing the effect of</p><p><strong>বাংলা ব্যাখ্যা:</strong> নাকচ করা; প্রতিভার দ্বারা এর প্রভাবকে অকার্যকর করে তোলা।</p><p><strong>Examples:</strong></p><ul><li>They overlook the human ability to negate, which lies at the root of thinking.</li><li>These facts negate your theory.</li></ul></div><div class=\"word-entry\"><h3>38. neophyte</h3><p><strong>English Definition:</strong> any new participant in some activity</p><p><strong>বাংলা ব্যাখ্যা:</strong> নবীন; কোনো কার্যকলাপে নতুন অংশগ্রহণকারী।</p><p><strong>Examples:</strong></p><ul><li>Even the best golfer in the world was once a neophyte at the sport of golf.</li><li>The neophyte began to stammer out a reply, but fell silent.</li></ul></div><div class=\"word-entry\"><h3>39. officious</h3><p><strong>English Definition:</strong> intrusive in a meddling or offensive manner</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনধিকারচর্চাকারী; অনধিকার চর্চা বা আপত্তিকর ভাবে অনুপ্রবেশকারী।</p><p><strong>Examples:</strong></p><ul><li>We were tired of being pushed around by officious civil servants.</li><li>He's an officious little man and widely disliked in the company.</li></ul></div><div class=\"word-entry\"><h3>40. paragon</h3><p><strong>English Definition:</strong> a perfect embodiment of a concept</p><p><strong>বাংলা ব্যাখ্যা:</strong> আদর্শ; কোনো ধারণার নিখুঁত মূর্ত প্রতীক।</p><p><strong>Examples:</strong></p><ul><li>As a paragon of purity, a nun would never dress inappropriately.</li><li>It would have taken a paragon of virtue not to feel jealous.</li></ul></div><div class=\"word-entry\"><h3>41. partisan</h3><p><strong>English Definition:</strong> prejudiced or in favour of a particular person, cause or thing</p><p><strong>বাংলা ব্যাখ্যা:</strong> পক্ষপাতি; কোনো নির্দিষ্ট ব্যক্তি, কারণ বা জিনিসের প্রতি পক্ষপাতদুষ্ট বা অনুকূলে।</p><p><strong>Examples:</strong></p><ul><li>The audience was very partisan, and refused to listen to the points she was making in her speech.</li><li>He is clearly too partisan to be a referee.</li></ul></div><div class=\"word-entry\"><h3>42. pathological</h3><p><strong>English Definition:</strong> relating to the study of diseases</p><p><strong>বাংলা ব্যাখ্যা:</strong> রোগবিদ্যা সংক্রান্ত; রোগবিদ্যার অধ্যয়নের সাথে সম্পর্কিত।</p><p><strong>Examples:</strong></p><ul><li>My sister is a pathological liar who never tells the truth about anything.</li><li>I have got a pathological fear of heights.</li></ul></div><div class=\"word-entry\"><h3>43. paucity</h3><p><strong>English Definition:</strong> an insufficient quantity or number</p><p><strong>বাংলা ব্যাখ্যা:</strong> স্বল্পতা; অপর্যাপ্ত পরিমাণ বা সংখ্যা।</p><p><strong>Examples:</strong></p><ul><li>There is a paucity of information on the ingredients of many cosmetics.</li><li>The paucity of fruit was caused by the drought.</li></ul></div><div class=\"word-entry\"><h3>44. pedantic</h3><p><strong>English Definition:</strong> marked by a narrow focus on or display of learning</p><p><strong>বাংলা ব্যাখ্যা:</strong> পাণ্ডিত্যপূর্ণ; জ্ঞান প্রদর্শন বা সীমিত বিষয়ে অতিরিক্ত মনোযোগ দেওয়া।</p><p><strong>Examples:</strong></p><ul><li>His lecture was so pedantic and uninteresting.</li><li>Some people can be very pedantic about punctuation.</li></ul></div><div class=\"word-entry\"><h3>45. penchant</h3><p><strong>English Definition:</strong> a strong liking</p><p><strong>বাংলা ব্যাখ্যা:</strong> ঝোঁক; তীব্র পছন্দ।</p><p><strong>Examples:</strong></p><ul><li>Her penchant for disappearing for days at a time worries her family.</li><li>He carried his penchant for secrecy to great lengths.</li></ul></div><div class=\"word-entry\"><h3>46. penury</h3><p><strong>English Definition:</strong> a state of extreme poverty or destitution</p><p><strong>বাংলা ব্যাখ্যা:</strong> দারিদ্র্য; চরম দারিদ্র্য বা অভাবের অবস্থা।</p><p><strong>Examples:</strong></p><ul><li>Hardship and penury wore him out before his time.</li><li>He was brought up in penury, without education.</li></ul></div><div class=\"word-entry\"><h3>47. perennial</h3><p><strong>English Definition:</strong> lasting an indefinitely long time</p><p><strong>বাংলা ব্যাখ্যা:</strong> দীর্ঘস্থায়ী; অনির্দিষ্ট কালের জন্য স্থায়ী।</p><p><strong>Examples:</strong></p><ul><li>I wonder at her perennial youthfulness.</li><li>We face the perennial problem of not having enough money.</li></ul></div><div class=\"word-entry\"><h3>48. perfidious</h3><p><strong>English Definition:</strong> tending to betray</p><p><strong>বাংলা ব্যাখ্যা:</strong> বিশ্বাসঘাতক; বিশ্বাসঘাতকতা করার প্রবণতা।</p><p><strong>Examples:</strong></p><ul><li>Your perfidious gossip is malicious and dangerous.</li><li>The company was betrayed by its perfidious allies.</li></ul></div><div class=\"word-entry\"><h3>49. perfunctory</h3><p><strong>English Definition:</strong> hasty and without attention to detail; not thorough</p><p><strong>বাংলা ব্যাখ্যা:</strong> দায়সারা; দ্রুত এবং বিবরণের প্রতি মনোযোগহীন; সম্পূর্ণ নয়।</p><p><strong>Examples:</strong></p><ul><li>They conducted a perfunctory examination.</li><li>He completed the act in a perfunctory manner.</li></ul></div><div class=\"word-entry\"><h3>50. permeable</h3><p><strong>English Definition:</strong> allowing fluids or gases to pass or diffuse through</p><p><strong>বাংলা ব্যাখ্যা:</strong> প্রবেশযোগ্য; তরল বা গ্যাসকে ভেদ করতে বা প্রবাহিত হতে দেয়।</p><p><strong>Examples:</strong></p><ul><li>The thin permeable skin allows moisture to flow into the animal rather than out of it.</li><li>The cell membrane is permeable enough to flow necessary fluids in and out of it.</li></ul></div><div class=\"word-entry\"><h3>51. pervasive</h3><p><strong>English Definition:</strong> spreading or spread throughout</p><p><strong>বাংলা ব্যাখ্যা:</strong> সর্বব্যাপী; সর্বত্র ছড়িয়ে পড়া বা ছড়িয়ে থাকা।</p><p><strong>Examples:</strong></p><ul><li>The media’s pervasive coverage of the epidemic has most of the country living in fear.</li><li>In many cities, police corruption is a pervasive issue that touches all communities.</li></ul></div><div class=\"word-entry\"><h3>52. phlegmatic</h3><p><strong>English Definition:</strong> showing little emotion</p><p><strong>বাংলা ব্যাখ্যা:</strong> আবেগহীন; অল্প আবেগ প্রদর্শনকারী।</p><p><strong>Examples:</strong></p><ul><li>The normally phlegmatic man could not help but yell when he won a gigantic lottery prize.</li><li>Even though the clown tried very hard, he could not get the phlegmatic girl to laugh.</li></ul></div><div class=\"word-entry\"><h3>53. piety</h3><p><strong>English Definition:</strong> righteousness by virtue of being religiously devout</p><p><strong>বাংলা ব্যাখ্যা:</strong> ধার্মিকতা; ধর্মপ্রাণ হওয়ার কারণে ধার্মিকতা।</p><p><strong>Examples:</strong></p><ul><li>They were drawn to the church not by piety but by curiosity.</li><li>In this capacity his sincere piety and amiable character gained him great influence.</li></ul></div><div class=\"word-entry\"><h3>54. placate</h3><p><strong>English Definition:</strong> cause to be more favorably inclined</p><p><strong>বাংলা ব্যাখ্যা:</strong> শান্ত করা; আরও অনুকূল করতে কারণ হওয়া।</p><p><strong>Examples:</strong></p><ul><li>He never attempts to placate his enemy.</li><li>He smiled, trying to placate me.</li></ul></div><div class=\"word-entry\"><h3>55. plasticity</h3><p><strong>English Definition:</strong> the property of being physically malleable</p><p><strong>বাংলা ব্যাখ্যা:</strong> নমনীয়তা; শারীরিকভাবে আকার পরিবর্তনযোগ্য হওয়ার বৈশিষ্ট্য।</p><p><strong>Examples:</strong></p><ul><li>Nothing better shows the plasticity of her character than the ease with which she adapted herself to this sudden change.</li><li>Bending the object into a new shape, the child was surprised by its plasticity.</li></ul></div><div class=\"word-entry\"><h3>56. plethora</h3><p><strong>English Definition:</strong> extreme excess</p><p><strong>বাংলা ব্যাখ্যা:</strong> আধিক্য; চরম আধিক্য।</p><p><strong>Examples:</strong></p><ul><li>The plethora of rules and regulations is both contradictory and confusing.</li><li>A plethora of new operators will be allowed to enter the market.</li></ul></div><div class=\"word-entry\"><h3>57. plummet</h3><p><strong>English Definition:</strong> drop sharply</p><p><strong>বাংলা ব্যাখ্যা:</strong> দ্রুত পতন; তীক্ষ্ণভাবে পতন হওয়া।</p><p><strong>Examples:</strong></p><ul><li>For some inexplicable reason her spirits seemed to plummet earthwards.</li><li>The rope snapped, causing the climber to plummet several hundred feet down the mountain.</li></ul></div><div class=\"word-entry\"><h3>58. pragmatic</h3><p><strong>English Definition:</strong> concerned with practical matters</p><p><strong>বাংলা ব্যাখ্যা:</strong> বাস্তববাদী; বাস্তব বিষয়গুলি নিয়ে চিন্তিত।</p><p><strong>Examples:</strong></p><ul><li>My mother is quite pragmatic in nature and never does anything without rationalizing it first.</li><li>We need to adopt a more pragmatic approach.</li></ul></div><div class=\"word-entry\"><h3>59. precarious</h3><p><strong>English Definition:</strong> not secure; beset with difficulties</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনিশ্চিত; নিরাপদ নয়; বিভিন্ন সমস্যায় জর্জরিত।</p><p><strong>Examples:</strong></p><ul><li>It could be a financially precarious solution.</li><li>He earned a precarious living as an artist.</li></ul></div><div class=\"word-entry\"><h3>60. precipitate</h3><p><strong>English Definition:</strong> bring about abruptly</p><p><strong>বাংলা ব্যাখ্যা:</strong> ত্বরান্বিত করা; আকস্মিকভাবে ঘটানো।</p><p><strong>Examples:</strong></p><ul><li>A slight mistake could precipitate a disaster.</li><li>The rising level of unemployment is going to precipitate a huge crowd at the welfare office.</li></ul></div><div class=\"word-entry\"><h3>61. precursor</h3><p><strong>English Definition:</strong> something indicating the approach of something or someone</p><p><strong>বাংলা ব্যাখ্যা:</strong> পূর্বসূরী; কিছু বা কারো আগমনের ইঙ্গিত দেয় এমন কিছু।</p><p><strong>Examples:</strong></p><ul><li>As I looked up in the sky, I saw a large dark cloud, a precursor of an upcoming storm.</li><li>All too often, high blood pressure is a precursor of heart disease.</li></ul></div><div class=\"word-entry\"><h3>62. presumptuous</h3><p><strong>English Definition:</strong> going beyond what is appropriate, permitted, or courteous</p><p><strong>বাংলা ব্যাখ্যা:</strong> আম্পর্দা; যা উপযুক্ত, অনুমোদিত বা বিনয়ী তার বাইরে যাওয়া।</p><p><strong>Examples:</strong></p><ul><li>It was presumptuous of him to take charge.</li><li>It would be presumptuous of me to comment on the matter.</li></ul></div><div class=\"word-entry\"><h3>63. pristine</h3><p><strong>English Definition:</strong> immaculately clean and unused</p><p><strong>বাংলা ব্যাখ্যা:</strong> আদিম; নিশ্ছিদ্রভাবে পরিষ্কার এবং অব্যবহৃত।</p><p><strong>Examples:</strong></p><ul><li>He wasn't about to blemish that pristine record.</li><li>The car has been restored to pristine condition.</li></ul></div><div class=\"word-entry\"><h3>64. problematic</h3><p><strong>English Definition:</strong> making great mental demands</p><p><strong>বাংলা ব্যাখ্যা:</strong> সমস্যাসংকুল; মানসিক প্রচুর চাহিদার সৃষ্টি করে।</p><p><strong>Examples:</strong></p><ul><li>Getting everyone there on time might prove problematic.</li><li>The future of our business is problematic.</li></ul></div><div class=\"word-entry\"><h3>65. prodigal</h3><p><strong>English Definition:</strong> recklessly wasteful</p><p><strong>বাংলা ব্যাখ্যা:</strong> অপব্যয়ী; বেপরোয়া অপচয়কারী।</p><p><strong>Examples:</strong></p><ul><li>If you want to save money for college, you should stop your prodigal spending sprees.</li><li>Even when the dictator saw his people dying of hunger, he refused to change his prodigal way of life.</li></ul></div><div class=\"word-entry\"><h3>66. propriety</h3><p><strong>English Definition:</strong> correct behavior</p><p><strong>বাংলা ব্যাখ্যা:</strong> শালীনতা; সঠিক আচরণ।</p><p><strong>Examples:</strong></p><ul><li>The sensitive matter was handled with great propriety.</li><li>She was careful always to behave with propriety.</li></ul></div><div class=\"word-entry\"><h3>67. proscribe</h3><p><strong>English Definition:</strong> command against</p><p><strong>বাংলা ব্যাখ্যা:</strong> নিষিদ্ধ করা; বিরুদ্ধে আদেশ দেওয়া।</p><p><strong>Examples:</strong></p><ul><li>In some cultures surgery is proscribed.</li><li>Most states have laws that proscribe texting while driving.</li></ul></div><div class=\"word-entry\"><h3>68. pungent</h3><p><strong>English Definition:</strong> strong and sharp to the sense of taste</p><p><strong>বাংলা ব্যাখ্যা:</strong> ঝাঁঝালো; স্বাদ বা গন্ধের জন্য তীব্র এবং তীক্ষ্ণ।</p><p><strong>Examples:</strong></p><ul><li>The taste is bitter and disagreeably pungent.</li><li>Her thoughts were interrupted by a pungent odor.</li></ul></div><div class=\"word-entry\"><h3>69. qualified</h3><p><strong>English Definition:</strong> meeting the proper standards and requirements for a task</p><p><strong>বাংলা ব্যাখ্যা:</strong> যোগ্য; কোনো কাজের জন্য সঠিক মান এবং প্রয়োজনীয়তা পূরণ করা।</p><p><strong>Examples:</strong></p><ul><li>He qualified as a doctor last year.</li><li>She is well qualified but has no relevant work experience.</li></ul></div><div class=\"word-entry\"><h3>70. quiescent</h3><p><strong>English Definition:</strong> being quiet or still or inactive</p><p><strong>বাংলা ব্যাখ্যা:</strong> সুপ্ত; শান্ত, স্থির বা নিষ্ক্রিয় থাকা।</p><p><strong>Examples:</strong></p><ul><li>Ever since the police department hired ten new officers, crime has been rather quiescent in our town.</li><li>During the quiescent phase of the lab, we simply observe and note the growth of the cells.</li></ul></div><div class=\"word-entry\"><h3>71. rarefied</h3><p><strong>English Definition:</strong> of high moral or intellectual value</p><p><strong>বাংলা ব্যাখ্যা:</strong> দুর্লভ; উচ্চ নৈতিক বা বৌদ্ধিক মূল্যের।</p><p><strong>Examples:</strong></p><ul><li>Only a couple of audience members were not confused by the scientist’s rarefied concept.</li><li>Getting a book published isn't the rarefied literary feat it once was.</li></ul></div><div class=\"word-entry\"><h3>72. refute</h3><p><strong>English Definition:</strong> overthrow by argument, evidence, or proof</p><p><strong>বাংলা ব্যাখ্যা:</strong> খণ্ডন করা; যুক্তি, প্রমাণ বা সাক্ষ্য দ্বারা খণ্ডন করা।</p><p><strong>Examples:</strong></p><ul><li>We can easily refute his argument.</li><li>These data do not refute the law of demand.</li></ul></div><div class=\"word-entry\"><h3>73. relegate</h3><p><strong>English Definition:</strong> assign to a lower position</p><p><strong>বাংলা ব্যাখ্যা:</strong> অবনমিত করা; নিম্ন পদে নিয়োগ করা।</p><p><strong>Examples:</strong></p><ul><li>Women tended to be relegated to typing and filing jobs.</li><li>He has been relegated to the position of an assistant coach.</li></ul></div><div class=\"word-entry\"><h3>74. reproach</h3><p><strong>English Definition:</strong> express criticism towards</p><p><strong>বাংলা ব্যাখ্যা:</strong> তিরস্কার করা; সমালোচনা প্রকাশ করা।</p><p><strong>Examples:</strong></p><ul><li>She is quick to reproach anyone who doesn't live up to her own high standards.</li><li>There was mild reproach in his tone.</li></ul></div><div class=\"word-entry\"><h3>75. resolution</h3><p><strong>English Definition:</strong> a decision to do something or to behave in a certain manner</p><p><strong>বাংলা ব্যাখ্যা:</strong> সংকল্প; কিছু করার বা নির্দিষ্ট আচরণ করার সিদ্ধান্ত।</p><p><strong>Examples:</strong></p><ul><li>The memory gave her resolution.</li><li>The resolution in his face was unmistakable.</li></ul></div><div class=\"word-entry\"><h3>76. reticent</h3><p><strong>English Definition:</strong> reluctant to draw attention to yourself</p><p><strong>বাংলা ব্যাখ্যা:</strong> স্বল্পভাষী; নিজেকে জাহির করতে অনিচ্ছুক।</p><p><strong>Examples:</strong></p><ul><li>She is so reticent about her achievements.</li><li>Most of the students were reticent about answering questions.</li></ul></div><div class=\"word-entry\"><h3>77. reverent</h3><p><strong>English Definition:</strong> feeling or showing profound respect or veneration</p><p><strong>বাংলা ব্যাখ্যা:</strong> শ্রদ্ধাশীল; গভীর শ্রদ্ধা বা ভক্তি দেখানো।</p><p><strong>Examples:</strong></p><ul><li>A reverent silence fell over the crowd.</li><li>He was brave, reverent, and clean, though perhaps lacking in the trustworthiness department.</li></ul></div><div class=\"word-entry\"><h3>78. sage</h3><p><strong>English Definition:</strong> a mentor in spiritual and philosophical topics</p><p><strong>বাংলা ব্যাখ্যা:</strong> জ্ঞানী ব্যক্তি; আধ্যাত্মিক ও দার্শনিক বিষয়ে একজন পরামর্শদাতা।</p><p><strong>Examples:</strong></p><ul><li>When I have questions about my courses, I often seek advice from my sage, my college mentor.</li><li>My father was the sage who kept everyone in my family on a straight path by giving us guidance before it was even requested.</li></ul></div><div class=\"word-entry\"><h3>79. sanction</h3><p><strong>English Definition:</strong> official permission or approval</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনুমোদন; সরকারি অনুমতি বা অনুমোদন।</p><p><strong>Examples:</strong></p><ul><li>The conference gave its official sanction to the change of policy.</li><li>We received sanction to proceed with our plans.</li></ul></div><div class=\"word-entry\"><h3>80. saturate</h3><p><strong>English Definition:</strong> infuse or fill completely</p><p><strong>বাংলা ব্যাখ্যা:</strong> পূর্ণ করা; সম্পূর্ণভাবে প্রবেশ করানো বা পূরণ করা।</p><p><strong>Examples:</strong></p><ul><li>Water poured through the hole, saturating the carpet.</li><li>Our culture is saturated with television and advertising.</li></ul></div><div class=\"word-entry\"><h3>81. secrete</h3><p><strong>English Definition:</strong> generate and separate from cells or bodily fluids</p><p><strong>বাংলা ব্যাখ্যা:</strong> নিঃসরণ করা; কোষ বা শারীরিক তরল থেকে তৈরি এবং আলাদা করা।</p><p><strong>Examples:</strong></p><ul><li>The pores of your body secrete sweat.</li><li>To keep skin moisturized, sebaceous glands secrete oil.</li></ul></div><div class=\"word-entry\"><h3>82. skeptic</h3><p><strong>English Definition:</strong> someone who habitually doubts accepted beliefs</p><p><strong>বাংলা ব্যাখ্যা:</strong> সংশয়বাদী; যিনি প্রচলিত বিশ্বাসকে অভ্যাসগতভাবে সন্দেহ করেন।</p><p><strong>Examples:</strong></p><ul><li>She is a skeptic about the dangers of global warming.</li><li>I need to see more hard evidence to become less of a skeptic.</li></ul></div><div class=\"word-entry\"><h3>83. solicitous</h3><p><strong>English Definition:</strong> full of anxiety and concern</p><p><strong>বাংলা ব্যাখ্যা:</strong> উদ্বিগ্ন; উদ্বেগ এবং উদ্বেগে পূর্ণ।</p><p><strong>Examples:</strong></p><ul><li>He was very solicitous for her safe return.</li><li>She was very solicitous for our welfare.</li></ul></div><div class=\"word-entry\"><h3>84. spectrum</h3><p><strong>English Definition:</strong> a broad range of related objects, values, or qualities</p><p><strong>বাংলা ব্যাখ্যা:</strong> বর্ণালী; সম্পর্কিত বস্তু, মান বা গুণাবলীর একটি বিস্তৃত পরিসর।</p><p><strong>Examples:</strong></p><ul><li>This is a kind of atomic spectrum.</li><li>Beyond the red end of the visible light spectrum is infrared.</li></ul></div><div class=\"word-entry\"><h3>85. sporadic</h3><p><strong>English Definition:</strong> recurring in scattered or unpredictable instances</p><p><strong>বাংলা ব্যাখ্যা:</strong> বিক্ষিপ্ত; বিচ্ছিন্ন বা অপ্রত্যাশিত ঘটনায় পুনরাবৃত্তি।</p><p><strong>Examples:</strong></p><ul><li>Her attendance at school was sporadic.</li><li>There has been sporadic violence downtown.</li></ul></div><div class=\"word-entry\"><h3>86. stigma</h3><p><strong>English Definition:</strong> a symbol of disgrace or infamy</p><p><strong>বাংলা ব্যাখ্যা:</strong> কলঙ্ক; অপমান বা কুখ্যাতির প্রতীক।</p><p><strong>Examples:</strong></p><ul><li>There is a social stigma attached to single parenthood.</li><li>There is no stigma to being made redundant.</li></ul></div><div class=\"word-entry\"><h3>87. substantiate</h3><p><strong>English Definition:</strong> establish or strengthen as with new evidence or facts</p><p><strong>বাংলা ব্যাখ্যা:</strong> প্রমাণ করা; নতুন প্রমাণ বা তথ্যের সাথে প্রতিষ্ঠিত বা শক্তিশালী করা।</p><p><strong>Examples:</strong></p><ul><li>We have evidence to substantiate the allegations against him.</li><li>There is little scientific evidence to substantiate the claims.</li></ul></div><div class=\"word-entry\"><h3>88. supersede</h3><p><strong>English Definition:</strong> take the place or move into the position of</p><p><strong>বাংলা ব্যাখ্যা:</strong> প্রতিস্থাপন করা; স্থান নেওয়া বা পদের মধ্যে চলে আসা।</p><p><strong>Examples:</strong></p><ul><li>In time, the features of the smartphone may supersede those of the personal computer.</li><li>The federal court decision will supersede the decision of the lower court.</li></ul></div><div class=\"word-entry\"><h3>89. supposition</h3><p><strong>English Definition:</strong> the cognitive process of conjecturing</p><p><strong>বাংলা ব্যাখ্যা:</strong> অনুমান; অনুমান করার জ্ঞানীয় প্রক্রিয়া।</p><p><strong>Examples:</strong></p><ul><li>His version of the events is pure supposition.</li><li>The police are working on the supposition that he was murdered.</li></ul></div><div class=\"word-entry\"><h3>90. tacit</h3><p><strong>English Definition:</strong> implied by or inferred from actions or statements</p><p><strong>বাংলা ব্যাখ্যা:</strong> উহ্য; কাজ বা বিবৃতি দ্বারা বোঝানো বা অনুমান করা।</p><p><strong>Examples:</strong></p><ul><li>Although no words were spoken, our nods represented our tacit agreement to a cease fire.</li><li>In my business, all that is needed for a tacit understanding is a handshake between men.</li></ul></div><div class=\"word-entry\"><h3>91. tangential</h3><p><strong>English Definition:</strong> of superficial relevance if any</p><p><strong>বাংলা ব্যাখ্যা:</strong> অপ্রাসঙ্গিক; যদি কোন প্রাসঙ্গিকতা থাকে তবে তা খুবই সামান্য।</p><p><strong>Examples:</strong></p><ul><li>Too much time was spent discussing tangential issues.</li><li>The matter you raise is rather tangential to this discussion.</li></ul></div><div class=\"word-entry\"><h3>92. tractable</h3><p><strong>English Definition:</strong> easily managed</p><p><strong>বাংলা ব্যাখ্যা:</strong> নিয়ন্ত্রণযোগ্য; সহজে পরিচালনা করা যায়।</p><p><strong>Examples:</strong></p><ul><li>Gold and silver are tractable metals.</li><li>This approach helps to make the issues more tractable.</li></ul></div><div class=\"word-entry\"><h3>93. transgression</h3><p><strong>English Definition:</strong> the violation of a law or a duty or moral principle</p><p><strong>বাংলা ব্যাখ্যা:</strong> লঙ্ঘন; আইন, কর্তব্য বা নৈতিক নীতির লঙ্ঘন।</p><p><strong>Examples:</strong></p><ul><li>The judge will decide the penalty for my transgression.</li><li>When the banker stole funds from the vault, he made a huge transgression.</li></ul></div><div class=\"word-entry\"><h3>94. veracious</h3><p><strong>English Definition:</strong> habitually speaking the truth</p><p><strong>বাংলা ব্যাখ্যা:</strong> সত্যবাদী; অভ্যাসগতভাবে সত্য কথা বলা।</p><p><strong>Examples:</strong></p><ul><li>He will be veracious only so long as the consequences are not seriously injurious.</li><li>After listening to all evidence, the jury found the veracious woman to be truthful and dismissed all charges.</li></ul></div><div class=\"word-entry\"><h3>95. verbose</h3><p><strong>English Definition:</strong> using or containing too many words</p><p><strong>বাংলা ব্যাখ্যা:</strong> শব্দবহুল; অতিরিক্ত বা অনেক বেশি শব্দ ব্যবহার করা।</p><p><strong>Examples:</strong></p><ul><li>His writing is difficult and often verbose.</li><li>Legal writing is often unclear and verbose.</li></ul></div><div class=\"word-entry\"><h3>96. viable</h3><p><strong>English Definition:</strong> capable of life or normal growth and development</p><p><strong>বাংলা ব্যাখ্যা:</strong> কার্যকর; জীবন বা স্বাভাবিক বৃদ্ধি ও বিকাশের যোগ্য।</p><p><strong>Examples:</strong></p><ul><li>The committee came forward with one viable solution.</li><li>The government wants to encourage viable self-contained rural communities.</li></ul></div><div class=\"word-entry\"><h3>97. volatile</h3><p><strong>English Definition:</strong> liable to lead to sudden change or violence</p><p><strong>বাংলা ব্যাখ্যা:</strong> উদ্বায়ী; আকস্মিক পরিবর্তন বা সহিংসতার দিকে পরিচালিত করার সম্ভাবনা।</p><p><strong>Examples:</strong></p><ul><li>Food and fuel prices are very volatile in a war situation.</li><li>Edwards was a dangerously volatile character.</li></ul></div><div class=\"word-entry\"><h3>98. warrant</h3><p><strong>English Definition:</strong> formal and explicit approval</p><p><strong>বাংলা ব্যাখ্যা:</strong> পরোয়ানা; আনুষ্ঠানিক এবং সুস্পষ্ট অনুমোদন।</p><p><strong>Examples:</strong></p><ul><li>They issued a warrant for her arrest.</li><li>A warrant is out for his arrest/against him.</li></ul></div><div class=\"word-entry\"><h3>99. wary</h3><p><strong>English Definition:</strong> marked by keen caution and watchful prudence</p><p><strong>বাংলা ব্যাখ্যা:</strong> সতর্ক; তীক্ষ্ণ সতর্কতা এবং সতর্ক বিচক্ষণতা দ্বারা চিহ্নিত।</p><p><strong>Examples:</strong></p><ul><li>The strange look in his eyes made me wary of accepting his offer.</li><li>The police will need to keep a wary eye on this area of town.</li></ul></div><div class=\"word-entry\"><h3>100. whimsical</h3><p><strong>English Definition:</strong> determined by chance or impulse rather than by necessity</p><p><strong>বাংলা ব্যাখ্যা:</strong> খামখেয়ালী; প্রয়োজনের পরিবর্তে সুযোগ বা আবেগ দ্বারা নির্ধারিত।</p><p><strong>Examples:</strong></p><ul><li>The whimsical music made me feel like a little kid again.</li><li>Much of his writing has a whimsical quality.</li></ul></div></div>"
    }
  ],
  "quizzes": {
    "readingPassage1Quiz": [
      {
        "question": "What is a synonym for 'laymen'?",
        "options": [
          "experts",
          "commoners",
          "professionals",
          "specialists"
        ],
        "correctAnswer": 1,
        "explanation": "'Laymen' refers to people without professional or specialized knowledge in a particular subject."
      },
      {
        "question": "What is an antonym for 'endure'?",
        "options": [
          "bear",
          "suffer",
          "toler",
          "succumb"
        ],
        "correctAnswer": 3,
        "explanation": "To endure means to withstand hardship. To succumb means to fail to resist pressure or a negative force."
      },
      {
        "question": "How do desert plants like specialist annuals survive?",
        "options": [
          "They store water in their leaves.",
          "They have very long roots.",
          "They have extremely short life cycles triggered by rain.",
          "They are resistant to heat."
        ],
        "correctAnswer": 2,
        "explanation": "The passage states they 'overcome seasonal temperature changes with their extremely short, active life cycles' and grow very quickly after rain."
      }
    ],
    "readingPassage2Quiz": [
      {
        "question": "What does the word 'crusade' mean in the context of the passage?",
        "options": [
          "A holy war",
          "A vigorous campaign",
          "A long journey",
          "A period of struggle"
        ],
        "correctAnswer": 1,
        "explanation": "The National Literacy Crusade (NLC) was a vigorous campaign for social change, specifically to increase literacy."
      },
      {
        "question": "What was the direct effect of the NLC on infant mortality?",
        "options": [
          "It had no effect.",
          "It slightly increased the rate.",
          "It significantly decreased the rate for newly literate mothers.",
          "It only affected mothers already educated in primary school."
        ],
        "correctAnswer": 2,
        "explanation": "The passage states that for women who learned to read through the campaign, the infant mortality rate dropped by an impressive 21 points."
      }
    ],
    "readingPassage3Quiz": [
      {
        "question": "What does the word 'conjunction' mean in the first paragraph?",
        "options": [
          "Separation",
          "Combination",
          "Opposition",
          "Regularity"
        ],
        "correctAnswer": 1,
        "explanation": "'In conjunction with' means 'together with' or 'in combination with'."
      },
      {
        "question": "According to the passage, what primarily 'determines' which living things can thrive in an ecosystem?",
        "options": [
          "The number of predators",
          "The variety of plants",
          "The conditions created by non-living things",
          "The age of the ecosystem"
        ],
        "correctAnswer": 2,
        "explanation": "The text says, 'These conditions [created by non-living things] determine what kinds of living things will be able to thrive there.'"
      }
    ],
    "readingPassage4Quiz": [
      {
        "question": "What is the meaning of the word 'eschew' used in the passage?",
        "options": [
          "To take great interest in",
          "To notice something important",
          "To deliberately avoid using",
          "To take care of"
        ],
        "correctAnswer": 2,
        "explanation": "'Eschew' means to deliberately avoid or abstain from something."
      },
      {
        "question": "What does the passage identify as a major symptom of Facebook Addiction Disorder (F.A.D)?",
        "options": [
          "Posting many photos",
          "Joining many groups",
          "Withdrawing from normal activities to check Facebook constantly",
          "Sending friend requests to strangers"
        ],
        "correctAnswer": 2,
        "explanation": "The passage states that a person with F.A.D 'withdraws himself from normal activities like hanging out with friends... and eschews the rest of the world.'"
      }
    ],
    "readingPassage5Quiz": [
      {
        "question": "According to Vygotsky's theory, where does learning first take place?",
        "options": [
          "At an individual level",
          "At the social level through interactions",
          "Through rote learning",
          "Only with a teacher's support"
        ],
        "correctAnswer": 1,
        "explanation": "The passage states, 'According to this concept, learning takes place first at the social level through interactions with others.'"
      },
      {
        "question": "What is a key benefit of peer support in a classroom?",
        "options": [
          "It encourages rote learning",
          "It helps students rely less on teachers",
          "It develops deeper understanding and avoids rote learning",
          "It is only useful for setting academic goals"
        ],
        "correctAnswer": 2,
        "explanation": "The text mentions several benefits, including that students 'develop the ability for deeper understanding and, most importantly, they don't rely on rote learning.'"
      }
    ],
    "readingPassage6Quiz": [
      {
        "question": "What is the primary reason mentioned for people disliking fast food?",
        "options": [
          "It is too expensive.",
          "The atmosphere is too formal.",
          "It has low nutritional value.",
          "It is not available worldwide."
        ],
        "correctAnswer": 2,
        "explanation": "The text states, 'The main reason is its low nutritional value.'"
      },
      {
        "question": "How are fast-food restaurants changing to become more healthful?",
        "options": [
          "By lowering their prices.",
          "By opening in more locations.",
          "By adding salad bars and healthier options like grilled chicken.",
          "By using more chemical substances."
        ],
        "correctAnswer": 2,
        "explanation": "The passage says, 'many fast-food restaurants now have salad bars and put vegetable items on their menus... customers can get... grilled chicken instead of fried.'"
      }
    ],
    "readingPassage7Quiz": [
      {
        "question": "What does the word 'magnify' mean in the context of Galileo's telescope?",
        "options": [
          "Lessen",
          "Reduce",
          "Expand",
          "Conceal"
        ],
        "correctAnswer": 2,
        "explanation": "'Magnify' means to make something appear larger than it is, which is what a telescope does."
      },
      {
        "question": "What was Galileo's first major space observation with his telescope?",
        "options": [
          "That the Earth revolves around the Sun.",
          "That the moon was perfectly smooth.",
          "That there were other planets.",
          "That the moon was covered in bumps and craters."
        ],
        "correctAnswer": 3,
        "explanation": "The passage states, 'he made his first of many space observations: the moon was not smooth... The moon was covered in bumps and craters.'"
      }
    ],
    "readingPassage8Quiz": [
      {
        "question": "What does 'Commercialized' mean in the context of Mother's Day?",
        "options": [
          "Fame-oriented",
          "Customized",
          "Personalized",
          "Money-oriented"
        ],
        "correctAnswer": 3,
        "explanation": "The passage describes companies launching products and restaurants advertising heavily, indicating the holiday has become focused on commerce and spending money."
      },
      {
        "question": "Who started the 'Mothers’ Friendship Day' after the U.S. Civil War?",
        "options": [
          "Julia Ward Howe",
          "President Woodrow Wilson",
          "The ancient Greeks",
          "Ann Reeves Jarvis"
        ],
        "correctAnswer": 3,
        "explanation": "The text says, 'In 1868, Ann Reeves Jarvis started a committee to help families get back together after the war. This committee tried to establish a “Mothers’ Friendship Day”... '"
      }
    ],
    "paragraphWritingQuiz": [
      {
        "question": "Which element ensures that a paragraph discusses only one main idea?",
        "options": [
          "Coherence",
          "Unity",
          "Order",
          "Completeness"
        ],
        "correctAnswer": 1,
        "explanation": "Unity is the principle that a paragraph should be centered on a single, controlling idea, expressed in the topic sentence."
      },
      {
        "question": "Words like 'however', 'therefore', and 'in addition' are used to achieve which quality in a paragraph?",
        "options": [
          "Unity",
          "Order",
          "Coherence",
          "Completeness"
        ],
        "correctAnswer": 2,
        "explanation": "These are transition words, which create bridges between sentences and ideas to ensure the paragraph is coherent and easy to follow."
      },
      {
        "question": "The arrangement of sentences in a logical sequence (e.g., chronological or by importance) refers to which element?",
        "options": [
          "Coherence",
          "Completeness",
          "Unity",
          "Order"
        ],
        "correctAnswer": 3,
        "explanation": "Order is the way supporting sentences are organized to build upon the topic sentence in a logical manner."
      }
    ],
    "descriptiveParagraphQuiz": [
      {
        "question": "When describing a place, what is the recommended technique to make the description vivid?",
        "options": [
          "Only list the objects present.",
          "Focus on your personal opinions.",
          "Appeal to the five senses: touch, smell, sound, taste, and sight.",
          "Use as many adjectives as possible."
        ],
        "correctAnswer": 2,
        "explanation": "Using sensory details helps the reader to experience the place, making the description more immersive and effective."
      },
      {
        "question": "'The old house groaned under the weight of the wind' is an example of what kind of figurative language?",
        "options": [
          "Simile",
          "Metaphor",
          "Personification",
          "Hyperbole"
        ],
        "correctAnswer": 2,
        "explanation": "Personification gives human qualities (groaning) to an inanimate object (the house)."
      },
      {
        "question": "What is the primary purpose of a descriptive paragraph?",
        "options": [
          "To tell a story.",
          "To persuade the reader.",
          "To paint a picture in the reader's mind.",
          "To explain a process."
        ],
        "correctAnswer": 2,
        "explanation": "Descriptive writing aims to create a vivid and detailed picture of a person, place, or object for the reader."
      }
    ],
    "narrativeParagraphQuiz": [
      {
        "question": "What is the primary purpose of a narrative paragraph?",
        "options": [
          "To describe a scene in detail.",
          "To tell a story.",
          "To argue a point.",
          "To compare two things."
        ],
        "correctAnswer": 1,
        "explanation": "A narrative paragraph tells a story, usually in chronological order, about an event or series of events."
      },
      {
        "question": "In the sentence, 'While I was studying, the phone rang,' which tense is used for the action that was interrupted?",
        "options": [
          "Simple Past",
          "Past Perfect",
          "Past Continuous",
          "Present Continuous"
        ],
        "correctAnswer": 2,
        "explanation": "The Past Continuous ('was studying') is used to describe an ongoing action in the past that was interrupted by another action in the Simple Past ('rang')."
      },
      {
        "question": "Which of the following is NOT a key component of a narrative?",
        "options": [
          "A setting (where/when)",
          "Characters (who)",
          "A sequence of events",
          "A formal thesis statement"
        ],
        "correctAnswer": 3,
        "explanation": "While a narrative has a point or theme, it doesn't typically start with a formal thesis statement like an argumentative essay. It focuses on telling a story."
      }
    ],
    "causeEffectParagraphQuiz": [
      {
        "question": "If a paragraph explains why a student failed an exam, what is its primary focus?",
        "options": [
          "Focus on effects",
          "Focus on causes",
          "Focus on comparison",
          "Focus on narration"
        ],
        "correctAnswer": 1,
        "explanation": "Explaining 'why' something happened means the paragraph is focused on the causes that led to that result."
      },
      {
        "question": "Which of the following is a transition word used to signal an effect?",
        "options": [
          "Because",
          "First",
          "Consequently",
          "For instance"
        ],
        "correctAnswer": 2,
        "explanation": "'Consequently' directly indicates that a result or effect is about to be stated. 'Because' signals a cause."
      },
      {
        "question": "What is the main goal of a cause-and-effect paragraph?",
        "options": [
          "To paint a picture with words.",
          "To tell a personal story.",
          "To explain the relationship between an event and its results.",
          "To instruct the reader on how to do something."
        ],
        "correctAnswer": 2,
        "explanation": "The purpose is to show the reader how one thing can lead to another, exploring the reasons for and/or the results of an action or event."
      }
    ],
    "tenseQuiz": [
      {
        "question": "Which sentence correctly uses the Present Continuous tense?",
        "options": [
          "She is often playing tennis.",
          "She plays tennis right now.",
          "She is playing tennis right now.",
          "She does play tennis now."
        ],
        "correctAnswer": 2,
        "explanation": "Present Continuous is for actions happening at the moment of speaking."
      },
      {
        "question": "Choose the correct sentence in the Simple Past.",
        "options": [
          "He was go to the store yesterday.",
          "He did went to the store yesterday.",
          "He went to the store yesterday.",
          "He has went to the store yesterday."
        ],
        "correctAnswer": 2,
        "explanation": "Simple Past for a completed action at a specific time in the past uses the past form of the verb, which is 'went'."
      },
      {
        "question": "Complete the sentence: By the time we arrived, the movie ______.",
        "options": [
          "started",
          "had started",
          "was starting",
          "starts"
        ],
        "correctAnswer": 1,
        "explanation": "Past Perfect ('had started') is used for an action that was completed before another past action ('arrived')."
      },
      {
        "question": "Which tense is used to talk about a planned future event?",
        "options": [
          "will + verb",
          "am/is/are + verb-ing",
          "am/is/are + going to + verb",
          "Simple Present"
        ],
        "correctAnswer": 2,
        "explanation": "'Going to' is used for intentions and plans made before the moment of speaking."
      },
      {
        "question": "Complete the sentence: This time next week, I ______ on a beach.",
        "options": [
          "will lie",
          "am lying",
          "will be lying",
          "lie"
        ],
        "correctAnswer": 2,
        "explanation": "Future Continuous ('will be lying') is used for an action that will be in progress at a specific time in the future."
      },
      {
        "question": "Which sentence uses the Present Perfect tense correctly?",
        "options": [
          "I have saw that movie last year.",
          "I saw that movie already.",
          "I have seen that movie.",
          "I did see that movie."
        ],
        "correctAnswer": 2,
        "explanation": "Present Perfect ('have seen') is used for actions that happened at an unspecified time in the past or have relevance to the present. You don't use it with specific past time markers like 'last year'."
      },
      {
        "question": "Complete the sentence: While I was reading, my brother ______ television.",
        "options": [
          "watched",
          "had watched",
          "was watching",
          "watches"
        ],
        "correctAnswer": 2,
        "explanation": "Past Continuous is used for two actions happening simultaneously in the past."
      },
      {
        "question": "Complete the sentence: She ______ in this city for ten years.",
        "options": [
          "has been living",
          "is living",
          "lives",
          "had lived"
        ],
        "correctAnswer": 0,
        "explanation": "Present Perfect Continuous ('has been living') is used for an action that started in the past and is still continuing now."
      },
      {
        "question": "Choose the correct sentence for a spontaneous decision.",
        "options": [
          "I am going to close the window.",
          "I'll close the window.",
          "I close the window.",
          "I am closing the window."
        ],
        "correctAnswer": 1,
        "explanation": "'Will' is used for spontaneous decisions made at the moment of speaking. For example, if you suddenly feel a cold draft."
      },
      {
        "question": "Complete the sentence: By 2030, they ______ a cure for the disease.",
        "options": [
          "will discover",
          "are discovering",
          "will be discovering",
          "will have discovered"
        ],
        "correctAnswer": 3,
        "explanation": "Future Perfect ('will have discovered') is used for an action that will be completed before a specific time in the future."
      }
    ],
    "subjectVerbAgreementQuiz": [
      {
        "question": "Choose the correct verb: A bouquet of yellow roses ___ color and fragrance to the room.",
        "options": [
          "lend",
          "lends"
        ],
        "correctAnswer": 1,
        "explanation": "The subject is 'bouquet' (singular), not 'roses' (plural). Therefore, the singular verb 'lends' is correct."
      },
      {
        "question": "Choose the correct verb: Neither the serving bowl nor the plates ___ on that shelf.",
        "options": [
          "go",
          "goes"
        ],
        "correctAnswer": 0,
        "explanation": "When subjects are joined by 'neither/nor', the verb agrees with the subject closest to it. 'Plates' is plural, so 'go' is correct."
      },
      {
        "question": "Choose the correct verb: The politician, along with the newsmen, ___ expected shortly.",
        "options": [
          "is",
          "are"
        ],
        "correctAnswer": 0,
        "explanation": "Phrases like 'along with', 'as well as', etc., are not part of the subject. The subject is 'politician' (singular), so the verb is 'is'."
      },
      {
        "question": "Choose the correct verb: A lot of the pie ___ disappeared.",
        "options": [
          "has",
          "have"
        ],
        "correctAnswer": 0,
        "explanation": "With words indicating portions (like 'a lot'), the verb agrees with the object of the preposition 'of'. 'Pie' is singular, so the verb is 'has'."
      }
    ],
    "sentenceFragmentsQuiz": [
      {
        "question": "Which of the following is a sentence fragment?",
        "options": [
          "He ran.",
          "Because the dog was barking loudly.",
          "The game ended.",
          "Stop!"
        ],
        "correctAnswer": 1,
        "explanation": "'Because the dog was barking loudly' is a dependent clause. It has a subject and verb but doesn't express a complete thought."
      },
      {
        "question": "What is the best way to fix the fragment: 'After I finished my homework.'?",
        "options": [
          "Add a period at the end.",
          "Attach it to an independent clause, like 'After I finished my homework, I watched TV.'",
          "Remove the word 'After'.",
          "Change 'finished' to 'finish'."
        ],
        "correctAnswer": 1,
        "explanation": "A dependent clause must be connected to an independent clause to form a complete sentence."
      },
      {
        "question": "A complete sentence must have a subject, a verb, and what else?",
        "options": [
          "A capital letter.",
          "An object.",
          "A complete thought.",
          "At least five words."
        ],
        "correctAnswer": 2,
        "explanation": "A complete sentence (or independent clause) must be able to stand on its own and make sense."
      }
    ],
    "wordFormationQuiz": [
      {
        "question": "What is the noun form of the verb 'achieve'?",
        "options": [
          "achievable",
          "achieving",
          "achievement",
          "achiever"
        ],
        "correctAnswer": 2,
        "explanation": "'Achievement' is the noun that represents the result of achieving something."
      },
      {
        "question": "Complete the sentence: He showed great ___ in his work. (creative)",
        "options": [
          "creation",
          "creatively",
          "creativity",
          "create"
        ],
        "correctAnswer": 2,
        "explanation": "The sentence requires a noun to follow 'great'. 'Creativity' is the noun form."
      },
      {
        "question": "What is the adjective form of the noun 'danger'?",
        "options": [
          "dangerously",
          "endanger",
          "dangerous",
          "dangers"
        ],
        "correctAnswer": 2,
        "explanation": "'Dangerous' is the adjective used to describe something that has danger."
      },
      {
        "question": "What is the adverb form of the adjective 'quick'?",
        "options": [
          "quicken",
          "quickness",
          "quickly",
          "quicker"
        ],
        "correctAnswer": 2,
        "explanation": "Adverbs often end in '-ly' and describe how an action is performed. 'Quickly' is the correct adverb."
      }
    ],
    "academicWordList1Quiz": [
      {
        "question": "Which word means 'markedly different from an accepted norm'?",
        "options": [
          "Aesthetic",
          "Aberrant",
          "Aggregate",
          "Ambiguous"
        ],
        "correctAnswer": 1,
        "explanation": "'Aberrant' describes something that deviates from what is normal or expected."
      },
      {
        "question": "If a plot is 'ambiguous', it is...",
        "options": [
          "Exciting",
          "Clear",
          "Having more than one possible meaning",
          "Boring"
        ],
        "correctAnswer": 2,
        "explanation": "Something that is ambiguous is open to more than one interpretation."
      },
      {
        "question": "What is 'antipathy'?",
        "options": [
          "A feeling of intense dislike",
          "A feeling of mixed emotions",
          "A feeling of sympathy",
          "A feeling of joy"
        ],
        "correctAnswer": 0,
        "explanation": "'Antipathy' is a deep-seated feeling of dislike or aversion."
      },
      {
        "question": "An 'audacious' plan is one that is...",
        "options": [
          "Careful and cautious",
          "Simple and easy",
          "Bold and risky",
          "Secretive"
        ],
        "correctAnswer": 2,
        "explanation": "Audacious means showing a willingness to take surprisingly bold risks."
      },
      {
        "question": "A 'banal' story is...",
        "options": [
          "Original and fresh",
          "Full of complex characters",
          "Tragic and sad",
          "Boringly ordinary and unoriginal"
        ],
        "correctAnswer": 3,
        "explanation": "Banal is used to describe something that is so lacking in originality as to be obvious and boring."
      },
      {
        "question": "To 'apprise' someone of a situation is to...",
        "options": [
          "Ask them for help",
          "Hide information from them",
          "Inform them",
          "Criticize them"
        ],
        "correctAnswer": 2,
        "explanation": "To apprise someone is to inform or tell them something."
      },
      {
        "question": "What is the best synonym for 'beneficent'?",
        "options": [
          "Harmful",
          "Selfish",
          "Kind and generous",
          "Wealthy"
        ],
        "correctAnswer": 2,
        "explanation": "Beneficent means doing or producing good; it is associated with kindness and charity."
      },
      {
        "question": "A 'boorish' person is someone who is...",
        "options": [
          "Polite and well-mannered",
          "Shy and quiet",
          "Rough and bad-mannered",
          "Educated and intelligent"
        ],
        "correctAnswer": 2,
        "explanation": "Boorish behavior is ill-mannered and coarse."
      },
      {
        "question": "An 'autonomous' entity is...",
        "options": [
          "Dependent on others",
          "Controlled by the government",
          "Part of a larger group",
          "Independent and self-governing"
        ],
        "correctAnswer": 3,
        "explanation": "Autonomous means having the freedom to govern itself or control its own affairs."
      },
      {
        "question": "If you 'aver' something, you...",
        "options": [
          "Question it",
          "Declare it to be true",
          "Deny it",
          "Whisper it"
        ],
        "correctAnswer": 1,
        "explanation": "To aver is to state or assert something strongly and confidently."
      }
    ],
    "compareContrastQuiz": [
      {
        "question": "Which method of organizing a compare/contrast paragraph discusses one subject completely before moving to the next?",
        "options": [
          "Point-by-Point Method",
          "Block Method",
          "Chronological Method",
          "Cause-Effect Method"
        ],
        "correctAnswer": 1,
        "explanation": "The Block Method (or Subject-by-Subject) presents all points for Subject A, and then all points for Subject B."
      },
      {
        "question": "The word 'whereas' is a transitional device used to signal what?",
        "options": [
          "Comparison",
          "Example",
          "Contrast",
          "Conclusion"
        ],
        "correctAnswer": 2,
        "explanation": "'Whereas' is used to highlight a difference or contrast between two things."
      },
      {
        "question": "What is the primary purpose of a comparison paragraph?",
        "options": [
          "To explain differences",
          "To explain similarities",
          "To tell a story",
          "To argue a point"
        ],
        "correctAnswer": 1,
        "explanation": "A comparison paragraph's main goal is to explain how two or more subjects are alike."
      }
    ],
    "argumentativeParagraphQuiz": [
      {
        "question": "What are the two core components of an argumentative paragraph?",
        "options": [
          "Topic and conclusion",
          "Claims and evidence",
          "Introduction and summary",
          "Opinions and feelings"
        ],
        "correctAnswer": 1,
        "explanation": "An argument consists of a claim (your opinion or stance) which is supported by evidence (facts, examples, expert research)."
      },
      {
        "question": "What is the purpose of a counter-argument in an argumentative paragraph?",
        "options": [
          "To confuse the reader",
          "To introduce a new topic",
          "To acknowledge and refute an opposing viewpoint",
          "To summarize the main points"
        ],
        "correctAnswer": 2,
        "explanation": "Addressing a counter-argument shows you've considered other perspectives and strengthens your own position by showing why it's superior."
      },
      {
        "question": "Which transitional word is best for introducing a conclusion?",
        "options": [
          "First",
          "However",
          "For example",
          "Therefore"
        ],
        "correctAnswer": 3,
        "explanation": "'Therefore' signals that a conclusion is being drawn based on the evidence presented."
      }
    ],
    "processAnalysisParagraphQuiz": [
      {
        "question": "A process analysis paragraph that explains how to do something (e.g., 'How to Bake a Cake') is called:",
        "options": [
          "Informative",
          "Argumentative",
          "Directive",
          "Descriptive"
        ],
        "correctAnswer": 2,
        "explanation": "A 'directive' process analysis gives instructions for the reader to follow."
      },
      {
        "question": "What is the most crucial organizational pattern for a process analysis paragraph?",
        "options": [
          "Order of importance",
          "Spatial order",
          "Compare and contrast",
          "Chronological order"
        ],
        "correctAnswer": 3,
        "explanation": "The steps in a process must be explained in the order they are performed for the instructions to be clear and successful."
      },
      {
        "question": "Which of the following transitional words would be most common in a process analysis paragraph?",
        "options": [
          "Similarly",
          "In contrast",
          "Next",
          "For this reason"
        ],
        "correctAnswer": 2,
        "explanation": "'Next' is a key word for showing the sequence of steps in a process."
      }
    ],
    "coverLetterCvQuiz": [
      {
        "question": "What is the primary purpose of a cover letter?",
        "options": [
          "To list your complete work history",
          "To provide additional, detailed information on why you are qualified for a specific job",
          "To give a list of references",
          "To state your salary expectations"
        ],
        "correctAnswer": 1,
        "explanation": "A cover letter complements your resume by providing context and showing your specific interest and qualifications for the job you are applying for."
      },
      {
        "question": "A Curriculum Vitae (CV) is most commonly used in which field?",
        "options": [
          "Retail",
          "Construction",
          "Academia",
          "Hospitality"
        ],
        "correctAnswer": 2,
        "explanation": "A CV provides a comprehensive statement of educational background, teaching, and research experience, making it the standard in academic settings."
      },
      {
        "question": "If an employer does not specifically ask for a cover letter, what is the best practice?",
        "options": [
          "Do not send one.",
          "Send one anyway to show extra effort.",
          "Send a very short email instead.",
          "Send your resume twice."
        ],
        "correctAnswer": 1,
        "explanation": "The text states, 'Even if the company doesn’t ask for one, you may want to include one anyway. It will show that you have put some extra effort into your application.'"
      }
    ],
    "formalLetterQuiz": [
      {
        "question": "When the recipient's name is unknown, what is the correct formal salutation?",
        "options": [
          "Hey there,",
          "To Whom It May Concern:",
          "Dear friend,",
          "Hello,"
        ],
        "correctAnswer": 1,
        "explanation": "'To Whom It May Concern:' or 'Dear Sir or Madam' are the standard formal salutations for an unknown recipient."
      },
      {
        "question": "What should the first paragraph of a formal letter do?",
        "options": [
          "Provide all the detailed evidence.",
          "State the purpose of the letter.",
          "Repeat your contact information.",
          "Offer a concluding thought."
        ],
        "correctAnswer": 1,
        "explanation": "The first paragraph should be short and immediately state why you are writing (to make an enquiry, complain, request something, etc.)."
      },
      {
        "question": "In a formal business letter, the recipient's name in the salutation is followed by a:",
        "options": [
          "Comma (,)",
          "Semicolon (;)",
          "Period (.)",
          "Colon (:)"
        ],
        "correctAnswer": 3,
        "explanation": "The text notes that 'the person's name is always followed by a colon (:) in a business letter, and not a comma.'"
      }
    ],
    "runOnsQuiz": [
      {
        "question": "Which of the following is a run-on (fused) sentence?",
        "options": [
          "I like learning English, but it makes me tired.",
          "I like learning English it makes me tired.",
          "I like learning English; it makes me tired.",
          "I like learning English. It makes me tired."
        ],
        "correctAnswer": 1,
        "explanation": "A run-on sentence incorrectly joins two complete sentences with no punctuation or conjunction."
      },
      {
        "question": "What is a 'comma splice'?",
        "options": [
          "Using too many commas in one sentence.",
          "Incorrectly joining two complete sentences with only a comma.",
          "Forgetting to use a comma before a conjunction.",
          "A type of run-on with no punctuation."
        ],
        "correctAnswer": 1,
        "explanation": "A comma splice is the error of using just a comma to connect two independent clauses, like: 'My favorite spread is hummus, it is very garlicky.'"
      },
      {
        "question": "Which of these is NOT a correct way to fix the following run-on: 'The storm passed quickly it caused a lot of damage.'",
        "options": [
          "The storm passed quickly, it caused a lot of damage.",
          "The storm passed quickly; it caused a lot of damage.",
          "The storm passed quickly, and it caused a lot of damage.",
          "The storm passed quickly. It caused a lot of damage."
        ],
        "correctAnswer": 0,
        "explanation": "Adding only a comma creates a comma splice, which is still an error. All the other options are valid ways to correct a run-on."
      }
    ],
    "modifierQuiz": [
      {
        "question": "Identify the error in: 'Expecting confusion, our plans were made.'",
        "options": [
          "Misplaced Modifier",
          "Dangling Modifier",
          "No Error",
          "Comma Splice"
        ],
        "correctAnswer": 1,
        "explanation": "This is a dangling modifier because the doer of the action 'Expecting confusion' is not stated. Who was expecting? The plans weren't."
      },
      {
        "question": "Identify the error in: 'I showed my dog to the veterinarian with the fleas.'",
        "options": [
          "Misplaced Modifier",
          "Dangling Modifier",
          "No Error",
          "Run-on Sentence"
        ],
        "correctAnswer": 0,
        "explanation": "This is a misplaced modifier. The phrase 'with the fleas' logically describes the dog, but it is placed next to 'veterinarian', incorrectly suggesting the vet has fleas."
      },
      {
        "question": "Identify the error in: 'Swimming out into the sea, the current grew stronger.'",
        "options": [
          "Misplaced Modifier",
          "Dangling Modifier",
          "No Error",
          "Spelling Error"
        ],
        "correctAnswer": 1,
        "explanation": "This is a dangling modifier. The sentence implies the 'current' was swimming. The actual swimmer is not mentioned."
      },
      {
        "question": "Identify the error in: 'This typewriter is used by a secretary with a wide carriage.'",
        "options": [
          "Misplaced Modifier",
          "Dangling Modifier",
          "No Error",
          "Punctuation Error"
        ],
        "correctAnswer": 0,
        "explanation": "This is a misplaced modifier. The phrase 'with a wide carriage' is placed next to 'secretary', but it should describe the 'typewriter'."
      }
    ],
    "parallelismQuiz": [
      {
        "question": "Which sentence has faulty parallelism?",
        "options": [
          "She likes running, swimming, and hiking.",
          "He wanted to read, write, and listen.",
          "They enjoy playing soccer and to watch movies.",
          "The tasks are to code, test, and deploy."
        ],
        "correctAnswer": 2,
        "explanation": "The sentence mixes a gerund ('playing') with an infinitive ('to watch'). It should be 'playing soccer and watching movies' to be parallel."
      },
      {
        "question": "Choose the sentence with correct parallel structure.",
        "options": [
          "The production manager was asked to write his report quickly, accurately, and in a detailed manner.",
          "The production manager was asked to write his report quickly, with accuracy, and thoroughly.",
          "The production manager was asked to write his report quickly, accurately, and thoroughly.",
          "The production manager was asked to write a quick report, accurately, and thoroughly."
        ],
        "correctAnswer": 2,
        "explanation": "This sentence correctly uses a parallel series of adverbs: 'quickly', 'accurately', and 'thoroughly'."
      },
      {
        "question": "Which sentence correctly uses 'either...or'?",
        "options": [
          "You can either pay now or you can pay later.",
          "Either you can pay now or pay later.",
          "You can either pay now or later.",
          "You either can pay now or pay later."
        ],
        "correctAnswer": 2,
        "explanation": "The elements following 'either' (pay now) and 'or' (later) are parallel in function. The most concise correct form is 'either pay now or later'."
      },
      {
        "question": "Which sentence maintains parallelism in a comparison?",
        "options": [
          "The football team at Western is better than Queen’s.",
          "The football team at Western is better than the team at Queen’s.",
          "Playing football is better than to watch a game.",
          "To play football is better than watching a game."
        ],
        "correctAnswer": 1,
        "explanation": "This sentence correctly compares two similar nouns: 'the football team at Western' and 'the team at Queen’s'. Comparing a team to a whole university is a faulty comparison."
      }
    ],
    "confusingWordPairsQuiz": [
      {
        "question": "The weather will ___ our plans for the picnic.",
        "options": [
          "affect",
          "effect"
        ],
        "correctAnswer": 0,
        "explanation": "'Affect' is the verb meaning 'to influence'. 'Effect' is usually a noun meaning 'result'."
      },
      {
        "question": "I like all of those colors ___ for the blue one.",
        "options": [
          "accept",
          "except"
        ],
        "correctAnswer": 1,
        "explanation": "'Except' is a preposition meaning 'excluding'. 'Accept' is a verb meaning 'to receive'."
      },
      {
        "question": "___ going to the party later.",
        "options": [
          "There",
          "Their",
          "They're"
        ],
        "correctAnswer": 2,
        "explanation": "'They're' is a contraction for 'they are'. 'Their' is possessive, and 'there' refers to a place."
      },
      {
        "question": "This is a matter of ___, not of law.",
        "options": [
          "principal",
          "principle"
        ],
        "correctAnswer": 1,
        "explanation": "'Principle' is a noun meaning a fundamental truth or rule. 'Principal' means the head of a school or 'most important'."
      },
      {
        "question": "The bird has broken ___ wing.",
        "options": [
          "its",
          "it's"
        ],
        "correctAnswer": 0,
        "explanation": "'Its' is the possessive pronoun. 'It's' is a contraction for 'it is' or 'it has'."
      },
      {
        "question": "Please ___ the book on the table.",
        "options": [
          "lay",
          "lie"
        ],
        "correctAnswer": 0,
        "explanation": "'Lay' means 'to place' and takes an object ('the book'). 'Lie' means 'to recline' and does not take an object."
      },
      {
        "question": "I am taller ___ my brother.",
        "options": [
          "than",
          "then"
        ],
        "correctAnswer": 0,
        "explanation": "'Than' is used for comparisons. 'Then' refers to time."
      },
      {
        "question": "We visited several tourist ___ on our trip.",
        "options": [
          "cites",
          "sites",
          "sights"
        ],
        "correctAnswer": 1,
        "explanation": "'Site' means a place. 'Cite' means to quote, and 'sight' relates to vision."
      },
      {
        "question": "The magician created an optical ___.",
        "options": [
          "allusion",
          "illusion"
        ],
        "correctAnswer": 1,
        "explanation": "An 'illusion' is a false perception. An 'allusion' is an indirect reference."
      },
      {
        "question": "Can you offer me some ___?",
        "options": [
          "council",
          "counsel"
        ],
        "correctAnswer": 1,
        "explanation": "'Counsel' means advice. 'Council' is a group of people."
      }
    ],
    "phrasalVerbsQuiz": [
      {
        "question": "I need to ___ my phone; it's completely out of juice.",
        "options": [
          "turn on",
          "plug in",
          "log in",
          "heat up"
        ],
        "correctAnswer": 1,
        "explanation": "'Plug in' means to connect an electrical device to a power source."
      },
      {
        "question": "What does it mean to 'put up with' something?",
        "options": [
          "To build something",
          "To store something",
          "To tolerate something",
          "To get rid of something"
        ],
        "correctAnswer": 2,
        "explanation": "'To put up with' means to endure or tolerate an annoying or unpleasant situation."
      },
      {
        "question": "He reluctantly ___ to the pressure they were putting on him.",
        "options": [
          "gave in",
          "gave up",
          "worked out",
          "paid back"
        ],
        "correctAnswer": 0,
        "explanation": "'To give in' means to cease fighting or arguing; to admit defeat."
      },
      {
        "question": "When your alarm clock starts ringing, you can say it ___.",
        "options": [
          "goes off",
          "turns on",
          "wakes up",
          "gets up"
        ],
        "correctAnswer": 0,
        "explanation": "The phrasal verb 'go off' is commonly used for alarms starting to sound."
      },
      {
        "question": "After they ___, he didn't leave his house for a week.",
        "options": [
          "fell out",
          "broke up",
          "came down",
          "dozed off"
        ],
        "correctAnswer": 1,
        "explanation": "'To break up' means to end a romantic relationship."
      },
      {
        "question": "We've completely ___ sugar. I need to buy some more.",
        "options": [
          "run out of",
          "looked for",
          "gone for",
          "tidied up"
        ],
        "correctAnswer": 0,
        "explanation": "'To run out of' something means to use all of it and have none left."
      },
      {
        "question": "Could you please ___? I can't hear you.",
        "options": [
          "speak up",
          "chill out",
          "warm up",
          "hang up"
        ],
        "correctAnswer": 0,
        "explanation": "'Speak up' means to talk more loudly."
      },
      {
        "question": "Don't forget to ___ the lights when you leave.",
        "options": [
          "take off",
          "switch on",
          "switch off",
          "put on"
        ],
        "correctAnswer": 2,
        "explanation": "'Switch off' (or 'turn off') is the phrasal verb for deactivating lights. 'Switch on' is the opposite."
      },
      {
        "question": "I can't believe she ___ on me while I was talking!",
        "options": [
          "picked up",
          "hung up",
          "talked back",
          "looked after"
        ],
        "correctAnswer": 1,
        "explanation": "'To hang up on someone' means to end a phone call abruptly while they are still talking."
      },
      {
        "question": "It's important to ___ before you do any strenuous exercise.",
        "options": [
          "work out",
          "warm up",
          "chill out",
          "doze off"
        ],
        "correctAnswer": 1,
        "explanation": "'To warm up' means to prepare for physical exertion by exercising gently beforehand."
      }
    ],
    "academicWordList2Quiz": [
      {
        "question": "What does 'inconsequential' mean?",
        "options": [
          "Very important",
          "Difficult to understand",
          "Lacking worth or importance",
          "Happening in sequence"
        ],
        "correctAnswer": 2,
        "explanation": "Something inconsequential is not important or significant."
      },
      {
        "question": "If someone is 'indolent', they are...",
        "options": [
          "Energetic",
          "Generous",
          "Clever",
          "Lazy"
        ],
        "correctAnswer": 3,
        "explanation": "Indolent means wanting to avoid activity or exertion; lazy."
      },
      {
        "question": "An 'innocuous' comment is one that is...",
        "options": [
          "Harmful",
          "Offensive",
          "Harmless",
          "Witty"
        ],
        "correctAnswer": 2,
        "explanation": "Innocuous means not harmful or offensive."
      },
      {
        "question": "A 'laconic' reply is...",
        "options": [
          "Long and detailed",
          "Rude and abrupt",
          "Brief and to the point",
          "Emotional and passionate"
        ],
        "correctAnswer": 2,
        "explanation": "Laconic describes using very few words."
      },
      {
        "question": "To 'mitigate' a problem means to...",
        "options": [
          "Make it worse",
          "Ignore it",
          "Make it less severe",
          "Solve it completely"
        ],
        "correctAnswer": 2,
        "explanation": "To mitigate means to make something bad less severe, serious, or painful."
      },
      {
        "question": "A 'neophyte' in a subject is a...",
        "options": [
          "Beginner",
          "Expert",
          "Teacher",
          "Critic"
        ],
        "correctAnswer": 0,
        "explanation": "A neophyte is a person who is new to a subject, skill, or belief."
      },
      {
        "question": "A 'perfunctory' action is done...",
        "options": [
          "With great care and detail",
          "With enthusiasm",
          "With minimum effort or reflection",
          "With help from others"
        ],
        "correctAnswer": 2,
        "explanation": "Perfunctory means carried out with a minimum of effort; hasty."
      },
      {
        "question": "A 'pragmatic' approach is one that is...",
        "options": [
          "Idealistic",
          "Complicated",
          "Theoretical",
          "Practical"
        ],
        "correctAnswer": 3,
        "explanation": "Pragmatic means dealing with things sensibly and realistically in a way that is based on practical rather than theoretical considerations."
      },
      {
        "question": "To 'refute' an argument is to...",
        "options": [
          "Agree with it",
          "Repeat it",
          "Prove it to be wrong",
          "Simplify it"
        ],
        "correctAnswer": 2,
        "explanation": "To refute an argument or statement is to prove that it is wrong or false."
      },
      {
        "question": "A 'verbose' writer is someone who...",
        "options": [
          "Uses too few words",
          "Uses too many words",
          "Writes about verbs",
          "Writes clearly"
        ],
        "correctAnswer": 1,
        "explanation": "Verbose means using or expressed in more words than are needed."
      }
    ]
  },
  "wordLists": {
    "confusingWordPairsData": [
      {
        "pair": "Accept/Except",
        "words": [
          {
            "word": "accept",
            "definition": "A verb meaning “to agree to” or “to receive”",
            "example": "I accept your apology."
          },
          {
            "word": "except",
            "definition": "A preposition meaning “excluding”",
            "example": "I like all vegetables except broccoli."
          }
        ]
      },
      {
        "pair": "Affect/Effect",
        "words": [
          {
            "word": "affect",
            "definition": "A verb meaning “to influence”",
            "example": "Will missing class affect my grade?"
          },
          {
            "word": "effect",
            "definition": "A noun meaning “result” or a verb meaning “to cause”",
            "example": "The effect of missing class will be a lower grade. (noun) Only the supervisor could effect change to the rules. (verb)"
          }
        ]
      },
      {
        "pair": "Allusion/Illusion",
        "words": [
          {
            "word": "allusion",
            "definition": "A noun describing an indirect reference to something",
            "example": "The speaker made an allusion to a Greek myth."
          },
          {
            "word": "illusion",
            "definition": "A noun indicating something that misleads or gives a false meaning or appearance",
            "example": "A magician uses illusion to entertain the audience."
          }
        ]
      },
      {
        "pair": "Cite/Site/Sight",
        "words": [
          {
            "word": "cite",
            "definition": "A verb meaning “to quote an example or authority”",
            "example": "You must cite all of your sources in your research paper."
          },
          {
            "word": "site",
            "definition": "A noun meaning “a particular place”",
            "example": "We visited several tourist sites."
          },
          {
            "word": "sight",
            "definition": "A noun describing the function of “seeing”",
            "example": "Human beings have five senses: sight, touch, taste, sound, and smell."
          }
        ]
      },
      {
        "pair": "Compliment/Complement",
        "words": [
          {
            "word": "compliment",
            "definition": "A noun that means “an expression of flattery, praise, or admiration”",
            "example": "Her compliment of my new dress made me smile."
          },
          {
            "word": "complement",
            "definition": "A noun that means “to complete” or “to add to” something",
            "example": "Butter is the perfect complement for bread."
          }
        ]
      },
      {
        "pair": "Council/Counsel",
        "words": [
          {
            "word": "council",
            "definition": "A noun meaning “a group of people who meet together to make decisions”",
            "example": "Kamri was elected president of the school’s student council."
          },
          {
            "word": "counsel",
            "definition": "A noun meaning “advice” or a verb meaning “to advise”",
            "example": "My mom gave me good counsel about living on my own. (noun) She counseled me to not procrastinate my homework. (verb)"
          }
        ]
      },
      {
        "pair": "Explicit/Implicit",
        "words": [
          {
            "word": "explicit",
            "definition": "An adjective meaning “direct”",
            "example": "Professor Anderson gave explicit instructions for writing the paper."
          },
          {
            "word": "implicit",
            "definition": "An adjective meaning “implied”",
            "example": "Her description of the party contained an implicit insult of the host."
          }
        ]
      },
      {
        "pair": "Farther/Further",
        "words": [
          {
            "word": "farther",
            "definition": "An adjective that describes an actual distance",
            "example": "My house is farther from campus than yours."
          },
          {
            "word": "further",
            "definition": "An adjective meaning “more distant in degree, time, space, or quantity”",
            "example": "Nothing could be further from the truth."
          }
        ]
      },
      {
        "pair": "Fewer/Less",
        "words": [
          {
            "word": "fewer",
            "definition": "An adjective meaning “a small number” that refers to things that can be counted",
            "example": "Children have fewer teeth than adults."
          },
          {
            "word": "less",
            "definition": "An adjective meaning “little” that refers to a general amount or non-countable measurement",
            "example": "I prefer less salt on my popcorn."
          }
        ]
      },
      {
        "pair": "Good/Well",
        "words": [
          {
            "word": "good",
            "definition": "An adjective meaning “suitable”",
            "example": "It was a good movie."
          },
          {
            "word": "well",
            "definition": "An adverb meaning “in a proper manner”",
            "example": "She plays basketball well."
          }
        ]
      },
      {
        "pair": "Imply/Infer",
        "words": [
          {
            "word": "imply",
            "definition": "A verb meaning “to suggest or state indirectly” (refers to the speaker)",
            "example": "He implied that I wasn’t capable of completing the job."
          },
          {
            "word": "infer",
            "definition": "A verb meaning “to conclude” (refers to the listener)",
            "example": "I inferred there was trouble from the sight of the police cars."
          }
        ]
      },
      {
        "pair": "Its/It’s",
        "words": [
          {
            "word": "its",
            "definition": "A personal possessive pronoun of “it”",
            "example": "The bird broke its wing."
          },
          {
            "word": "it’s",
            "definition": "A contraction meaning “it is” or “it has”",
            "example": "Unfortunately, it’s time to leave."
          }
        ]
      },
      {
        "pair": "Lay/Lie",
        "words": [
          {
            "word": "lay",
            "definition": "A verb that means “to put or place” and that needs a direct object",
            "example": "Lay the book on the table."
          },
          {
            "word": "lie",
            "definition": "A verb that means “to rest or recline” and that takes no direct object",
            "example": "I’m going to lie down for a while."
          }
        ]
      },
      {
        "pair": "Loose/Lose",
        "words": [
          {
            "word": "loose",
            "definition": "An adjective meaning “not tight”",
            "example": "I like to wear loose clothing."
          },
          {
            "word": "lose",
            "definition": "A verb that means “to misplace” or “to be defeated”",
            "example": "I hate it when I lose my keys."
          }
        ]
      },
      {
        "pair": "May be/Maybe",
        "words": [
          {
            "word": "may be",
            "definition": "A verb phrase meaning “it might be possible”",
            "example": "The storm may be more hazardous than we thought."
          },
          {
            "word": "maybe",
            "definition": "An adverb showing possibility",
            "example": "Maybe you should go to the doctor."
          }
        ]
      },
      {
        "pair": "Principal/Principle",
        "words": [
          {
            "word": "principal",
            "definition": "A noun meaning “the head of a school” or an adjective meaning “most important”",
            "example": "Mrs. Smith, the principal of the school, is a very energetic woman. (noun)"
          },
          {
            "word": "principle",
            "definition": "A noun meaning “a basic truth”",
            "example": "Lying is against my principles."
          }
        ]
      },
      {
        "pair": "Quite/Quiet/Quit",
        "words": [
          {
            "word": "quite",
            "definition": "An adverb meaning “whole” or “complete”",
            "example": "He is quite thorough in his calculations."
          },
          {
            "word": "quiet",
            "definition": "An adjective meaning “not making noise”",
            "example": "Please be quiet; the baby is sleeping."
          },
          {
            "word": "quit",
            "definition": "A verb meaning “to stop” or “give up”",
            "example": "I quit my job last Thursday."
          }
        ]
      },
      {
        "pair": "Set/Sit",
        "words": [
          {
            "word": "set",
            "definition": "A verb meaning “to place” and requiring a direct object",
            "example": "Ashley set her books on the table."
          },
          {
            "word": "sit",
            "definition": "A verb meaning “to be seated” and that takes no direct object",
            "example": "Come sit by me."
          }
        ]
      },
      {
        "pair": "Than/Then",
        "words": [
          {
            "word": "than",
            "definition": "A conjunction introducing a second element in a comparison",
            "example": "I am taller than my sister."
          },
          {
            "word": "then",
            "definition": "An adverb meaning “at that time,” “next,” or “after”",
            "example": "He picked up the tickets, and then he picked up his date."
          }
        ]
      },
      {
        "pair": "There/Their/They’re",
        "words": [
          {
            "word": "there",
            "definition": "An adverb meaning “in that place”",
            "example": "Put the books down there."
          },
          {
            "word": "their",
            "definition": "A personal possessive pronoun for “they”",
            "example": "It’s their fault!"
          },
          {
            "word": "they’re",
            "definition": "A contraction for “they are”",
            "example": "They’re going to eat dinner at seven."
          }
        ]
      },
      {
        "pair": "Thorough/Through/Threw",
        "words": [
          {
            "word": "thorough",
            "definition": "An adjective meaning “complete in all respects”",
            "example": "Steve did a thorough job washing my car."
          },
          {
            "word": "through",
            "definition": "A preposition meaning “in one side and out another side”",
            "example": "To get to my apartment, you must drive through the tunnel."
          },
          {
            "word": "threw",
            "definition": "The irregular past tense form of the verb “throw”",
            "example": "Chris threw the ball at me."
          }
        ]
      },
      {
        "pair": "To/Too/Two",
        "words": [
          {
            "word": "to",
            "definition": "Either a preposition or the initial part of an infinitive verb phrase",
            "example": "My mom sent me to the store. (preposition)"
          },
          {
            "word": "too",
            "definition": "An adverb meaning “also”",
            "example": "I like dancing, and I like singing, too."
          },
          {
            "word": "two",
            "definition": "The number 2",
            "example": "I have two dogs."
          }
        ]
      },
      {
        "pair": "Weather/Whether",
        "words": [
          {
            "word": "weather",
            "definition": "A noun referring to the condition of the atmosphere",
            "example": "We are having unusual weather for this time of year."
          },
          {
            "word": "whether",
            "definition": "A conjunction that indicates a choice between things",
            "example": "Sarah couldn’t decide whether she should go to the dance or stay home."
          }
        ]
      },
      {
        "pair": "Whose/Who’s",
        "words": [
          {
            "word": "whose",
            "definition": "A personal possessive pronoun for “who”",
            "example": "Whose book is that anyway?"
          },
          {
            "word": "who’s",
            "definition": "A contraction for “who is” or “who has”",
            "example": "Who’s here?"
          }
        ]
      },
      {
        "pair": "Your/You’re",
        "words": [
          {
            "word": "your",
            "definition": "A personal possessive pronoun for “you”",
            "example": "Is that your new car?"
          },
          {
            "word": "you’re",
            "definition": "A contraction for “you are”",
            "example": "You’re a good friend."
          }
        ]
      }
    ],
    "phrasalVerbsData": [
      {
        "verb": "Pick up",
        "meaning": "answer a telephone call.",
        "example": "I kept calling her but she wouldn't pick up, so I couldn't tell her the news."
      },
      {
        "verb": "Speak up",
        "meaning": "talk more loudly.",
        "example": "(On the phone) Could you speak up, please? I can't hear you properly."
      },
      {
        "verb": "Hang up (on sb.)",
        "meaning": "end a telephone call.",
        "example": "She hung up on me when I told her what I'd done."
      },
      {
        "verb": "Chill out",
        "meaning": "calm down and relax.",
        "example": "At the end of the day, I just want to put my feet up and chill out before going to bed."
      },
      {
        "verb": "Doze off",
        "meaning": "fall lightly asleep.",
        "example": "I don't take a real nap after lunch, I simply doze off for a bit in front of the TV."
      },
      {
        "verb": "Run out of (sth.)",
        "meaning": "finish one’s supply of something.",
        "example": "We've run out of eggs; could you go and get some more, please?"
      },
      {
        "verb": "Put sth. back",
        "meaning": "replace something.",
        "example": "Remember to put the books back on the shelves when you finish reading them."
      },
      {
        "verb": "Look after sb./sth.",
        "meaning": "take care of something or someone.",
        "example": "I normally ask my parents to look after my dog when I'm on holiday abroad."
      },
      {
        "verb": "Talk back to sb.",
        "meaning": "reply defiantly or insolently.",
        "example": "Unfortunately, all children talk back to their parents from time to time."
      },
      {
        "verb": "Go for sth.",
        "meaning": "decide on something; choose.",
        "example": "(In a restaurant) I think I'll go for the steak this time. I didn't like the fish the other day."
      },
      {
        "verb": "Break up (with sb.)",
        "meaning": "end a romantic relationship with someone.",
        "example": "After they broke up, he didn't leave his house for a week."
      },
      {
        "verb": "Break (sth.) down",
        "meaning": "stop or cause to stop functioning.",
        "example": "My TV seems to be breaking down all the time."
      },
      {
        "verb": "Hang (sth.) out (to dry)",
        "meaning": "hang from a clothes line to dry.",
        "example": "I don't mind ironing, but I hate hanging the clothes out to dry."
      },
      {
        "verb": "Wash (sth.) up",
        "meaning": "clean crockery and cutlery after use.",
        "example": "I don't have to wash up any more; I bought myself a dishwasher."
      },
      {
        "verb": "Warm sth. up",
        "meaning": "reheat previously cooked food or drink.",
        "example": "I sometimes have to warm up my coffee because it takes me a whole morning to drink it."
      },
      {
        "verb": "Heat sth. up",
        "meaning": "make or become hot or warm.",
        "example": "I think we can heat up yesterday's pizza and have it for dinner, right?"
      },
      {
        "verb": "Look for sth./sb.",
        "meaning": "try to find something or someone.",
        "example": "Jack was looking for his phone everywhere, but couldn't find it."
      },
      {
        "verb": "Fall out with sb.",
        "meaning": "have an argument and stop being friends.",
        "example": "They were flat mates for two years, but then they fell out and never spoke to each other again."
      },
      {
        "verb": "Come down with (an illness)",
        "meaning": "begin to suffer from a specified illness.",
        "example": "Oh, god! I think I'm coming down with flu. I might not go to work tomorrow."
      },
      {
        "verb": "Tear sth. out",
        "meaning": "to pull or be pulled apart, or to pull pieces off.",
        "example": "He tore out the pages that he didn't want anyone to read."
      },
      {
        "verb": "Rip sth. up",
        "meaning": "tear something violently into small pieces so as to destroy it.",
        "example": "She ripped up her pile of old letters and put them in the bin."
      },
      {
        "verb": "Plug sth. in",
        "meaning": "connect an electrical appliance to the mains by inserting a plug in a socket.",
        "example": "I need to plug in my phone; it's completely out of juice."
      },
      {
        "verb": "Pay sb./sth. back",
        "meaning": "repay some money or a loan to someone.",
        "example": "If you lend me the money, I swear I'll pay you back by Friday."
      },
      {
        "verb": "Print sth. out",
        "meaning": "produce a paper copy of information stored on a computer.",
        "example": "My boss asked me to print out the report and give it to him."
      },
      {
        "verb": "Give in (to sb./sth.)",
        "meaning": "accept someone’s wish or cease fighting; admit defeat.",
        "example": "He reluctantly gave in to the pressure they were putting on him."
      },
      {
        "verb": "Work sth. out",
        "meaning": "find or try to find the answer to something; solve a sum or determine an amount by calculation.",
        "example": "I couldn’t work out whether it was a band playing or a record."
      },
      {
        "verb": "Give up",
        "meaning": "stop making an effort; admit defeat.",
        "example": "It's not like you to give up so easily on an assignment so early after starting school."
      },
      {
        "verb": "Put up with sth./sb.",
        "meaning": "tolerate, endure, bear.",
        "example": "I'm leaving so I don't have to put up with you anymore."
      },
      {
        "verb": "Turn sth. on",
        "meaning": "adjust a tap or switch in order to start the operation or flow of something.",
        "example": "She turned her PC on and opened her browser."
      },
      {
        "verb": "Log in",
        "meaning": "go through the procedures to begin use of a computer, database, or system.",
        "example": "I tried to log in with my username, but I couldn't remember my password."
      },
      {
        "verb": "Go off",
        "meaning": "(of an alarm) begin to sound.",
        "example": "From the time my alarm clock goes off, I am beginning my workout."
      },
      {
        "verb": "Wake (sb.) up",
        "meaning": "emerge or cause someone to emerge from sleep.",
        "example": "I woke up at 7 o’clock."
      },
      {
        "verb": "Get (sb.) up",
        "meaning": "rise or cause someone to rise from bed after sleeping.",
        "example": "I got up feeling tired and disoriented."
      },
      {
        "verb": "Put sth. on",
        "meaning": "place a garment, jewellery, etc. on part of one’s body",
        "example": "I put on my watch and set off a little late."
      },
      {
        "verb": "Dress up",
        "meaning": "put on smart or formal clothes.",
        "example": "I only dress up on special occasions, like weddings or other celebrations."
      },
      {
        "verb": "Tidy up (sth.)",
        "meaning": "bring order to; arrange neatly.",
        "example": "The children don't like tidying up their bedrooms, but they always do it."
      },
      {
        "verb": "Switch sth. on",
        "meaning": "start the flow or operation of something by means of a tap, switch, or button.",
        "example": "She switched on the TV to watch her favourite show."
      },
      {
        "verb": "Take sth. off",
        "meaning": "remove clothing from one’s or another’s body.",
        "example": "I took off my shoes and lay down on the sofa."
      },
      {
        "verb": "Warm up",
        "meaning": "prepare for physical exertion or a performance by exercising or practicing gently beforehand.",
        "example": "I always warm up thoroughly before going out for a jog."
      },
      {
        "verb": "Work out",
        "meaning": "engage in vigorous physical exercise.",
        "example": "John tries to work out three or four times a week at the local gym."
      },
      {
        "verb": "Let sb. in",
        "meaning": "admit someone to a room, building, or area.",
        "example": "We let our lovely dog in the house every morning."
      },
      {
        "verb": "Come in",
        "meaning": "enter a room, building, or other place.",
        "example": "Please, come in and sit down."
      },
      {
        "verb": "Move over",
        "meaning": "adjust one’s position to make room for someone else.",
        "example": "Could you guys move over so I can sit down as well, please?"
      },
      {
        "verb": "Kick sb. out",
        "meaning": "expel or dismiss someone.",
        "example": "They kicked me out of the club after the fight."
      },
      {
        "verb": "Drink up",
        "meaning": "quickly consume the rest of a drink.",
        "example": "She drank up what was left of her beer and left in a hurry."
      }
    ],
    "wordFormationData": [
      [
        "accept",
        "acceptance",
        "acceptable",
        ""
      ],
      [
        "achieve",
        "achievement",
        "achievable",
        ""
      ],
      [
        "act",
        "action/activity",
        "active",
        "actively"
      ],
      [
        "add",
        "addition",
        "additional",
        ""
      ],
      [
        "adjust",
        "adjustment",
        "adjustable",
        ""
      ],
      [
        "admire",
        "admiration",
        "admirable",
        ""
      ],
      [
        "advise",
        "advice",
        "advisable",
        ""
      ],
      [
        "amass",
        "mass",
        "massive",
        "massively"
      ],
      [
        "annoy",
        "annoyance",
        "annoying",
        ""
      ],
      [
        "approach",
        "approach",
        "approachable",
        ""
      ],
      [
        "attend",
        "attention",
        "attentive",
        ""
      ],
      [
        "attract",
        "attraction",
        "attractive",
        ""
      ],
      [
        "avoid",
        "avoidance",
        "avoidable",
        ""
      ],
      [
        "believe",
        "belief",
        "believable",
        ""
      ],
      [
        "blacken",
        "blackness",
        "black",
        ""
      ],
      [
        "bleed",
        "blood",
        "bloody",
        ""
      ],
      [
        "bore",
        "boredom",
        "boring",
        ""
      ],
      [
        "breathe",
        "breath",
        "breathing",
        ""
      ],
      [
        "bury",
        "burial",
        "buried",
        ""
      ],
      [
        "care",
        "care",
        "careful",
        "carefully"
      ],
      [
        "challenge",
        "challenge",
        "challenging",
        ""
      ],
      [
        "choose",
        "choice",
        "chosen",
        ""
      ],
      [
        "clear",
        "clarity",
        "clear",
        "clearly"
      ],
      [
        "collect",
        "collection",
        "collective",
        "collectively"
      ],
      [
        "comfort",
        "comfort",
        "comfortable",
        "comfortably"
      ],
      [
        "confuse",
        "confusion",
        "confused",
        ""
      ],
      [
        "continue",
        "continuity",
        "continuous",
        "continuously"
      ],
      [
        "create",
        "creation",
        "creative",
        "creatively"
      ],
      [
        "decide",
        "decision",
        "decisive",
        ""
      ],
      [
        "decorate",
        "decoration",
        "decorative",
        ""
      ],
      [
        "delight",
        "delight",
        "delightful",
        "delightfully"
      ],
      [
        "destroy",
        "destruction",
        "destructive",
        "destructively"
      ],
      [
        "develop",
        "development",
        "developing",
        ""
      ],
      [
        "die",
        "death",
        "dead",
        ""
      ],
      [
        "differ",
        "difference",
        "different",
        "differently"
      ],
      [
        "educate",
        "education",
        "educative",
        ""
      ],
      [
        "encourage",
        "courage",
        "courageous",
        "courageously"
      ],
      [
        "explain",
        "explanation",
        "explainable",
        ""
      ],
      [
        "fascinate",
        "fascination",
        "fascinating",
        ""
      ],
      [
        "fly",
        "flight",
        "flying",
        ""
      ],
      [
        "force",
        "force",
        "forceful",
        "forcefully"
      ],
      [
        "grow",
        "growth",
        "growing",
        "growingly"
      ],
      [
        "harm",
        "harm",
        "harmful",
        "harmfully"
      ],
      [
        "hate",
        "hatred",
        "hateful",
        "hatefully"
      ],
      [
        "heal",
        "health",
        "healthy",
        "healthily"
      ],
      [
        "hope",
        "hope",
        "hopeful",
        "hopefully"
      ],
      [
        "identify",
        "identification/identity",
        "identified/identifying",
        ""
      ],
      [
        "impress",
        "impression",
        "impressive",
        "impressively"
      ],
      [
        "inform",
        "information",
        "informative",
        ""
      ],
      [
        "injure",
        "injury",
        "injurious",
        "injuriously"
      ],
      [
        "instruct",
        "instruction",
        "instructive",
        ""
      ],
      [
        "invent",
        "invention",
        "inventive",
        ""
      ],
      [
        "live",
        "life/liveliness",
        "alive/lively",
        "livingly"
      ],
      [
        "lose",
        "loss",
        "lost",
        ""
      ],
      [
        "move",
        "movement",
        "movable",
        "movingly"
      ],
      [
        "nationalize",
        "nationality/nation",
        "national",
        "nationwide"
      ],
      [
        "observe",
        "observation",
        "observatory",
        ""
      ],
      [
        "perform",
        "performance",
        "performing",
        ""
      ],
      [
        "permit",
        "permission",
        "permissible",
        ""
      ],
      [
        "persuade",
        "persuasion",
        "persuasive",
        ""
      ],
      [
        "please",
        "pleasure",
        "pleasant",
        ""
      ],
      [
        "popularize",
        "popularity",
        "popular",
        ""
      ],
      [
        "quicken",
        "quickness",
        "quick",
        "quickly"
      ],
      [
        "sadden",
        "sadness",
        "sad",
        "sadly"
      ],
      [
        "secure",
        "security",
        "secured",
        "securely"
      ],
      [
        "see",
        "sight/scene",
        "seen/scenic",
        ""
      ],
      [
        "speed",
        "speed",
        "speedy",
        "speedily"
      ]
    ]
  }
}